//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ｉｎｔ＿ｄｓｐ
//　【関数レベル】
//　　　ＬＥＶＥＬ：ＡＬＬ
//  【機能説明】
//      ＤＳＰ割り込み
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      なし
//  【更新履歴】
//      2006.07.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//#define __HPI_DSP_PROG

#include  "custom.h"


void DSP_INT0( void )
{
//2006.11.6 モータ割り込み廃止に伴い下記の記述は無効（割り込みがこない）


	unsigned char fICU = ((TIOIR1 & 0xf0) >> 4);

        if ((AD0SIM0 & 0x04) != 0)
        {
	     //_hpiSetAddress( 0x0000022A );
	     //_hpiPut((ushort)AD0DT0);
	     AD0SIM0 = (AD0SIM0 & 0xfd); //AD変換開始 2006.2.8 ihara
	     AD0SIM0 = (AD0SIM0 | 0x01); //AD変換開始 2006.2.8 ihara
		#if true
			//if(++Timer._ADtimer > 10000){
			//if(++Timer._ADtimer > 10){
				//if(LED10){
				//	LED10 = false;
				//}
				//else{
			//		LED10 = true;
				//}
				//Timer._ADtimer = 0;
			//}
		#endif

        }


	if ((fICU & 0x02) != 0){
                dsp_int0_counter++;
                if (dsp_int0_counter >= 2)
                {
		    //_hpiSetAddress( 0x0000022F );//ステータス送信
		    //_hpiPut((ushort)(0x8000));//bit15=オン　->DSP内サーボ処理起動(int0の替わり)
                    dsp_int0_counter = 0;
		    //本当はタイマー割り込みで、62.5usでいれたい。


                }
		TIOIR1 = (TIOIR1 & 0xdf);
	}
	else{
		TIOIR1 = (TIOIR1 & 0x0f);
	}
}
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of LA_int_dsp.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
