/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ワイヤ速度補間クラス                                                */
/*  [最終更新日]                                                            */
/*      2004. 6.14  R040301RTW-TAWERS       細井                            */
/*--------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ワイヤ速度補間クラス                                                */
/*  [データ説明]                                                            */
/*      sint        WFe_Target  ワイヤ送給速度目標値(0.001m/min)            */
/*      sint        WFe_rpm     ワイヤ送給速度目標値（ＲＰＭ）              */
/*      sint        WFe_Siji    ワイヤ送給速度指示値（ＲＰＭ）              */
/*      float       WFe         ワイヤ送給速度目標値                        */
/*      float       WFs         ワイヤ送給速度スタート値                    */
/*      float       Wf          加減速中ワイヤ送給速度                      */
/*      float       T           加減速時間                                  */
/*      int         N           加減速分割数                                */
/*      int         K           加減速分割数(０≦K≦N-1)                    */
/*--------------------------------------------------------------------------*/
typedef struct
{
    sint    WFe_Target;
    sint    WFe_rpm;
    sint    WFe_Siji;
    sint    Dmy;
    float   WFe;
    float   WFs;
    float   Wf;
    float   T;
    int     N;
    int     K;
}SIPCB,*PSIPCB;

/* end */
