//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ｃｈ０＿ｗｒｉｔｅ＿ｃｌａｓｓ
//　【関数レベル】
//　　　ＬＥＶＥＬ：２
//  【機能説明】
//      ｃｈ０書き込み用（値に何らかの変化があった場合のみｃｈ０に書き込む）
//      ｃｈ０はプライマリーｃｈでこの内容が溶接機全体に反映される。
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      なし
//  【更新履歴】
//      2008.08.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#include  "custom.h"

void ch0_write_class(unsigned char Write_flag)
{
     if (Write_flag == true)
     {
//--------- Phase13 by @Tny 2008/09/18 --------
#if true
        if(gus_Iif_BuiltIn_write){  // IIF接続記録識別子の記録
            memory_write_member(WRITE_IIF_CH);
        }
        if(gb_Error_History_Write){ // エラー履歴テーブルの記録
            memory_write_member(WRITE_ERROR_HISTORY_CH);
        }
//--------- BP4 Phase6 by @Tny 2009/01/27 ----
#if true
        if(gb_WeldCondNameWrite){ // 溶接条件名の記録
            memory_write_member(WRITE_WELD_COND_NAME_CH);
        }
#endif
//--------------------------------------------
//-----------------------------------------------------------
//BP4 Phase9 by @Tny 2009.02.16
		if(gb_LcdBrightWrite){ // ＬＣＤコントラスト値の記録要求有り？
            memory_write_member(WRIGHT_LCD_BRIGHT_CH);
		}
//-----------------------------------------------------------
        else{
            memory_write_member(0); // 通常の記録
        }
#endif
//--------------------------------------------
     }
     return;
}
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of L2_ch0_write_class.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
