/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ＩＦタスク(通常処理)                                                */
/*      2004. 6. 4  R040301RTW-TAWERS       田中                            */
/*      2004.07.05  R040301RTW-TAWERS   上内    <ALT1>                      */
/*      2004. 8.26  R040701RTW-TAWERS       田中                            */
/*      2004. 9. 2  R040701RTW-TAWERS       田中                            */
/*      2004.09.14  R040701RTW-TAWERS       西田    微調                    */
/*      2004.09.29  R040701RTW-TAWERS       西田    微調    <ALT2>          */
/*      2004.09.30  R040701RTW-TAWERS       上内    [一元]                  */
/*      2004.10.13  R040701RTW-TAWERS       西田    [ｵｰﾄｴｸｽﾃﾝｼｮﾝ]           */
/*      2004.10.14  R040701RTW-TAWERS       西田    微調    <ALT3>          */
/*      2005. 1. 7  R0501XXRK1-その他       西川                            */
/*      2005.01.26  R050103RK1-TAWERSｱｰｸﾌﾞﾛｰ    津田                        */
/*      2005. 2.14  R050204RK1-TW溶接条件自動       田中                    */
/*      2005.07.15  R050701RK1-TW溶接記録2  津田                            */
/*      2005.09.27  R050902RK1-溶接条件設定拡張     津田                    */
/*--------------------------------------------------------------------------*/

#include "custom.h"

extern  IFCTL       _ifctl;

PWELDTABLE      GetWeldTable( void );

// @-R050902RK1
static  const   char    WldTblType[ 16 ] = {"NEW TW"};


extern int	xmemcmp(const char*dst,const char*soc, size_t lgh);

/* ===============================================
    DSPからＩＦ用にエラーコード変換するテーブル
================================================== */
usint   const   DSP2IFErrNo_Tbl[ ][ 2 ] =
{
/*      IF       DSP        */
    { 0x0001 , 0x8000  },    //ｱﾝﾌﾟﾚﾃﾞｨｰ
//  { 0x0002 , ?       },    //200VOFF
    { 0x0003 , 0x0001  },    //IPM異常検出
//  { 0x0004 , ?       },    //通信ｴﾗｰ(チェックサム異常など）
    { 0x0007 , 0x0004  },    //不足電圧検出,ｺﾈｸﾀ抜け
    { 0x0009 , 0x0008  },    //過速度検出
//  { 0x000A , ?       },    //アブソエンコーダ異常
    { 0x000B , 0x0010  },    //過負荷検出
//  { 0x000C , ?       },    //R/D異常
    { 0x000D , 0x0020  },    //ロック検出
    { 0x000F , 0x0040  },    //A/Dｴﾗｰ検出
//  { 0x0011 , ?       },    //DSP内部RAM異常
    { 0x0015 , 0x0200  },    //サーボドライバ異常
    { 0x0019 , 0x0800  },    //レゾルバ通信異常     //@-R040701RTW
    { 0x001B , 0x1000  },    //エンコーダ断線
    { 0x001D , 0x2000  },    //偏差リミットエラー
//  { 0x001F , ?       },    //DSPウォッチドッグタイムアウト
    { 0x0021 , 0x4000  },    //IF-DSP通信異常
    { 0      , 0       }     //テーブル終わり
};
#if false
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接条件制御タスク起動                                              */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6.10  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
static  void    weldStart( void )
{// @-R040301RTW
    DSPSendTimeInit( );                                 //５msタイマスタート
    XThInit( &wspdThread , &wspdDef_Thread );
    XThEnter( &wspdThread , 0 , 0 , THREAD_ACTIVE );    //溶接制御タスク起動
    XThInit( &wcondThread , &wcondDef_Thread );
    XThEnter( &wcondThread , 0 , 0 , THREAD_ACTIVE );   //サーボ速度タスク起動
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接条件制御タスクキャンセル                                        */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6.10  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
static  void    weldCancel( void )
{// @-R040301RTW
    XThTerm( &wspdThread );                //サーボ速度タスクキャンセル
    XThTerm( &wcondThread );               //溶接制御タスクキャンセル
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      サーボ速度制御タスク起動                                            */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6.10  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
static  void    wspdStart( void )
{// @-R040301RTW
    DSPSendTimeInit( );                             //５msタイマスタート
    XThInit( &wspdThread , &wspdDef_Thread );
    XThEnter( &wspdThread , 0 , 0 , THREAD_ACTIVE );//サーボ速度タスクに起動
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      サーボ速度制御タスクキャンセル                                      */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6.10  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
static  void    wspdCancel( void )
{// @-R040301RTW
    XThTerm( &wspdThread );                         //サーボ速度タスクキャンセル
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      サーボＯＮタスク起動                                                */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6.10  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
static  void    srvonStart( void )
{// @-R040301RTW
    XThInit( &wspdThread , &srvoOnDef_Thread );
    XThEnter( &wspdThread , 0 , 0 , THREAD_ACTIVE );//サーボＯＮタスク起動
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      サーボＯＮタスクキャンセル                                          */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6.10  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
void    srvonCancel( void )
{// @-R040301RTW
    XThTerm( &wspdThread );
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      サーボエラー：ＤＳＰ→ＩＦ用にエラーコード変換                      */
/*  [引数]                                                                  */
/*      usint       Code        ＤＳＰエラーコード                          */
/*  [戻り値]                                                                */
/*      usint       IFエラーコード                                          */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 9  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
static  usint    convErrNo( usint Code )
{
int i;

    for( i = 0 ; DSP2IFErrNo_Tbl[ i ][ 0 ] ; ++i )
    {
        if( Code == DSP2IFErrNo_Tbl[ i ][ 1 ] )
        {
            return( DSP2IFErrNo_Tbl[ i ][ 0 ] );
        }
    }
    return( 0xffff );   // 2004.10.15   未定義エラー
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:サーボ状態セット                                */
/*  [引数]                                                                  */
/*      int     Sts     サーボ状態のモード（０～２）                        */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
void    SetSrvStatus( int Sts )
{// @-R040301RTW
    _ifctl.SrvStatus = Sts;
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:溶接状態セット                                  */
/*  [引数]                                                                  */
/*      int     Sts     溶接状態のモード（０～２）                          */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
void    SetWeldStatus( int Sts )
{// @-R040301RTW
    _ifctl.WeldStatus = Sts;
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:送給状態セット                                  */
/*  [引数]                                                                  */
/*      int     Sts     送給状態のモード（０～２）                          */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
void    SetMotorStatus( int Sts )
{// @-R040301RTW
    _ifctl.MotorStatus = Sts;
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:溶接状態＆送給状態のセット                      */
/*  [引数]                                                                  */
/*      int     Sts     溶接状態のモード（０～２）                          */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      ＩＦタスク専用：割込み禁止＆許可を行う                              */
/*  [更新履歴]                                                              */
/*      2004.10.24  R040701RTW-TAWERS       西川    NY20041024              */
/*--------------------------------------------------------------------------*/
static  void    Set_WeldMotor( int Sts )
{
    CPU_di( );
    _ifctl.WeldStatus = Sts;
    _ifctl.MotorStatus = Sts;
    CPU_ei( );
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:サーボ状態取得                                  */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      int     モード  ０～２                                              */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
int     GetSrvStatus( void )
{// @-R040301RTW
    return( _ifctl.SrvStatus );
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:溶接状態取得                                    */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      int     モード  ０～２                                              */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
int     GetWeldStatus( void )
{// @-R040301RTW
    return( _ifctl.WeldStatus );
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:送給状態取得                                    */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      int     モード  ０～２                                              */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
int     GetMotorStatus( void )
{// @-R040301RTW
    return( _ifctl.MotorStatus );
}
/*--------------------------------------------------------------------------*/
/*      スティックビット定義                                                */
/*--------------------------------------------------------------------------*/
#define     BIT_STICK   0x000c
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接動作指令送信関数                                                */
/*  [引数]                                                                  */
/*      usint   SIERI   メインからの動作指令                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004.10.21  R040701RTW-TAWERS       西川    NY20041021              */
/*--------------------------------------------------------------------------*/
static  void    W_DousaSirei( usint SIREI )
{
usint   SendData = SIREI;

    if( isMainPowerSts == 0 )
        SendData &= ( 0xffff - 0x000c );
//  最後に送信したデータと異なる場合のみＤＳＰに送信する    NY20041024
    if( LastSend_11 != SendData )
    {
        LastSend_11 = SendData;
        hpiWrite( hpicmdOUTWLDMOV , &LastSend_11 ); //DSPに送信
    }
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      主電源制御ＯＮ/ＯＦＦ                                               */
/*  [引数]                                                                  */
/*      int         OnOff       １＝ＯＮ、０＝ＯＦＦ                        */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 8.26  R040701RTW-TAWERS       田中                            */
/*      2004. 8.31  R040701RTW-TAWERS       田中                            */
/*      2004.10.17  R040701RTW-TAWERS       西川    NY20041017              */
/*      2004.10.21  R040701RTW-TAWERS       西川    NY20041021              */
/*      2005. 1. 7  R0501XXRK1-その他       西川                            */
/*--------------------------------------------------------------------------*/
static  void    MainPower_Proc( int OnOff )
{// @-R040701RTW
usint   Data;

    if( OnOff )//主電源ＯＮ
    {
        MAIN_POWER = 1;
        //Output( OUTPUT , 1 , 1 );   //主電源ＯＮ    // @-R0501XXRK1 //ihara test del 2006.1.30
        Start_MainPowerTimer( );
    }
    else//主電源ＯＦＦ
    {
//  isMainPowerSts=0後、W_DousaSirei( )を呼び出す順序守ること
//  （isMainPowerSts=0なのでスティック出力のみＯＦＦすることになる）
        isMainPowerSts = 0; //2004. 8.31
        MAIN_POWER = 0;
        //Output( OUTPUT , 0 , 1 );   //主電源ＯＦＦ  // @-R0501XXRK1  //ihara test del 2006.1.30
        W_DousaSirei( WLDPWR ); // DSPにスティックＯＦＦ送信    NY20041021
        Data = 0x0000;
        hpiWrite( hpicmdOUTWLDOUT , &Data );//溶接制御出力
        Reset_MainPowerTimer( );
        Data = 0x0000;
        //ifdprStsWrite( ifdprstsWELDPWR_FIEDBACK , &Data );  //溶接電源フィードバック領域にＯＦＦをライト  //ihara test del 2006.1.30
    }
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      主電源ＯＮ状態セット                                                */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004.10.21  R040701RTW-TAWERS       西川    NY20041021              */
/*--------------------------------------------------------------------------*/
static  void    MainPower_StsOn( void )
{
usint   Data;

    isMainPowerSts = 1;
    Data = 0x0001;
    hpiWrite( hpicmdOUTWLDOUT , &Data );    //溶接制御出力
    if( ( Data = WLDPWR ) & BIT_STICK )
    {
        W_DousaSirei( Data );               // ＤＳＰにスティックＯＮ送信
    }
    Data = 0x0001;
    ifdprStsWrite( ifdprstsWELDPWR_FIEDBACK , &Data );  //溶接電源フィードバック領域にＯＮをライト
}
#else
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:溶接状態セット                                  */
/*  [引数]                                                                  */
/*      int     Sts     溶接状態のモード（０～２）                          */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
void    SetWeldStatus( int Sts )
{// @-R040301RTW
    _ifctl.WeldStatus = Sts;
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:送給状態セット                                  */
/*  [引数]                                                                  */
/*      int     Sts     送給状態のモード（０～２）                          */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
void    SetMotorStatus( int Sts )
{// @-R040301RTW
    _ifctl.MotorStatus = Sts;
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:溶接状態取得                                    */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      int     モード  ０～２                                              */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
int     GetWeldStatus( void )
{// @-R040301RTW
    return( _ifctl.WeldStatus );
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      I/Fタスク制御データ:送給状態取得                                    */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      int     モード  ０～２                                              */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 2  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
int     GetMotorStatus( void )
{// @-R040301RTW
    return( _ifctl.MotorStatus );
}
#endif
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接制御出力コマンド処理                                            */
/*  [引数]                                                                  */
/*      usint       Parm        付随データ                                  */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 5.31  R040301RTW-TAWERS       田中                            */
/*      2004. 8.26  R040701RTW-TAWERS       田中                            */
/*      2004.10.17  R040701RTW-TAWERS       西川    NY20041017              */
/*      2005. 1. 7  R0501XXRK1-その他       西川                            */
/*--------------------------------------------------------------------------*/
static  void    WeldOut_Proc( usint Parm )
{// @-R040301RTW
    //Output( OUTPUT , MAIN_POWER , 1 );  // @-R0501XXRK1 2006.8.29 ihara
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      半固定パラメータコマンド範囲チェック                                */
/*  [引数]                                                                  */
/*      sint        OrgData         元データ                                */
/*      sint        Offset          オフセット                              */
/*      sint        Min             最小値                                  */
/*      sint        Max             最大値                                  */
/*  [戻り値]                                                                */
/*      sint        丸めた値                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004.09.14  R040701RTW-TAWERS       西田    微調                    */
/*      2004.09.29  R040701RTW-TAWERS       西田    微調    <ALT2>          */
/*--------------------------------------------------------------------------*/
static  sint    checkWeldAdjData( sint OrgData , sint Offset , sint Min , sint Max )
{
lint    Data;
// 2004.09.29 lintでの比較に変更：ｵｰﾊﾞｰﾌﾛｰ対策
    Data = (lint)OrgData + (lint)Offset;
    if( Data < Min )
        Data = Min;
    else if( Data > Max )
        Data = Max;
    return( (sint)Data );
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      半固定パラメータコマンド範囲チェック                                */
/*  [引数]                                                                  */
/*      sint        OrgData         元データ                                */
/*      sint        Offset          オフセット                              */
/*      sint        Min             最小値                                  */
/*      sint        Max             最大値                                  */
/*      int         isContArc       １＝連続アークスタート有効              */
/*  [戻り値]                                                                */
/*      sint        丸めた値                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      連続アークスタート処理するデータ用                                  */
/*  [更新履歴]                                                              */
/*      2004.10.13  R040701RTW-TAWERS       西川    NY20041013              */
/*--------------------------------------------------------------------------*/
static  sint    checkWeldAdjData_2( sint OrgData , sint Offset , sint Min , sint Max , int isContArc )
{
lint    Data;

    Data = (lint)OrgData + (lint)Offset;
    if( isContArc )
        Data /= 2;
    if( Data < Min )
        Data = Min;
    else if( Data > Max )
        Data = Max;
    return( (sint)Data );
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      半固定パラメータの送信データ作成                                    */
/*  [引数]                                                                  */
/*      sint        Abs             絶対値                                  */
/*      sint        Rel             微調値(オフセット)                      */
/*      sint        Min             最小値                                  */
/*      sint        Max             最大値                                  */
/*  [戻り値]                                                                */
/*      sint        丸めた値                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      絶対値 * 微調値                                                     */
/*  [更新履歴]                                                              */
/*      2005.01.26  R050103RK1-TAWERSｱｰｸﾌﾞﾛｰ    津田                        */
/*      2005.02.17  R0502XXRK1-不具合           津田    [ｱｰｸﾌﾞﾛｰ]           */
/*--------------------------------------------------------------------------*/
static  sint    createWeldAdjData( sint Abs , sint Rel , sint Min , sint Max )
{
lint    Data;

    Data = (lint)Abs * (lint)Rel;
    Data /= 10;
    if( Data < Min )
        Data = Min;
    else if( Data > Max )
        Data = Max;
    return( (sint)Data );
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      半固定パラメータコマンド処理                                        */
/*  [引数]                                                                  */
/*      int     isContArc   １＝連続アークスタート有効                      */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004.09.14  R040701RTW-TAWERS       西田    微調                    */
/*      2004.09.28  R040701RTW-TAWERS       西田    微調    <ALT1>          */
/*      2004. 9.29  R040701RTW-TAWERS       田中    [半固定2]               */
/*      2004.09.29  R040701RTW-TAWERS       西田    微調    <ALT2>          */
/*      2004.10.13  R040701RTW-TAWERS       西川    NY20041013              */
/*      2004.10.14  R040701RTW-TAWERS       西田    微調    <ALT3>          */
/*      2005.01.26  R050103RK1-TAWERSｱｰｸﾌﾞﾛｰ    津田                        */
/*--------------------------------------------------------------------------*/
//static void    WeldAdjOut_Proc( int isContArc )
void    WeldAdjOut_Proc( int isContArc ) //ihara 2005.12.27
{
int i;
sint   *pAbs = (sint*)_union.Nrm.WeldParm_Abs;
sint   *pOffs = (sint*)_union.Nrm.WeldParm_Rel;
sint   *pWrk = (sint*)_union.Nrm.WeldParm_Wrk;
//char   *pAbs = (char*)_union.Nrm.WeldParm_Abs;
//char   *pOffs = (char*)_union.Nrm.WeldParm_Rel;
//char   *pWrk = (char*)_union.Nrm.WeldParm_Wrk;

    //for( i=0; i<WLDADJST_2LEN; ++i, ++pAbs, ++pOffs, ++pWrk )// @-R040701RTW[半固定2]
    for( i=0; i<WLDADJST_3LEN; ++i, ++pAbs, ++pOffs, ++pWrk )// @-R040701RTW[半固定2] 2007.2.17変更
    {
        *pWrk = *pAbs + *pOffs;
    }
    // 範囲チェック  符号付きで計算する為、lintで計算する  2004.09.29
    pAbs = (sint*)_union.Nrm.WeldParm_Abs;
    pOffs = (sint*)_union.Nrm.WeldParm_Rel;
    pWrk = (sint*)_union.Nrm.WeldParm_Wrk;
    //pAbs = (char*)_union.Nrm.WeldParm_Abs;
    //pOffs = (char*)_union.Nrm.WeldParm_Rel;
    //pWrk = (char*)_union.Nrm.WeldParm_Wrk;

    pWrk[ 35 ] = checkWeldAdjData( pAbs[ 35 ] , pOffs[ 35 ] , 0x0001 , 0x6666 );
// @-R040701RTW 微調 <ALT3>
//    pWrk[ 24 ] = checkWeldAdjData( pAbs[ 24 ] , pOffs[ 24 ] , 0x147a , 0x5c28 );
//    pWrk[ 81 ] = checkWeldAdjData( pAbs[ 81 ] , pOffs[ 81 ] , 0x147a , 0x5c28 );
    pWrk[ 37 ] = checkWeldAdjData_2( pAbs[ 37 ] , pOffs[ 37 ] , 0x0001 , 0x1388 , isContArc );// NY20041013
    pWrk[ 82 ] = checkWeldAdjData_2( pAbs[ 82 ] , pOffs[ 82 ] , 0x0001 , 0x1388 , isContArc );// NY20041013
// @-R040701RTW <ALT1>
    pWrk[ 50 ] = checkWeldAdjData( pAbs[ 50 ] , pOffs[ 50 ] , 0x00da , 0x6666 );
    pWrk[ 60 ] = checkWeldAdjData( pAbs[ 60 ] , pOffs[ 60 ] , 0x0032 , 0x7530 );
// @-R050103RK1
    pWrk[ 131 ] = createWeldAdjData( pAbs[ 131 ] , pOffs[ 131 ] , 0x0000 , 0x7fff );

    //pWrk[ 36 - 1 ] = (short)gf_Hot_current_level; //2009.02.13ホット電流値転送
    //pWrk[ 37 - 1 ] = (short)gf_Hot_current_level; //2009.02.13ホット電流値転送

    if (guc_Method_condition_data == STD_HAND_METHOD) //2009.03.07 直流手溶接時電防有無を転送
    {
        if (gss_Select_dital[P_DENBOU] == 0) //電防あり
        {
            pWrk[ 255 - 1 ] = 1;
        } else {                             //電防なし
            pWrk[ 255 - 1 ] = 0;
        }
    } else {
            pWrk[ 255 - 1 ] = 0;
    }
    

   //<><><> ホット関連パラメータ転送 2009.04.03 <><><>
   //ＤＣ関連
   if (guc_Method_condition_counter == STD_DC_METHOD || guc_Method_condition_counter == STD_HAND_METHOD || guc_Method_condition_counter == EXP_DC_METHOD)
   {
       float pf_Hot_i;
       float pf_Hot_t1;
       float pf_Hot_t2;
       short ps_Hot_st;
       if (guc_Robot_connect_flag == false) //ロボット接続でない場合　2009.07.13
       {
            if (gss_Select_dital[P_DC_TIG_START] == false) //EN
            {
                pf_Hot_i   = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EN_HOT_I];
                pf_Hot_t1  = 1;
                pf_Hot_t2  = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EN_HOT_T];
                ps_Hot_st  = gtt_Special_menu.ss_Service_data[S_DC_TIG_EN_HOT_ST];
                pWrk[ 254 - 1 ] = 0;
            } else {                                       //EP
                pf_Hot_i   = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EP_HOT_I];
                //EPスタート修正 2009.04.06 EPSTART           pf_Hot_t1  = 1;
                //EPスタート修正 2009.04.06 EPSTART           pf_Hot_t2  = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EP_HOT_T];
                pf_Hot_t1  = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EP_HOT_T];//EPスタート修正 2009.04.06 EPSTART
                pf_Hot_t2  = 1;//EPスタート修正 2009.04.06 EPSTART
                ps_Hot_st  = gtt_Special_menu.ss_Service_data[S_DC_TIG_EP_HOT_ST];
                pWrk[ 254 - 1 ] = 1;
            }
       } else { //ロボット接続の場合　2009.07.13
            if (gtt_Internal_pack.Data.In.fControl.Bit1Sw.Ep_start == false) //EN
            {
                pf_Hot_i   = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EN_HOT_I] + gtt_Internal_pack.Data.In.vIhotAdj_tig;
                pf_Hot_t1  = 1;
                pf_Hot_t2  = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EN_HOT_T] + gtt_Internal_pack.Data.In.vHotTime_tig;
                ps_Hot_st  = gtt_Special_menu.ss_Service_data[S_DC_TIG_EN_HOT_ST]       + gtt_Internal_pack.Data.In.vHotSlop_tig;
                pWrk[ 254 - 1 ] = 0;
            } else {                                       //EP
                pf_Hot_i   = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EP_HOT_I] + gtt_Internal_pack.Data.In.vIhotAdj_tig;
                pf_Hot_t1  = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EP_HOT_T] + gtt_Internal_pack.Data.In.vHotTime_tig;//EPスタート修正 2009.04.06 EPSTART
                pf_Hot_t2  = 1;//EPスタート修正 2009.04.06 EPSTART
                ps_Hot_st  = gtt_Special_menu.ss_Service_data[S_DC_TIG_EP_HOT_ST]       + gtt_Internal_pack.Data.In.vHotSlop_tig;
                pWrk[ 254 - 1 ] = 1;
            }
            if (ps_Hot_st <= 0) {ps_Hot_st = 0;} //2009.07.22
       }
       if (guc_Method_condition_counter == STD_HAND_METHOD)
       {
           pf_Hot_i   = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EN_HOT_I];
           pf_Hot_t1  = 1;
           pf_Hot_t2  = (float)gtt_Special_menu.ss_Service_data[S_DC_TIG_EN_HOT_T];
           ps_Hot_st  = gtt_Special_menu.ss_Service_data[S_DC_TIG_EN_HOT_ST];
           pWrk[ 254 - 1 ] = 0;
       }
       {
           float pf_Work;
           short ps_Work;
           int   pi_Work; //2009.07.13
           short ps_Current_work;
           float pf_Hot_current_level_result; //2009.07.21

           //ホット電流
           pf_Work = gf_Hot_current_level + pf_Hot_i;
           if (pf_Work > (float)gss_Max_current)
           {
               pf_Work = (float)gss_Max_current;
           }
           if (pf_Work < (float)gss_Min_current)
           {
               pf_Work = (float)gss_Min_current;
           }

           //<><>ＥＰスタート時の出力制限 2009.07.23 <><><>
           if (guc_Robot_connect_flag == false) //ロボット接続でない場合
           {
               if (gss_Select_dital[P_DC_TIG_START] == true) //EP
               {
                   if (pf_Work >= 300.0) //2010.02.18 100->300 田中さん要望
                   {
                       pf_Work = 300.0; //2010.02.18 100->300 田中さん要望
                   }
               }
           } else {
               if (gtt_Internal_pack.Data.In.fControl.Bit1Sw.Ep_start == true) //EP 
               {
                   if (pf_Work >= 300.0) //2010.02.18 100->300 田中さん要望
                   {
                       pf_Work = 300.0;  //2010.02.18 100->300 田中さん要望
                   }
               }
           }
           //<><><><><><><><><><><><><><><><><><><><><><><><>

           pf_Hot_current_level_result = pf_Work; //2009.07.21
           
           pWrk[ 36 - 1 ] = pf_Work * HOTCUR;
           pWrk[ 37 - 1 ] = pf_Work * HOTCUR;
           //ホット時間１
           pWrk[ 38 - 1 ] = (short)(pf_Hot_t1 * 1000.0 / 12.5);
           //ホット時間２
#if 0 //2009.07.13
           ps_Work = (short)(pf_Hot_t2 * 1000.0 / 12.5);
           if (ps_Work >= 0x7FFF)
           {
               ps_Work = 0x7FFF;
           }
           if (ps_Work <= 0x0001)
           {
               ps_Work = 0x0001;
           }
           pWrk[ 83 - 1 ] = ps_Work;
#endif
           //<><><> 型変更 2009.07.13 <><><>
           pi_Work = (int)(pf_Hot_t2 * 1000.0 / 12.5);
           if (pi_Work >= 0x7FFF)
           {
               pi_Work = 0x7FFF;
           }
           if (pi_Work <= 0x0001)
           {
               pi_Work = 0x0001;
           }
           pWrk[ 83 - 1 ] = (short)pi_Work;
           //<><><><><><><><><><><><><><><><>
           //ホットスロープ
           if (guc_Crater_mode_counter == SEQUENCE_NON || guc_Crater_mode_counter == SEQUENCE_ARC_SPOT)
           {
               if (guc_Pulse_mode_data == 0)
               {
                   //ps_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr - gf_Hot_current_level;
                   //ps_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr - (gf_Hot_current_level + pf_Hot_i); //2009.07.21
                   ps_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr - (short)pf_Hot_current_level_result; //2009.07.21
               } else {
                   //ps_Current_work = gtt_Internal_pack.Data.In.usIP - gf_Hot_current_level;
                   //ps_Current_work = gtt_Internal_pack.Data.In.usIP - (gf_Hot_current_level + pf_Hot_i); //2009.07.21
                   ps_Current_work = gtt_Internal_pack.Data.In.usIP - (short)pf_Hot_current_level_result; //2009.07.21
               }
               if (gtt_Ctrl_flag.Crater_repeat == ON)
               {
                   //ps_Current_work = gtt_Internal_pack.Data.In.usWeldingCratCurr - gf_Hot_current_level; //2009.07.21
                   //ps_Current_work = gtt_Internal_pack.Data.In.usWeldingCratCurr - (gf_Hot_current_level + pf_Hot_i); //2009.07.21
                   ps_Current_work = gtt_Internal_pack.Data.In.usWeldingCratCurr - (short)pf_Hot_current_level_result; //2009.07.21
               }
           }
           if (guc_Crater_mode_counter == SEQUENCE_CRATER_REPEAT || guc_Crater_mode_counter == SEQUENCE_CRATER)
           {
               //ps_Current_work = gtt_Internal_pack.Data.In.usWeldingInitCurr - gf_Hot_current_level;
               //ps_Current_work = gtt_Internal_pack.Data.In.usWeldingInitCurr - (gf_Hot_current_level + pf_Hot_i); //2009.07.21;
               ps_Current_work = gtt_Internal_pack.Data.In.usWeldingInitCurr - (short)pf_Hot_current_level_result; //2009.07.21;
               if (gtt_Ctrl_flag.Crater_repeat == ON)
               {
                   //ps_Current_work = gtt_Internal_pack.Data.In.usWeldingCratCurr - gf_Hot_current_level;
                   //ps_Current_work = gtt_Internal_pack.Data.In.usWeldingCratCurr - (gf_Hot_current_level + pf_Hot_i); //2009.07.21;
                   ps_Current_work = gtt_Internal_pack.Data.In.usWeldingCratCurr - (short)pf_Hot_current_level_result; //2009.07.21;
               }
           }
           if (ps_Current_work < 0) {ps_Current_work = ps_Current_work * -1;}
#if 0 //2009.07.13
           if (ps_Hot_st == 0)
           {
               ps_Work = 0x7fff;
           } else {
               ps_Work = (short)((float)ps_Current_work * HOTCUR / ((float)ps_Hot_st * 1000.0 / 12.5));
               if (ps_Work < 1)
               {
				   ps_Work = 1;
			   }
			   if (ps_Work >= 0x7fff)
               {
				   ps_Work = 0x7fff;
			   }
			   
           }
           pWrk[ 39 - 1 ] = (short)ps_Work;
#endif
           //<><><> 型変更 2009.07.13 <><><>
           if (ps_Hot_st == 0)
           {
               pi_Work = 0x7fff;
           } else {
//2009.08.20               pi_Work = (int)((float)ps_Current_work * HOTCUR / ((float)ps_Hot_st * 1000.0 / 12.5));
               pi_Work = (int)((float)ps_Current_work * 8.0 * HOTCUR / ((float)ps_Hot_st * 1000.0 / 12.5));//2009.08.20 H39を8倍して送信
               if (pi_Work < 1)
               {
				   pi_Work = 1;
			   }
			   if (pi_Work >= 0x7fff)
               {
				   pi_Work = 0x7fff;
			   }
			   
           }
           pWrk[ 39 - 1 ] = (short)pi_Work;
           //<><><><><><><><><><><><><><><><>

       }
    }
    //ＡＣ関連
   if (guc_Method_condition_counter == STD_AC_METHOD || guc_Method_condition_counter == STD_MIX_METHOD || guc_Method_condition_counter == EXP_AC_METHOD)
   {
       float pf_Hot_i;
       float pf_Hot_t1;
       float pf_Hot_t2;
       short ps_Hot_st;
       float pf_Hot_current_level_result; //2009.07.21

       if (guc_Robot_connect_flag == false) //ロボット接続でない場合　2009.07.13
       {
           pf_Hot_i   = (float)gtt_Special_menu.ss_Service_data[S_AC_MIX_HOT_I];
           pf_Hot_t1  = (float)gtt_Special_menu.ss_Service_data[S_AC_MIX_HOT_T1];
           pf_Hot_t2  = (float)gtt_Special_menu.ss_Service_data[S_AC_MIX_HOT_T2];
           ps_Hot_st  = gtt_Special_menu.ss_Service_data[S_AC_MIX_HOT_ST];
       } else { //ロボット接続の場合　2009.07.13
           pf_Hot_i   = (float)gtt_Special_menu.ss_Service_data[S_AC_MIX_HOT_I]     + gtt_Internal_pack.Data.In.vIhotAdj_tig;
           pf_Hot_t1  = (float)gtt_Special_menu.ss_Service_data[S_AC_MIX_HOT_T1]    + gtt_Internal_pack.Data.In.vHotTime_tig;
           pf_Hot_t2  = (float)gtt_Special_menu.ss_Service_data[S_AC_MIX_HOT_T2];
           ps_Hot_st  = gtt_Special_menu.ss_Service_data[S_AC_MIX_HOT_ST]           + gtt_Internal_pack.Data.In.vHotSlop_tig;
            if (ps_Hot_st <= 0) {ps_Hot_st = 0;} //2009.07.22
       }
       pWrk[ 254 - 1 ] = 2;
       {
           float pf_Work;
           short ps_Work;
           int   pi_Work;
           short ps_Current_work;

           //ホット電流
           pf_Work = gf_Hot_current_level + pf_Hot_i;
           //if (pf_Work > (float)gss_Max_current)
           if (pf_Work > 300.0) //2009.04.10  //2010.02.18 100->300 田中さん要望
           {
               //pf_Work = (float)gss_Max_current;
               pf_Work = 300.0; //2009.04.10 //2010.02.18 100->300 田中さん要望
           }
           if (pf_Work < (float)gss_Min_current)
           {
               pf_Work = (float)gss_Min_current;
           }
           pf_Hot_current_level_result = pf_Work; //2009.07.21
           
           pWrk[ 36 - 1 ] = pf_Work * HOTCUR;
           pWrk[ 37 - 1 ] = pf_Work * HOTCUR;
           //ホット時間１
#if 0 //2009.07.13
           ps_Work = (short)(pf_Hot_t1 * 1000.0 / 12.5);
           if (ps_Work >= 0x7FFF)
           {
               ps_Work = 0x7FFF;
           }
           if (ps_Work <= 0x0001)
           {
               ps_Work = 0x0001;
           }
           pWrk[ 38 - 1 ] = ps_Work;
#endif
           //<><><> 型変更 2009.07.13 <><><>
           pi_Work = (int)(pf_Hot_t1 * 1000.0 / 12.5);
           if (pi_Work >= 0x7FFF)
           {
               pi_Work = 0x7FFF;
           }
//#if 0 //2009.07.27 1->A0(160)
#if 1 //2009.08.21 A0->1
           if (pi_Work <= 0x0001)
           {
               pi_Work = 0x0001;
           }
#endif
#if 0 //2009.08.21 A0->1

           if (pi_Work <= 0x00A0)
           {
               pi_Work = 0x00A0;
           }
#endif



           pWrk[ 38 - 1 ] = (short)pi_Work;

           //<><><><><><><><><><><><><><><><>
           //ホット時間２
#if 0 //2009.07.13
           ps_Work = (short)(pf_Hot_t2 * 1000.0 / 12.5);
           if (ps_Work >= 0x7FFF)
           {
               ps_Work = 0x7FFF;
           }
           if (ps_Work <= 0x0001)
           {
               ps_Work = 0x0001;
           }
           pWrk[ 83 - 1 ] = ps_Work;
#endif
           //<><><> 型変更 2009.07.13 <><><>
           pi_Work = (int)(pf_Hot_t2 * 1000.0 / 12.5);
           if (pi_Work >= 0x7FFF)
           {
               pi_Work = 0x7FFF;
           }
           if (pi_Work <= 0x0001)
           {
               pi_Work = 0x0001;
           }
           pWrk[ 83 - 1 ] = (short)pi_Work;
           //<><><><><><><><><><><><><><><><>
           //ホットスロープ
           //ps_Current_work = (short)(gf_Hot_current_level / 2.0);
           //ps_Current_work = (short)((gf_Hot_current_level + pf_Hot_i) / 2.0); //2009.07.21
           ps_Current_work = (short)(pf_Hot_current_level_result / 2.0); //2009.07.21
           if (ps_Current_work < 0) {ps_Current_work = ps_Current_work * -1;} //2009.07.21
#if 0 //2009.07.13
           if (ps_Hot_st == 0)
           {
               ps_Work = 0x7fff;
           } else {
               ps_Work = (short)((float)ps_Current_work * HOTCUR / ((float)ps_Hot_st * 1000.0 / 12.5));
               if (ps_Work < 1)
               {
				   ps_Work = 1;
			   }
			   if (ps_Work >= 0x7fff)
               {
				   ps_Work = 0x7fff;
			   }
           }
           pWrk[ 39 - 1 ] = (short)ps_Work;
#endif
           //<><><> 型変更 2009.07.13 <><><>
           if (ps_Hot_st == 0)
           {
               pi_Work = 0x7fff;
           } else {
//2009.08.20               pi_Work = (int)((float)ps_Current_work * HOTCUR / ((float)ps_Hot_st * 1000.0 / 12.5));
               pi_Work = (int)((float)ps_Current_work * 8.0 * HOTCUR / ((float)ps_Hot_st * 1000.0 / 12.5));//2009.08.20 H39を8倍して送信
               if (pi_Work < 1)
               {
				   pi_Work = 1;
			   }
			   if (pi_Work >= 0x7fff)
               {
				   pi_Work = 0x7fff;
			   }
           }
           pWrk[ 39 - 1 ] = (short)pi_Work;
           //<><><><><><><><><><><><><><><><>
       }
   }
   //<><><><><><><><><><><><><><><><><><><><><><><><><>

   //<><><> 出力調整関連パラメータ転送 2009.04.03 <><><>
   //出力調整ゲイン
//2009.04.14   pWrk[ 256 - 1 ] = gtt_Special_menu.ss_Service_data[S_OUTPUT_ADJ_GEIN] + 1006;
   //pWrk[ 256 - 1 ] = 1006 //センター値
   //                  - gtt_Special_menu.ss_Service_data[S_OUTPUT_ADJ_GEIN]	//サービスマンメニュー調整分±100
   //                  - (gss_Output_gein*5);	//ＤＳＷ調整分 ±35

   //<><><> 2010.01.12 <><><>
   pWrk[ 256 - 1 ] = pAbs[ 256 - 1 ] //センター値
                     - gtt_Special_menu.ss_Service_data[S_OUTPUT_ADJ_GEIN]	//サービスマンメニュー調整分±100
                     - (gss_Output_gein*5);	//ＤＳＷ調整分 ±35
   //<><><><><><><><><><><><>

   //ＣＴオフセット
   {
     short ps_Work;
     ps_Work = gtt_Special_menu.ss_Service_data[S_CT_OFFSET];
   //2009.04.14ｺﾒﾝﾄ追加
   //CTｵﾌｾｯﾄ量=16の場合、H257=0x7FFFを送信。DSP側でｽｲｯﾁとして受け、処理を分岐する仕様
   //であるが、2009/4/14時点で、DSP側の処理は未実装。
   //CTｵﾌｾｯﾄ量の調整は、32R側の指令値を加算し対応することとする。。
     if (gtt_Special_menu.ss_Service_data[S_CT_OFFSET] == 16) {ps_Work = 0x7fff;}
     
     pWrk[ 257 - 1 ] = ps_Work;
   }
   //<><><><><><><><><><><><><><><><><><><><><><><><><>



    //<><><> ＥＸＴ　ＳＷ（延長モード有効無効の送信）2010.01.21 <><><>
//2010.01.22    if (gtt_Special_menu.ss_Rescue_data[3] == OFF)
    if (gtt_Special_menu.ss_Rescue_data[4] == OFF)//2010.01.22
    {
         pWrk[ 258 - 1 ] = 0; //無しであれば強制０（有りの時はテーブル値に従う）
    }
    //<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>


#if false	//	「ソフトスタート時間」削除 2011.10.31
    //<><><><><><><><> ソフトスタート時間 2011.10.01 <><><><><><><><><>
    
         pWrk[ 273 - 1 ] = gss_Select_dital[P_SOFT_START_TIME] * 1000;
//20111004+++++
		if(pWrk[ 273 - 1] != 0){
		//ソフトスタート時間≠０ の場合、スタート周波数30Hzとする。
			pWrk[ 271 - 1] = (short)2666;//30Hz  2666=1000_000/30Hz/12.5us
		}
//20111004-----
    //<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#endif

//20111107+++++
    //<><><><><><><><> 旧３００ＢＰ４交流波形出力モード 2011.11.07 <><><><><><><><><>
		if(gtt_Special_menu.ss_Rescue_data[R_AC_WAVE_OUT_MODE] == ON){//レスキューメニューにて切り替える予定	/ 「交流波形出力モード」追加	2011.11.08
			pWrk[ 285 - 1] = 0; //旧300BP4交流波形出力 オフ→新300BP4出力モード オン
		}else{
			pWrk[ 285 - 1] = 1; //旧300BP4交流波形出力 オン
		}
    //<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//20111107-----

    //<><><><> アークキレボウシアシスト送信の有無 2010.02.25 <><><><>
    if (gtt_Special_menu.ss_Rescue_data[R_ARC_ERR_PRE_CHECK] == OFF)
    {
         pWrk[ 275 - 1 ] = 0; //オフであれば強制０（有りの時はテーブル値に従う）
    }
    //<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>

#if 0 //井原さん作成、コメント化しベースをきれいに残す。
    //<><><> アークアシスト機能 2010.03.01 (H276,277,278,279) <><><>
    switch (gss_Select_dital[P_ARC_ASSIST])
    {
            case -4:
                  pWrk[ 276 -1 ] = pWrk[ 276 -1 ] - 1000;        //H276
                  pWrk[ 277 -1 ] = pWrk[ 277 -1 ] +   20;        //H277
                  pWrk[ 278 -1 ] = pWrk[ 278 -1 ] - 1000;        //H278
                  pWrk[ 279 -1 ] = pWrk[ 279 -1 ] +   20;        //H279
                  break;
            case -3:
                  pWrk[ 276 -1 ] = pWrk[ 276 -1 ] -  500;        //H276
                  pWrk[ 277 -1 ] = pWrk[ 277 -1 ] +   15;        //H277
                  pWrk[ 278 -1 ] = pWrk[ 278 -1 ] -  500;        //H278
                  pWrk[ 279 -1 ] = pWrk[ 279 -1 ] +   15;        //H279
                  break;
            case -2:
                  pWrk[ 276 -1 ] = pWrk[ 276 -1 ] +    0;        //H276
                  pWrk[ 277 -1 ] = pWrk[ 277 -1 ] +   10;        //H277
                  pWrk[ 278 -1 ] = pWrk[ 278 -1 ] +    0;        //H278
                  pWrk[ 279 -1 ] = pWrk[ 279 -1 ] +   10;        //H279
                  break;
            case -1:
                  pWrk[ 276 -1 ] = pWrk[ 276 -1 ] +    0;        //H276
                  pWrk[ 277 -1 ] = pWrk[ 277 -1 ] +    5;        //H277
                  pWrk[ 278 -1 ] = pWrk[ 278 -1 ] +    0;        //H278
                  pWrk[ 279 -1 ] = pWrk[ 279 -1 ] +    5;        //H279
                  break;
            case  0: //（標準）
                  pWrk[ 276 -1 ] = pWrk[ 276 -1 ] +    0;        //H276
                  pWrk[ 277 -1 ] = pWrk[ 277 -1 ] +    0;        //H277
                  pWrk[ 278 -1 ] = pWrk[ 278 -1 ] +    0;        //H278
                  pWrk[ 279 -1 ] = pWrk[ 279 -1 ] +    0;        //H279
                  break;
            case  1:
                  pWrk[ 276 -1 ] = pWrk[ 276 -1 ] +    0;        //H276
                  pWrk[ 277 -1 ] = pWrk[ 277 -1 ] -    5;        //H277
                  pWrk[ 278 -1 ] = pWrk[ 278 -1 ] +    0;        //H278
                  pWrk[ 279 -1 ] = pWrk[ 279 -1 ] -    5;        //H279
                  break;
            case  2:
                  pWrk[ 276 -1 ] = pWrk[ 276 -1 ] +    0;        //H276
                  pWrk[ 277 -1 ] = pWrk[ 277 -1 ] -   10;        //H277
                  pWrk[ 278 -1 ] = pWrk[ 278 -1 ] +    0;        //H278
                  pWrk[ 279 -1 ] = pWrk[ 279 -1 ] -   10;        //H279
                  break;
            case  3:
                  pWrk[ 276 -1 ] = pWrk[ 276 -1 ] + 2000;        //H276
                  pWrk[ 277 -1 ] = pWrk[ 277 -1 ] -   20;        //H277
                  pWrk[ 278 -1 ] = pWrk[ 278 -1 ] + 2000;        //H278
                  pWrk[ 279 -1 ] = pWrk[ 279 -1 ] -   20;        //H279
                  break;
            case  4:
                  pWrk[ 276 -1 ] = pWrk[ 276 -1 ] + 5000;        //H276
                  pWrk[ 277 -1 ] = pWrk[ 277 -1 ] -   30;        //H277
                  pWrk[ 278 -1 ] = pWrk[ 278 -1 ] + 5000;        //H278
                  pWrk[ 279 -1 ] = pWrk[ 279 -1 ] -   30;        //H279
                  break;
            default:
                  break;
    }
    //H276
    if (pWrk[ 276 - 1] > 32752) pWrk[ 276 - 1] = 32752;
    if (pWrk[ 276 - 1] < 0)     pWrk[ 276 - 1] =     0;
    
    //H277
    if (pWrk[ 277 - 1] > 32752) pWrk[ 277 - 1] = 32752;
    if (pWrk[ 277 - 1] < 0)     pWrk[ 277 - 1] =     0;

    //H278
    if (pWrk[ 278 - 1] > 32752) pWrk[ 278 - 1] = 32752;
    if (pWrk[ 278 - 1] < 0)     pWrk[ 278 - 1] =     0;
    
    //H279
    if (pWrk[ 279 - 1] > 32752) pWrk[ 279 - 1] = 32752;
    if (pWrk[ 279 - 1] < 0)     pWrk[ 279 - 1] =     0;
    
    if (gss_Select_dital[P_ARC_ASSIST] == -5)
    {
        pWrk[ 276 - 1] =   500; //H276
        pWrk[ 277 - 1] =   250; //H277
        pWrk[ 278 - 1] =   500; //H278
        pWrk[ 279 - 1] =   250; //H279
    }
    if (gss_Select_dital[P_ARC_ASSIST] ==  5)
    {
        pWrk[ 276 - 1] = 21845; //H276
        pWrk[ 277 - 1] =     0; //H277
        pWrk[ 278 - 1] = 21845; //H278
        pWrk[ 279 - 1] =     0; //H279
    }
    //<><><><><><><><><><><><><><><><><><><><><><>
#endif
//2010.03.18 田中変更　　　　＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝
//ハード波形の調整量より標準の調整量を作成する。ハードの傾きより標準は＋１ポイントずらす
//=0にて半固定データが直接出力されるようにする。MONI用、WELDSET用
	if((guc_Method_condition_data == STD_AC_METHOD || guc_Method_condition_data == EXP_AC_METHOD)
		&& (guc_Ac_wave_counter == 1))/*ハードＡＣ*/
	{/*========================ハードAC時処理　アシスト=0→データ読み=======================*/
		switch (gss_Select_dital[P_ARC_ASSIST]){
//2011.09.28+++++
// 300BP4用波形アシストパラメータ
// ｱｼｽﾄ= 0：前300BP4(V1.06)、500BP4のｱｼｽﾄ5
//      -1：500BP4のｱｼｽﾄ 0
//      -2：500BP4のｱｼｽﾄ-5
//  -3～-5：300BP4で新規に作成した値
//   1～ 5：0と同波形（最大傾度）。H276,H279を気持ち変化させている。
// ※H276、H278（初期値）は5000とする。（初期値を下げすぎるとDCLの影響で波形がひずむ）
		case  5:pWrk[276-1]=    21845; pWrk[277-1]=      0; pWrk[278-1]=    21845; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4ﾊｰﾄﾞの5
		case  4:pWrk[276-1]=    17100; pWrk[277-1]=      0; pWrk[278-1]=    17100; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4ﾊｰﾄﾞの5
		case  3:pWrk[276-1]=    16100; pWrk[277-1]=      0; pWrk[278-1]=    16100; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4ﾊｰﾄﾞの5
		case  2:pWrk[276-1]=    15100; pWrk[277-1]=      0; pWrk[278-1]=    15100; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4ﾊｰﾄﾞの5
		case  1:pWrk[276-1]=    14100; pWrk[277-1]=      0; pWrk[278-1]=    14100; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4ﾊｰﾄﾞの5
		case  0:break;//pWrk[276-1]=    13100; pWrk[277-1]=      0; pWrk[278-1]=    13100; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4ﾊｰﾄﾞの5
		case -1:pWrk[276-1]=2000+3000; pWrk[277-1]=  150  ; pWrk[278-1]=2000+3000; pWrk[279-1]=    200; pWrk[280-1]=    150;break;//500BP4ﾊｰﾄﾞの0
		case -2:pWrk[276-1]=2000+3000; pWrk[277-1]=   75  ; pWrk[278-1]=2000+3000; pWrk[279-1]=    100; pWrk[280-1]=     75;break;//500BP4ﾊｰﾄﾞの-5
		case -3:pWrk[276-1]=2000+3000; pWrk[277-1]=   60  ; pWrk[278-1]=2000+3000; pWrk[279-1]=     80; pWrk[280-1]=     60;break;//
		case -4:pWrk[276-1]=2000+3000; pWrk[277-1]=   45  ; pWrk[278-1]=2000+3000; pWrk[279-1]=     60; pWrk[280-1]=     45;break;//
		case -5:pWrk[276-1]=2000+3000; pWrk[277-1]=   30  ; pWrk[278-1]=2000+3000; pWrk[279-1]=     40; pWrk[280-1]=     30;break;//MIN調整
//D 500BP4参考
//D		case  5:pWrk[276-1]=    21845; pWrk[277-1]=      0; pWrk[278-1]=    21845; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;
//D		case  4:pWrk[276-1]=2000+2000; pWrk[277-1]=150+150; pWrk[278-1]=2000+2000; pWrk[279-1]=200+200; pWrk[280-1]=150+150;break;
//D		case  3:pWrk[276-1]=2000+1500; pWrk[277-1]=150+113; pWrk[278-1]=2000+1500; pWrk[279-1]=200+150; pWrk[280-1]=150+113;break;
//D		case  2:pWrk[276-1]=2000+1000; pWrk[277-1]=150+75 ; pWrk[278-1]=2000+1000; pWrk[279-1]=200+100; pWrk[280-1]=150 +75;break;
//D		case  1:pWrk[276-1]=2000 +500; pWrk[277-1]=150+38 ; pWrk[278-1]=2000 +500; pWrk[279-1]=200 +50; pWrk[280-1]=150 +38;break;
//D		//--------------------------------------------------------------------------------------------------------------------
//D		case  0:break;//pWrk[276-1]=2000   +0; pWrk[277-1]=150 +0 ; pWrk[278-1]=2000   +0; pWrk[279-1]=200  +0; pWrk[280-1]=150   +0;break;
//D		//--------------------------------------------------------------------------------------------------------------------
//D		case -1:pWrk[276-1]=2000 -250; pWrk[277-1]=150-15 ; pWrk[278-1]=2000 -250; pWrk[279-1]=200 -20; pWrk[280-1]=150 -15;break;
//D		case -2:pWrk[276-1]=2000 -500; pWrk[277-1]=150-30 ; pWrk[278-1]=2000 -500; pWrk[279-1]=200 -40; pWrk[280-1]=150 -30;break;
//D		case -3:pWrk[276-1]=2000 -750; pWrk[277-1]=150-45 ; pWrk[278-1]=2000 -750; pWrk[279-1]=200 -60; pWrk[280-1]=150 -45;break;
//D		case -4:pWrk[276-1]=2000-1000; pWrk[277-1]=150-60 ; pWrk[278-1]=2000-1000; pWrk[279-1]=200 -80; pWrk[280-1]=150 -60;break;
//D		case -5:pWrk[276-1]=      500; pWrk[277-1]=   75  ; pWrk[278-1]=      500; pWrk[279-1]=    100; pWrk[280-1]=     75;break;
//2011.09.28-----
		default:break;}
	}else{	/*========================他処理(標準)　アシスト="-1"→データ読み、ハードと1ﾎﾟｲﾝﾄずらす======================*/
		switch (gss_Select_dital[P_ARC_ASSIST]){//標準はベースがない
//2011.09.28+++++
// 300BP4用波形アシストパラメータ
// ｱｼｽﾄ= 0：前300BP4(V1.06)、500BP4のｱｼｽﾄ5 H276=H278=0 で前300BP4処理
//      -1：500BP4のｱｼｽﾄ-1
//      -2：500BP4のｱｼｽﾄ-5
//  -3～-5：300BP4で新規に作成した値
//   1～ 5：0と同波形（最大傾度）。H276,H279を気持ち変化させている。
// ※H276、H278（初期値）は5000とする。（初期値を下げすぎるとDCLの影響で波形がひずむ）
		case  5:pWrk[276-1]=    21845; pWrk[277-1]=      0; pWrk[278-1]=    21845; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4標準の5
		case  4:pWrk[276-1]=    20845; pWrk[277-1]=      0; pWrk[278-1]=    20845; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4標準の5
		case  3:pWrk[276-1]=    19845; pWrk[277-1]=      0; pWrk[278-1]=    19845; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4標準の5
		case  2:pWrk[276-1]=    18845; pWrk[277-1]=      0; pWrk[278-1]=    18845; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4標準の5
		case  1:pWrk[276-1]=    17845; pWrk[277-1]=      0; pWrk[278-1]=    17845; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4標準の5
		case  0:break;//pWrk[276-1]=        0; pWrk[277-1]=      0; pWrk[278-1]=        0; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//500BP4標準の5
		case -1:pWrk[276-1]=2000+3000; pWrk[277-1]=  150  ; pWrk[278-1]=2000+3000; pWrk[279-1]=    200; pWrk[280-1]=    150;break;//500BP4標準の-1
		case -2:pWrk[276-1]=2000+3000; pWrk[277-1]=   75  ; pWrk[278-1]=2000+3000; pWrk[279-1]=    100; pWrk[280-1]=     75;break;//500BP4標準の-5
		case -3:pWrk[276-1]=2000+3000; pWrk[277-1]=   60  ; pWrk[278-1]=2000+3000; pWrk[279-1]=     80; pWrk[280-1]=     60;break;//
		case -4:pWrk[276-1]=2000+3000; pWrk[277-1]=   45  ; pWrk[278-1]=2000+3000; pWrk[279-1]=     60; pWrk[280-1]=     45;break;//
		case -5:pWrk[276-1]=2000+3000; pWrk[277-1]=   30  ; pWrk[278-1]=2000+3000; pWrk[279-1]=     40; pWrk[280-1]=     30;break;//MIN調整
//D 500BP4参考
//D		case  5:pWrk[276-1]=    21845; pWrk[277-1]=      0; pWrk[278-1]=    21845; pWrk[279-1]=      0; pWrk[280-1]=  32752;break;//ﾊｰﾄﾞの5
//D		case  4:pWrk[276-1]=2000+3000; pWrk[277-1]=150+150; pWrk[278-1]=2000+3000; pWrk[279-1]=200+200; pWrk[280-1]=150+150;break;//ﾊｰﾄﾞの4
//D		case  3:pWrk[276-1]=2000+2000; pWrk[277-1]=150+150; pWrk[278-1]=2000+2000; pWrk[279-1]=200+200; pWrk[280-1]=150+150;break;//ﾊｰﾄﾞの4
//D		case  2:pWrk[276-1]=2000+1500; pWrk[277-1]=150+113; pWrk[278-1]=2000+1500; pWrk[279-1]=200+150; pWrk[280-1]=150+113;break;//ﾊｰﾄﾞの3
//D		case  1:pWrk[276-1]=2000+1000; pWrk[277-1]=150+75 ; pWrk[278-1]=2000+1000; pWrk[279-1]=200+100; pWrk[280-1]=150 +75;break;//ﾊｰﾄﾞの2
//D		case  0:pWrk[276-1]+=     500; pWrk[277-1]+=   38 ; pWrk[278-1]+=     500; pWrk[279-1]+=    50; pWrk[280-1]+=    38;break;//ﾊｰﾄﾞの1
//D		//--------------------------------------------------------------------------------------------------------------------
//D		case -1:break;//pWrk[276-1]=2000   +0; pWrk[277-1]=150 +0 ; pWrk[278-1]=2000   +0; pWrk[279-1]=200  +0; pWrk[280-1]=150   +0;break;//ﾊｰﾄﾞの0
//D		//--------------------------------------------------------------------------------------------------------------------
//D		case -2:pWrk[276-1]=2000 -250; pWrk[277-1]=150-15 ; pWrk[278-1]=2000 -250; pWrk[279-1]=200 -20; pWrk[280-1]=150 -15;break;//ﾊｰﾄﾞの-1
//D		case -3:pWrk[276-1]=2000 -500; pWrk[277-1]=150-30 ; pWrk[278-1]=2000 -500; pWrk[279-1]=200 -40; pWrk[280-1]=150 -30;break;//ﾊｰﾄﾞの-2
//D		case -4:pWrk[276-1]=2000 -750; pWrk[277-1]=150-45 ; pWrk[278-1]=2000 -750; pWrk[279-1]=200 -60; pWrk[280-1]=150 -45;break;//ﾊｰﾄﾞの-3
//D		case -5:pWrk[276-1]=      500; pWrk[277-1]=   75  ; pWrk[278-1]=      500; pWrk[279-1]=    100; pWrk[280-1]=     75;break;//ﾊｰﾄﾞの-5
//2011.09.28-----
		default:break;}
	}
    if (pWrk[ 276 - 1] > 32752) {pWrk[ 276 - 1] = 32752;}//H276
    if (pWrk[ 276 - 1] < 0)     {pWrk[ 276 - 1] =     0;}
    if (pWrk[ 277 - 1] > 32752) {pWrk[ 277 - 1] = 32752;}//H277
    if (pWrk[ 277 - 1] < 0)     {pWrk[ 277 - 1] =     0;}
    if (pWrk[ 278 - 1] > 32752) {pWrk[ 278 - 1] = 32752;}//H278
    if (pWrk[ 278 - 1] < 0)     {pWrk[ 278 - 1] =     0;}
    if (pWrk[ 279 - 1] > 32752) {pWrk[ 279 - 1] = 32752;}//H279
    if (pWrk[ 279 - 1] < 0)     {pWrk[ 279 - 1] =     0;}
    if (pWrk[ 280 - 1] > 32752) {pWrk[ 280 - 1] = 32752;}//H280
    if (pWrk[ 280 - 1] < 0)     {pWrk[ 280 - 1] =     0;}

//2010.03.18 田中追記ここまで　＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝


// @-R040701RTW[半固定2]
    //hpiWrite( hpicmdOUTWLDADJST , (pusint)&pWrk[ 0 ] );  //半固定パラメータ送信 2019.04.02 del ihara
    //hpiWrite( hpicmdOUTWLDADJST2, (pusint)&pWrk[ WLDADJST_1LEN ] );//半固定パラメータ２送信 2019.04.02 del ihara
#if 1
    //hpiWrite( hpicmdOUTWLDADJST3, (pusint)&pWrk[ WLDADJST_2LEN ] );//半固定パラメータ３送信 2007.2.13 ＤＳＰ側未完成のため動作させない。 2019.04.02 del ihara
#endif
    return;
}
#if false
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      トーチＯＮ処理                                                      */
/*  [引数]                                                                  */
/*      usint   SendData    メインへの送信データ                            */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004.10.13  R040701RTW-TAWERS       西川    NY20041013              */
/*--------------------------------------------------------------------------*/
static  void    TorchOnProc( usint SendData )
{
int     isContArc;
usint   Data;

// @-R040701RTW
    if( GetSrvStatus( ) != 2 )  //サーボOFF
    {
dbgWrite( 'T' , '0' , 0xffff , 0 );
        Data = 0x0002;
        ifdprWrite( ifdprcmdWeldIfErr , &Data );    //溶接IFエラー
        return;
    }
    if( isMainPowerSts == 0 )//主電源OFF
    {
dbgWrite( 'T' , '0' , 0xfffe , 0 );
        Data = 0x0001;
        ifdprWrite( ifdprcmdWeldIfErr , &Data );    //溶接IFエラー
        return;
    }
dbgWrite( 'T' , '0' , 0x1000 , 0 );
    isCD = 0;       // NY20041013
    if( ContArcTimer )
    {
        isContArc = 1;
        isEnbDelay = 0;
    }
    else
    {
        isContArc = 0;
        isEnbDelay = 1;
    }
    weldCancel( );                          //周期タスクキャンセル
    WeldAdjOut_Proc( isContArc );           // @-R040701RTW// NY20041013
    ctlclsDrctSet( );
    ctlclsWeldStart( );                     //スローダウン値セット
    wipReCalc( );
    sipReCalc( );
    wipReset( );
    sspdSend( );
    wcndSend( );
    W_DousaSirei( SendData );       // DSPに送信    NY20041021
    weldStart( );                   // 周期タスク起動
//  SetWeldStatus( 1 );             // 起動中
//  SetMotorStatus( 1 );            // 起動中
    ResetContArcTimer( );           // NY20041013
    DataRecTorchOn( );              // NY20041025
    Set_WeldMotor( 1 );     // NY20041024   一番最後
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      トーチＯＦＦ処理                                                    */
/*  [引数]                                                                  */
/*      usint   SendData    メインへの送信データ                            */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004.10.13  R040701RTW-TAWERS       西川    NY20041013              */
/*--------------------------------------------------------------------------*/
static  void    TorchOffProc( usint SendData )
{
    Set_WeldMotor( 0 );     // NY20041024   一番最初
dbgWrite( 'T' , '0' , 0x2000 , 0 );
    SetContArcTimer( );         // NY20041013
    W_DousaSirei( SendData );   // DSPに送信    NY20041021
    ctlclsStop( );
    DataRecTorchOff( );         // NY20041025
//  SetWeldStatus( 0 );
//  SetMotorStatus( 0 );        // 停止
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接動作コマンド処理                                                */
/*  [引数]                                                                  */
/*      usint       Parm        付随データ                                  */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 5.31  R040301RTW-TAWERS       田中                            */
/*      2004. 8.25  R040701RTW-TAWERS       田中                            */
/*      2004. 9.13  R040701RTW-TAWERS       田中                            */
/*      2004.10.13  R040701RTW-TAWERS       西川    NY20041013              */
/*--------------------------------------------------------------------------*/
static  void    WeldPower_Proc( usint Parm )
{// @-R040301RTW
usint   Edge;
usint   wldpwr = WLDPWR;
usint   SendData;

    Edge = wldpwr ^ WLDPWR_Old;
    WLDPWR_Old = wldpwr;          //エッジ更新
    SendData = wldpwr;
dbgWrite( 'T' , '0' , wldpwr , 0 );
    if( Edge & 0x0001 )                 //トーチON：エッジ検出
    {
        if( wldpwr & 0x0001 )           //トーチON
        {
            TorchOnProc( SendData );
        }
        else//トーチOFF
        {
            TorchOffProc( SendData );
        }
        return;
    }
    if( Edge & 0xfffe )         //トーチＳＷ以外
    {
//  NY20041016  スティックチェックは、ＤＳＰ側で制
//              →  スティックチェックを送信しておけば、
//                  主電源ＯＦＦ→ＯＮになったときＤＳＰ側で
//                  制御するように変更したのでこの処理不要
//      if( wldpwr & 0x000C )   // スティックチェック
//      {
//          if( isMainPowerSts == 0 )
//          {
//              SendData = 0x0001;
//              ifdprWrite( ifdprcmdWeldIfErr , &SendData );//溶接IFエラー
//              return;     // 2004. 9.22
//          }
//      }
        W_DousaSirei( SendData );   // NY20041021
    }
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      サーボ電源ＯＦＦ                                                    */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 5.31  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
void    SrvPower_Off( void )
{
usint   Parm;

    SetSrvStatus( 0 );      // NY20041024
    SetMotorStatus( 0 );    // NY20041024   一番最初

    _200VOut( 0 );                          //P94:ﾌｨｰﾀﾞｱﾝﾌﾟOFF
    Parm = 0x0000;
    hpiWrite( hpicmdOUTSRVSEQ , &Parm );    //DSPに送信
    wspdCancel( );                          //サーボ速度タスク停止
    ctlclsStop( );
//  SetMotorStatus( 0 );
//  SetSrvStatus( 0 );
    sspdZeroSend( );
    sipReset( );
    return;
}

/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      サーボ電源制御コマンド処理                                          */
/*  [引数]                                                                  */
/*      usint       Parm        付随データ                                  */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 5.31  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
static  void    SrvPower_Proc( usint Parm )
{// @-R040301RTW
dbgWrite( 'S' , 'O' , 0x0000 , 0 );
    if( SRVPWR )
    {
        if( GetSrvStatus( ) )//サーボON中は無視すること:サーボONﾀｽｸとサーボ速度制御ﾀｽｸが同じリソースを使うことになるので
        {
dbgWrite( 'S' , 'O' , 0x1000 , 0 );
            ;
        }
        else
        {
dbgWrite( 'S' , 'O' , 0x2000 , 0 );
            srvonCancel( );     //サーボＯＮタスクキャンセル
            srvonStart( );      //サーボＯＮタスク起動
        }
    }
    else
    {
dbgWrite( 'S' , 'O' , 0x3000 , 0 );
        SrvPower_Off( );
    }
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      サーボ制御指令コマンド処理                                          */
/*  [引数]                                                                  */
/*      usint       Parm        付随データ                                  */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 5.31  R040301RTW-TAWERS       田中                            */
/*      2004. 9. 2  R040701RTW-TAWERS       田中                            */
/*      2004. 9.27  R040701RTW-TAWERS       田中    <ALT1>                  */
/*--------------------------------------------------------------------------*/
static  void    SrvCtrl_Proc( usint Parm )
{// @-R040301RTW
usint   Edge;
usint   srvctl = SRVCTL;
usint   SendData;

    Edge = srvctl ^ SRVCTL_Old;
    SRVCTL_Old = srvctl;

    if( Edge & 0x0001 )                                     //モータ：ON/OFF変化あり
    {
        if( srvctl & 0x0001 )                               //モータON
        {
            if( GetSrvStatus( ) != 2 )                      //サーボOFF         // @-R040701RTW<ALT1>
            {
                SendData = 0x0002;                          //2004. 9. 2
                ifdprWrite( ifdprcmdWeldIfErr , &SendData );//溶接IFエラー
                return;                                                         // @-R040701RTW<ALT1>
            }
            wspdCancel( );                                   //サーボ速度タスクキャンセル
            ctlclsDrctSet( );
            ctlclsSrvStart( );
            sipReCalc( );
            sipReset( );
            sspdSend( );
            wspdStart( );                                   //サーボ速度タスク起動
            SetMotorStatus( 2 );    //  一番最後
        }
        else//モータOFF
        {
            SetMotorStatus( 0 );    // NY20041024   一番最初
            ctlclsStop( );
//          SetMotorStatus( 0 );//モータ：送給していない
        }
    }
    else//モータ：変化なし
    {
        if( GetMotorStatus( ) )
        {
            if( ctlclsDrctCheck( ) )
            {
                ctlclsDrctSet( );
                DSPSendTimeInit( );                         //５msタイマスタート
                XEvPost( &wspdEvent );
            }
        }
    }
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      エラー処理                                                          */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 4  R040301RTW-TAWERS       田中                            */
/*--------------------------------------------------------------------------*/
//2004. 8.26
//static  void    Error_Proc( void )
//{// @-R040301RTW
//usint   Parm;
//
//  weldCancel( );
//  SetWeldStatus( 0 );
//  SrvPower_Off( );                       //サーボOFF
// @-R040701RTW
//  OUTPUT &= ( 0xffff - 0x0004 );
//  Output( OUTPUT );    //主電源出力OFF
//  Parm = 0x0000;
//  hpiWrite( hpicmdOUTWLDOUT , &Parm );//溶接制御出力コマンドDSPへ送信
//  MainPower_Proc( 0 );//主電源ＯＦＦ
//  return;
//}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接データ記録要求応答処理                                          */
/*  [引数]                                                                  */
/*      int         ReqFlag         ０＝初回，１＝２回目以降                */
/*      int         BuffNo          格納バッファ＃                          */
/*      int         Mode            0:TP    1:PC                            */// @-R050701RK1
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004.07.05  R040301RTW-TAWERS   上内    <ALT1>                      */
/*      2005.07.15  R050701RK1-TW溶接記録2  津田                            */
/*--------------------------------------------------------------------------*/
static  void    WeldRecordSend( int ReqFlag , int BuffNo , lint Mode )
{
pusint  pDPR    = ifdprWeldDataPtr( BuffNo );
int     ReadLen;
usint   Ans[2];

    if( ReqFlag == 0 )
    {
// @-R050701RK1
//--    pDPR[ 0 ] = readFirstFile( &pDPR[1] , 2048 );
        pDPR[ 0 ] = readFirstFile( &pDPR[1] , 2048 , Mode );
    }
    else
    {
// @-R050701RK1
//--    pDPR[ 0 ] = readFile( &pDPR[1] , 2048 );
        pDPR[ 0 ] = readFile( &pDPR[1] , 2048 , Mode );
    }
    Ans[ 0 ]  = BuffNo;
    if( pDPR[ 0 ] == 0 )
    {
        Ans[ 1 ]  = 0;          // ＥＯＦ
// @-R050701RK1
        if( Mode == 1 )
            clearFileMonPtr_PC( );
    }
    else
    {
        Ans[ 1 ]  = 1;          // データあり
    }
    ifdprWrite( ifdprcmdWLDDATSET , Ans );
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      一元電圧／送給データ送信                                            */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004.09.30  R040701RTW-TAWERS       上内    [一元]                  */
/*--------------------------------------------------------------------------*/
static  void    send1GenTbl( void )
{// @-R040701RTW
PA2STBL     pSTbl;
PS2VTBL     pVTbl;
PWELDTABLE  pTBL = GetWeldTable( );

    switch( DC_PMODE )
    {
        case 2: // 短絡
            pSTbl = &pTBL->A2S_Short;
            pVTbl = &pTBL->S2V_Short;
            break;
        case 1: // パルス
        default:
            pSTbl = &pTBL->A2S_Pulse;
            pVTbl = &pTBL->S2V_Pulse;
            break;
    }
    ifdprWrite_2( ifdprcmdWLD1GENDATA , 0x0100 , &pVTbl->Volt[0] );
    ifdprWrite_2( ifdprcmdWLD1GENDATA , 0x0201 , &pVTbl->Volt[128] );
    ifdprWrite_2( ifdprcmdWLD1GENDATA , 0x1102 , &pSTbl->Speed[0] );
    ifdprWrite_2( ifdprcmdWLD1GENDATA , 0x1203 , &pSTbl->Speed[128] );
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接シーケンス１受信処理                                            */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004.10.13  R040701RTW-TAWERS       西川    NY20041013              */
/*--------------------------------------------------------------------------*/
static  void    Recv_WeldSeq1( void )
{
    if( WELDSEQ1 & 0x0001 )
        SetContArcTimer( );
    ifdprWrite( ifdprcmdWLDSEQ1 , &WELDSEQ1 );
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      メインアラーム時の処理                                              */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 8.26  R040701RTW-TAWERS       田中                            */
/*      2005. 1. 7  R0501XXRK1-その他       西川                            */
/*--------------------------------------------------------------------------*/
void    TaskHaltProc( void )
{// @-R040701RTW
    SrvPower_Off( );        //サーボＯＦＦ
    MainPower_Proc( 0 );    //主電源ＯＦＦ
    //Output( 0 , 0 , 0 );    //周辺出力ＯＦＦ    // @-R0501XXRK1 2006.8.29 ihara
    dbgTASK( );
    while( 1 )
    {
        WDG_Clear( );
    }
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接条件リセット処理                                                */
/*  [引数]                                                                  */
/*      usint       RstPtn          リセットする種類のパターン              */
/*                                      d0:絶対値テーブル                   */
/*  [戻り値]                                                                */
/*      lint        0                                                       */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2005.01.27  R050103RK1-TAWERSｱｰｸﾌﾞﾛｰ    津田                        */
/*      2005.04.12  R0504XXRK1-不具合           津田    [WSET_RST]          */
/*--------------------------------------------------------------------------*/
////static  lint    WeldSetResetProc( usint RstPtn )
////{
////    if( RstPtn & 0x0001 )
////        DataUpdate( );
////    return( 0 );
////}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接条件テーブル：最後のテーブルか判断                              */
/*  [引数]                                                                  */
/*      PWELDTABLE  pWT     溶接条件テーブルポインタ                        */
/*  [戻り値]                                                                */
/*      int     １＝テーブル終わり、０＝テーブルあり                        */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      外部フラッシュにダウンロードするときは、イレーズ処理で、            */
/*      メモリに0xffをライト後データを書き込むので0xffをテーブル終了とする  */
/*  [更新履歴]                                                              */
/*      2005. 2.14  R050204RK1-TW溶接条件自動       田中                    */
/*--------------------------------------------------------------------------*/
static  int     IsWeldTbl( PWELDTABLE pTbl )
{// @-R050204RK1
PWELDCODE   pCode = &pTbl->WeldCode;

    if( pCode->material != 0xff )
        return( 0 );
    if( pCode->method != 0xff )
        return( 0 );
    if( pCode->wire != 0xff )
        return( 0 );
    if( pCode->extension != 0xff )
        return( 0 );
    return( 1 );
}
#endif
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接条件テーブルが新バージョンかのチェック関数                      */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      int         0:旧バージョン      1:新バージョン                      */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2005.09.27  R050902RK1-溶接条件設定拡張     津田                    */
/*--------------------------------------------------------------------------*/
int isNewWeldTable( void )
{
PNEW_WLDTBL pTbl = WLDTBL_PTR;

    if( xmemcmp( WldTblType , pTbl->Type , 16 ) == 0 )  // 新バージョン2005.12.27 del
      return( 1 );
    return( 0 );	// 2006.12.19 del
    //return( 1 );	// 2006.12.19 変更
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接条件テーブルポインタ取得関数                                    */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      PWELDTABLE  溶接条件テーブルポインタ                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2005.09.27  R050902RK1-溶接条件設定拡張     津田                    */
/*--------------------------------------------------------------------------*/
PWELDTABLE  getWeldTablePtr( void )
{
PWELDTABLE  pTbl;

    if( isNewWeldTable( ) )
        pTbl = NEW_WLDTBL_PTR;
    else
        pTbl = OLD_WLDTBL_PTR;
    return( pTbl );
}
#if false
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接種別ＩＤコマンド送信処理                                        */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2005. 2.14  R050204RK1-TW溶接条件自動       田中                    */
/*      2005.09.27  R050902RK1-溶接条件設定拡張     津田                    */
/*--------------------------------------------------------------------------*/
static  void    WldKindIDProc( void )
{// @-R050204RK1
// @-R050902RK1
//--PWELDTABLE  pWT = (PWELDTABLE)0x001A0000;
PWELDTABLE  pWT = getWeldTablePtr( );
PWELDCODE   pCode;
int         Cnt;

    ifBuff[ 0 ] = 0x0000;                               //シーケンス番号０～
    for( Cnt = TBLCNT ; Cnt ; Cnt-- )
    {
        if( IsWeldTbl( pWT ) )                          //溶接条件テーブル終わり
            break;
                                                        //溶接種別セット
        pCode = &pWT->WeldCode;
        ifBuff[ 1 ] =  pCode->material;                 //材質コード
        ifBuff[ 2 ] =  pCode->method;                   //溶接法コード
        ifBuff[ 3 ] =  pCode->pulseMode;                //溶接種別フラグ
        ifBuff[ 4 ] =  pCode->pulseType;                //予約
        ifBuff[ 5 ] =  pCode->wire;                     //ワイヤ径コード
        ifBuff[ 6 ] =  pCode->extension;                //突き出し長コード
        ifBuff[ 7 ] =  pCode->dummy1;                   //予約
        ifBuff[ 8 ] =  pCode->dummy2;                   //予約
        ifdprWrite( ifdprcmdWLDKINDID , &ifBuff[ 0 ] ); //メインに送信
        ifBuff[ 0 ] = ifBuff[ 0 ] + 1;                  //シーケンス番号更新
        pWT++;                                          //次のテーブルへ
    }
    ifBuff[ 0 ] |= 0x0100;                              //終了フラグ
    xmemset( &ifBuff[ 1 ] , 0 , 2*8 );                  //ＡＬＬ０
    ifdprWrite( ifdprcmdWLDKINDID , &ifBuff[ 0 ] );     //メインに送信
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接種別名称定義テーブルエンドチェック                              */
/*  [引数]                                                                  */
/*      PWELDNAME   pTbl        溶接種別名称定義                            */
/*  [戻り値]                                                                */
/*      int         1:テーブルエンド                                        */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2005.09.27  R050902RK1-溶接条件設定拡張     津田                    */
/*--------------------------------------------------------------------------*/
static  int     chkWldKindNameTblEnd( PWELDNAME pTbl )
{
    if( pTbl->Kind != 0 )
        return( 0 );
    if( pTbl->Code != 0 )
        return( 0 );
    return( 1 );
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接種別名称定義応答コマンド送信処理                                */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2005.09.27  R050902RK1-溶接条件設定拡張     津田                    */
/*--------------------------------------------------------------------------*/
static  void    WldKindNameProc( void )
{
PWELDNAME   pTbl = WLDNAMETBL_PTR;
int         Cnt, Len;
char        *pName;
usint       *pBuff;

    ifBuff[ 0 ] = 0x0000;                                       // シーケンス番号初期化
    if( isNewWeldTable( ) )
    {
        for( Cnt = WELDNAME_TBLCNT ; Cnt ; --Cnt , ++pTbl )
        {
            if( chkWldKindNameTblEnd( pTbl ) )                  // テーブル終わり？
                break;

            ifBuff[ 1 ] = pTbl->Kind;
            ifBuff[ 2 ] = pTbl->Code;
            pName = pTbl->Name;
            pBuff = &ifBuff[ 3 ];
            for( Len = WELDNAMELEN / 2 ; Len ; --Len )
            {
                *pBuff = *pName;
                ++pName;
                *pBuff |= ( *pName << 8 );
                ++pName;
                ++pBuff;
            }
            ifdprWrite( ifdprcmdWLDKINDNAME , &ifBuff[ 0 ] );   // メインに送信
            ifBuff[ 0 ] = ifBuff[ 0 ] + 1;                      // シーケンス番号更新
        }
    }
    ifBuff[ 0 ] |= 0x0100;                                      // 終了フラグ
    xmemset( &ifBuff[ 1 ] , 0 , 10 * 2 );
    ifdprWrite( ifdprcmdWLDKINDNAME , &ifBuff[ 0 ] );           //メインに送信
    return;
}
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      Ｉ／Ｆタスク通常処理                                                */
/*  [引数]                                                                  */
/*      なし                                                                */
/*  [戻り値]                                                                */
/*      なし                                                                */
/*  [出力]                                                                  */
/*      なし                                                                */
/*  [特記事項]                                                              */
/*      なし                                                                */
/*  [更新履歴]                                                              */
/*      2004. 6. 4  R040301RTW-TAWERS       田中                            */
/*      2004.07.05  R040301RTW-TAWERS   上内    <ALT1>                      */
/*      2004. 8.26  R040701RTW-TAWERS       田中                            */
/*      2004. 9.10  R040701RTW-TAWERS       田中                            */
/*      2004.09.30  R040701RTW-TAWERS       上内    [一元]                  */
/*      2004.10.13  R040701RTW-TAWERS       西田    [ｵｰﾄｴｸｽﾃﾝｼｮﾝ]           */
/*      2004.10.14  R040701RTW-TAWERS       西川    NY20041014              */
/*      2005. 1. 7  R0501XXRK1-その他       西川                            */
/*      2005.01.26  R050103RK1-TAWERSｱｰｸﾌﾞﾛｰ    津田                        */
/*      2005. 2.14  R050204RK1-TW溶接条件自動       田中                    */
/*      2005.04.12  R0504XXRK1-不具合           津田    [WSET_RST]          */
/*      2005.07.15  R050701RK1-TW溶接記録2  津田                            */
/*      2005.09.27  R050902RK1-溶接条件設定拡張     津田                    */
/*--------------------------------------------------------------------------*/
void    ifTASK_Proc( void )
{// @-R040301RTW
usint   Cmd , Data;
usint   Parm;

    while( 1 )
    {
        XEvWait( &ifEvent , FALSE , INFINITE );
        XEvClear( &ifEvent );
        while( ifcRead( &errFIFO , &Cmd , &Parm ) == 0 )
        {
            switch( Cmd )
            {
                case ERROR_SRV:         //サーボエラー
                    if( SRVINERR )
                        Data = convErrNo( SRVINERR );
                    else
                        Data = Parm;
                    if( Data )
                    {
                        SrvPower_Off( );                    //サーボOFF
                        ifdprWrite( ifdprcmdINSRVERR , &Data );
                    }
                    break;
                case ERROR_WLDPWR:      //溶接電源異常検出
                    MainPower_Proc( 0 );    //主電源ＯＦＦ  // @-R040701RTW 
                    ifdprWrite( ifdprcmdINWLDPWRERR , &Parm );
                    break;
                case ERROR_INPUT:       //溶接電源制御入力（周辺入力）
                    if( Parm )          // NY20041014
                        MainPower_Proc( 0 );    //主電源ＯＦＦ  // @-R040701RTW 
                    ifdprWrite( ifdprcmdINWLDIN , &Parm );
                    break;
                case ERROR_WLD:         //溶接異常検出
                    ifdprWrite( ifdprcmdINWLDERR , &Parm );
                    break;
                case ERROR_PRST:        //ＰＲＳＴ
                    SrvPower_Off( );                        //サーボOFF
                    Data = 0x0002;                          //200V Off
                    ifdprWrite( ifdprcmdINSRVERR , &Data ); //サーボ/CPUコマンド送信
                    break;
            }
        }
        while( ifcRead( &ifFIFO , &Cmd , &Parm ) == 0 )
        {
            switch( Cmd )
            {
                case fifoWLDIN:             //溶接電流検出入力
                    ifdprWrite( ifdprcmdINWLDSTS , &Parm );
                    break;
                case fifoWLDOUT:            //溶接制御出力
                    WeldOut_Proc( Parm );
                    break;
                case fifoSRVPWR:            //サーボ電源制御
                    SrvPower_Proc( Parm );
                    break;
                case fifoSRVCTL:            //サーボ制御指令
                    SrvCtrl_Proc( Parm );
                    break;
                case fifoWLDMOV:            //溶接電源動作
                    WeldPower_Proc( Parm );
                    break;
                case fifoDOWNLOAD:          // @-R040701RTW
dbgWrite( 'D','N',0x0000 , 0 );
                    //Output( 0 , 0 , 0 );    //周辺出力OFF   // @-R0501XXRK1 2006.8.29 ihara
dbgWrite( 'D','N',0x1111 , 0 );
                    download( );
                    break;
// @-R040301RTW <ALT1>
                case fifoWLDDATREQ_F:       // 記録データ取得要求（初回）
// @-R050701RK1
//--                WeldRecordSend( 0 , Parm );
                    WeldRecordSend( 0 , Parm , 0 );
                    break;
                case fifoWLDDATREQ_S:       // 記録データ取得要求（２回目以降）
// @-R050701RK1
//--                WeldRecordSend( 1 , Parm );
                    WeldRecordSend( 1 , Parm , 0 );
                    break;
                case fifoWLDRECREQ:         // 溶接データ記録要求（開始・停止）
                    if( Parm )
                        WeldDataRecStart( );
                    else
                        WeldDataRecStop( );
                    break;
                case fifoSAMPLING:          // データサンプリング
                    samplingStop( );        // NY20041021
                    samplingStart( 1 );
                    break;
                case fifoQLTYRST:
                    resetWeldMon( );
                    break;
                case fifoWELDLOGREQ:        // 溶接ログ要求
                    wldlogSendData( );
                    resetWeldLog( );
                    break;
// @-R040701RTW [一元]
                case fifoWLDSETDATA1:       // 溶接設定データ１
                    hpiWrite( hpicmdOUTWLDSET1 , &CmdData_26[0] );   // @-R040701RTW [一元]
                    break;
                case fifoWLD1GENREQ:        // 一元電圧／送給速度要求
                    send1GenTbl( );
                    break;
// @-R040701RTW [ｵｰﾄｴｸｽﾃﾝｼｮﾝ]
                case fifoSNSINIT:           // センサパラメータ初期化
                    snsInit( );
                    break;
//  溶接シーケンス１    // NY20041013
                case fifoWELDSEQ1:
                    Recv_WeldSeq1( );
                    break;
//  主電源制御      NY20041017
                case fifoMAINPOWER:
                    MainPower_Proc( Parm );
                    break;
//  主電源ＯＮ      NY20041021
                case fifoMAINPOWER_ON:
                    MainPower_StsOn( );
                    break;
// @-R050103RK1
// @-R0504XXRK1 [WSET_RST]
//--            case fifoWSETRST:
//--                WeldSetResetProc( Parm );
//--                break;
// @-R050204RK1
                case fifoWldKindIDReq:      //溶接種別ID要求
                    WldKindIDProc( );
                    break;
// @-R050701RK1
                case fifoWLDDATREQ_PC_F:    // 記録データ取得要求(PC)（初回）
                    WeldRecordSend( 0 , Parm , 1 );
                    break;
                case fifoWLDDATREQ_PC_S:    // 記録データ取得要求(PC)（２回目以降）
                    WeldRecordSend( 1 , Parm , 1 );
                    break;
                case fifoWLDDATBUFFREQ:     // 溶接データ記録バッファ取得要求
                    WeldDataRecBuffAns( Parm );
                    break;
// @-R050902RK1
                case fifoWldKindNameReq:    // 溶接種別名称定義要求
                    WldKindNameProc( );
                    break;

                default:
                    break;
            }
        }
    }

    return;
}
#endif
/* end */
