/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ＲＡＭ領域定義                                                      */
/*  [最終更新日]                                                            */
/*      2004. 4. 8  R040301RTW-TAWERS       西川                            */
/*      2004. 9.28  R040701RTW-TAWERS       田中    <ALT1-HD>               */
/*      2004.10.12  R040701RTW-TAWERS       西田    [ｵｰﾄｴｸｽﾃﾝｼｮﾝ]           */
/*      2004.10.18  R040701RTW-TAWERS       田中    <溶接ログ>              */
/*      2004.11.19  R0411XXRK1-不具合       西田    <ｴｸｽﾃﾝｼｮﾝ>              */
/*      2005. 4.20  R050309RK1-TAWERSｱｰｸｾﾝｻ 嶋倉                            */
/*      2005.04.20  R050404RK1-TWﾜｲﾔ送給係数微調    西田                    */
/*      2005.05.09  R050407RK1-溶接ﾛｸﾞ2     津田                            */
/*      2005.07.15  R050701RK1-TW溶接記録2  津田                            */
/*--------------------------------------------------------------------------*/
#include    "custom.h"
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      スタック                                                            */
/*  [使用状況]                                                              */
/*      ﾀｽｸI/F                                                              */
/*--------------------------------------------------------------------------*/
#define     STACK_SIZE  ( 512/4 )
lint    if_Stack[ STACK_SIZE ];
lint    wcond_Stack[ STACK_SIZE ];
lint    wspd_Stack[ STACK_SIZE ];
lint    tim_Stack[ STACK_SIZE ];
lint    sampling_Stack[ STACK_SIZE ];
lint    fpga_Stack[ STACK_SIZE ];
lint    asns_Stack[ STACK_SIZE ];
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      Ｔｈｒｅａｄ                                                        */
/*  [使用状況]                                                              */
/*      ﾀｽｸI/F                                                              */
/*--------------------------------------------------------------------------*/
//XTHREAD     BootThread;             // Ｂｏｏｔ
//XTHREAD     ifThread;
//XTHREAD     wcondThread;
//XTHREAD     wspdThread;
//XTHREAD     srvonThread;
//XTHREAD     timThread;
//XTHREAD     samplingThread;
//XTHREAD     fpgaThread;
//XTHREAD     asnsThread;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      Ｅｖｅｎｔ                                                          */
/*  [使用状況]                                                              */
/*      ﾀｽｸI/F                                                              */
/*--------------------------------------------------------------------------*/
//XEVENT      ifEvent;
//XEVENT      wcondEvent;
//XEVENT      wspdEvent;
//XEVENT      timEvent;
//XEVENT      samplingEvent;
//XEVENT      asnsEvent;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ＡＰＬワーク領域                                                    */
/*  [使用状況]                                                              */
/*                                                                          */
/*--------------------------------------------------------------------------*/
int     dbgTimer;
int     DBGSW;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      タイマ割り込み／タイマタスク                                        */
/*  [使用状況]                                                              */
/*      静的        電源投入時から                                          */
/*--------------------------------------------------------------------------*/
int     TimeTaskTimer;
int     DSPSendTimer;
//int     DelayTimer;
int     samplingTimer;
int     MainPowerTimer;
int     PRSTtimer;
int     KessouTimer;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ｈｐｉ（ＤＳＰ）ドライバ                                            */
/*  [使用状況]                                                              */
/*      静的        電源投入時から                                          */
/*--------------------------------------------------------------------------*/
//int     hpiFlag;           2005.12.27 del
            //  ０＝初期状態（ リセット前 ）
            //  １＝リセット後（DSP-WDG無効区間）
            //  ２＝ＤＳＰ初期化完了受信後（DSP-WDG有効区間）
//usint   hpiIntrWork[ 128 ]; 2005.12.27 del
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      Ｍａｉｎ－ＩＦ ＤＰＲａｍ ドライバ                                  */
/*  [使用状況]                                                              */
/*      静的        電源投入時から                                          */
/*--------------------------------------------------------------------------*/
usint   ifdprWork[ 256 ];
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ｉｆｃ用ＦＩＦＯ                                                    */
/*  [使用状況]                                                              */
/*      ﾀｽｸI/F      電源投入時から                                          */
/*--------------------------------------------------------------------------*/
//IFC         ifFIFO;
//IFC         errFIFO;
//IFC         asnsFIFO;
/*--------------------------------------------------------------------------*/
/*  [データ説明]                                                            */
/*      usint   OUTPUT                  出力状態（現在状態）                */
/*                                          d7､d8=未使用                    */
/*                                          d5=ガスバルブ１,d4=ガスバルブ２ */
/*                                          d3=未使用      ,d2=主電源制御   */
/*                                          d1=プッシュプル１,d0=プッシュプル２ */
/*      usint   WLDPWR                  溶接電源動作指令(現在状態)          */
/*                                          d0:溶接起動指令                 */
/*                                          d1:リフトアップEI/DI            */
/*      usint   WLDPWR_Old              溶接電源動作指令(前回状態)          */
/*      usint   WLDINERR                溶接異常検出                        */
/*                                          d0:アーク                       */
/*                                          d1:スティック                   */
/*      usint   WLDINPWRERR             溶接電源異常検出                    */
/*                                          d1:2次過電流異常                */
/*      usint   WLDINCUR                溶接電流検出                        */
/*                                          d0:電流検出                     */
/*                                          d1:リフトアップ                 */
/*                                          d1:リフトダウン                 */
/*      usint   SRVPWR                  サーボ電源                          */
/*                                          d0:サーボ                       */
/*      usint   SRVCTL                  サーボ制御指令(現在状態)            */
/*                                          d0:モータ回転                   */
/*                                          d1:モータ回転方向               */
/*      usint   SRVCTL_Old              サーボ制御指令(前回状態)            */
/*      usint   SRVFEADBACK             サーボフィードバック                */
/*                                          d0:サーボ                       */
/*                                          d1:モータ                       */
/*      usint   SRVINERR                サーボエラー（エラーコード格納)     */
/*      usint   INB                     今回周辺入力状態(チャタリング)      */
/*      usint   IOB1                    前回周辺入力状態(チャタリング)      */
/*      usint   IOB2                    前々回周辺入力状態(チャタリング)    */
/*                                        d0:サーマル１                     */
/*                                        d1:サーマル２                     */
/*                                        d2:１次過電圧                     */
/*                                        d3:欠相異常                       */
/*                                        d15:ＰＲＳＴ                      */
/*      usint   INB_Old                 チャタリング結果(前回)              */
/*      usint   wspdBuff[ 8 ]           DSP送信用バッファ(サーボ速度制御)   */
/*      usint   wcondBuff[ 64 ]         DSP送信用バッファ(溶接制御タスク)   */
/*                                      ★初期化時にエラー&バージョン情報を送信するのに使う*/
/*      usint   CONDAMP                 電流指令値                          */
/*      usint   CONDVOLT                電圧指令値                          */
/*      usint   CONDWELDSPD             溶接速度                            */
/*      usint   CONDWIRESPD             ワイヤ速度指令                      */
/*      sint    Adjust_A                電流補正値                          */
/*      sint    Adjust_V                電圧補正値                          */
/*      usint   CmdData_26[ 10 ]        溶接設定データ１                    */
/*      usint   WELDSEQ1                溶接シーケンス１                    */
/*      usint   MAIN_POWER              主電源制御                          */
/*--------------------------------------------------------------------------*/
#if false
usint   OUTPUT;
usint   WLDPWR;
usint   WLDPWR_Old;
//usint   WLDINERR;    2005.12.27 del
//usint   WLDINPWRERR; 2005.12.27 del
//usint   WLDINCUR;    2005.12.27 del
usint   SRVPWR;
//usint   SRVCTL;      2005.12.27 del
usint   SRVCTL_Old;
usint   SRVFEADBACK;
usint   SRVINERR;
usint   INB;
usint   IOB1;
usint   IOB2;
usint   INB_Old;
// @-R040301RTW <ALT1> 2004.07.05 溶接データ記録コマンド62h受信領域
usint   QualityMonCond[ 27 ];   // 品質モニタ条件ラッチデータ
usint   WLDRECDATA[ 8 ];        // 溶接データ記録ラッチデータ
usint   CONDAMP;
//usint   CONDVOLT; 2005.12.27 del
usint   CONDWELDSPD;
usint   CONDWIRESPD;
sint    Adjust_A;
sint    Adjust_V;
usint   CmdData_26[ 10 ];       // 溶接設定データ１
//usint   WELDSEQ1;    2005.12.27 del
//usint   MAIN_POWER;  2005.12.27 del
//usint   LastSend_11; 2005.12.27 del
#endif
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      SampleFile処理用                                                    */
/*  [使用状況]                                                              */
/*      静的        xxx                                                     */
/*--------------------------------------------------------------------------*/
int         fileReadPtr;        // 読み出しポインタ( 読み出しバイト数 )

/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      Ｉ／Ｆタスク用                                                      */
/*  [使用状況]                                                              */
/*      ﾀｽｸI/F                                                              */
/*--------------------------------------------------------------------------*/
int         ifErrorStatus;
IFCTL       _ifctl;
CTLCLS      _ctlcls;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      補間演算用                                                          */
/*  [使用状況]                                                              */
/*      ﾀｽｸI/F                                                              */
/*--------------------------------------------------------------------------*/
WIPCB       _wipcb;
SIPCB       _sipcb;
PWELDTABLE  pWT;
usint       wspdBuff[ 8 ];
//2008.09.11 usint       wcondBuff[ 64 ]; 
usint       wcondBuff[ 96 ]; //2008.09.11 可変２対応のため領域確保
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      共有メモリ                                                          */
/*  [使用状況]                                                              */
/*      ﾀｽｸI/F                                                              */
/*--------------------------------------------------------------------------*/
UNIONDATA   _union;
#if false
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      データサンプリング                                                  */
/*  [使用状況]                                                              */
/*      静的        サンプリング時のみ                                      */
/*--------------------------------------------------------------------------*/
int             isSampling;
char            WeldDataRecSts[ 4 ];
int             WeldDataRecCnt;
int             WeldMonLogPhase;
int             WeldMonTimer;
WLDMONERR       wldmonerr[ 8 ];
int             wldmonerrChata;
int             wldmonerrCnt;
sint            WeldMonOffset_A;
sint            WeldMonOffset_V;
char            Weld_Mon_Log_F[ 4 ];
//------------------------------------
//フリーカウンタ、単純平均で出力値を取得したらクリアするため
int             AvrS_Amp;
int             AvrS_Volt;
usint           Free_ShortCnt;
usint           Free_Arc;
//------------------------------------
//移動平均クラス
AVERAGE_M       sampleAMP;
AVERAGE_M       sampleVOLT;
AVERAGE_M       sampleSHORTCNT;
AVERAGE_M       sampleARC;
AVERAGE_M       samplePARM1;
AVERAGE_M       samplePARM2;
AVERAGE_M       sampleQAMP;
AVERAGE_M       sampleWIRESPD;
AVERAGE_M       samplePLS;
// @-R040701RTW [指令値]
//--AVERAGE_M       sampleCONDAMP;
//--AVERAGE_M       sampleCONDVOLT;
//--AVERAGE_M       sampleCONDWELDSPD;
AVERAGE_M       sampleSHORTCNT_R;
AVERAGE_M       sampleARC_R;
// @-R040701RTW<ALT1>
AVERAGE_M       maindprAMP;
AVERAGE_M       maindprVOLT;
AVERAGE_M       maindprQAMP;
AVERAGE_M       maindprPARM1;
AVERAGE_M       maindprPARM2;
//------------------------------------
//単純平均クラス
AVERAGE_S       fpgaAMP;
AVERAGE_S       fpgaVOLT;
AVERAGE_S       aveAMP;
AVERAGE_S       aveVOLT;
AVERAGE_S       aveSHORTCNT;
AVERAGE_S       aveARC;
AVERAGE_S       avePARM1;
AVERAGE_S       avePARM2;
AVERAGE_S       aveQAMP;
AVERAGE_S       aveWIRESPD;
// @-R040701RTW [指令値]
//--AVERAGE_S       aveCNDAMP;
//--AVERAGE_S       aveCNDVOLT;
//--AVERAGE_S       aveCNDSPD;
AVERAGE_S       avePLS;
// @-R040701RTW<溶接ログ>
AVERAGE_S       wldlogAMP;
AVERAGE_S       wldlogVOLT;
AVERAGE_S       wldlogSHORTCNT;
// @-R050407RK1
AVERAGE_S       wldlogARC;
AVERAGE_S       wldlogQAMP;
AVERAGE_S       wldlogWIRESPD;
//------------------------------------
//フリーカウンタ
FREECNT         freecntSHORTCNT;
FREECNT         freecntARC;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      品質モニタ応答用データを格納（MAINのｽﾃｰﾀｽ領域に書き込む）           */
/*  [データ説明]                                                            */
/*          usint   WeldMonRec[ 16 ]                                        */
/*                              [0]平均電流                                 */
/*                              [1]平均電圧                                 */
/*                              [2]短絡回数                                 */
/*                              [3]アーク切れ                               */
/*                              [4]パルス周波数                             */
/*                              [5]パラメータ１                             */
/*                              [6]パラメータ２                             */
/*                              [7]ダミー                                   */
/*                              [8]パルスカウンタ                           */
/*                              [9]ｑ軸電流                                 */
/*                              [10]ワイヤ速度                              */
/*                              [11]ダミー                                  */
/*                              [12]ダミー                                  */
/*                              [13]ダミー                                  */
/*                              [14]ダミー                                  */
/*                              [15]ダミー                                  */
/*--------------------------------------------------------------------------*/
usint           WeldMonRec[ 16 ];
/*====================================*/
usint           WeldDataRecRec[ 12 ];
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ＤＳＰからリードした値を格納                                        */
/*  [データ説明]                                                            */
/*      usint   sampleDSPBuff[ 16 ]                                         */
/*                          [ 0 ]   短絡回数積算値                          */
/*                          [ 1 ]   アーク切れ積算値                        */
/*                          [ 2 ]   パルス周期                              */
/*                          [ 3 ]   パラメータ１                            */
/*                          [ 4 ]   パラメータ２                            */
/*                          [ 5 ]   ダミー                                  */
/*                          [ 6 ]   ダミー                                  */
/*                          [ 7 ]   ダミー                                  */
/*                          [ 8 ]   パルスカウンタ（今回使わない）          */
/*                          [ 9 ]   ｑ軸電流                                */
/*                          [ 10 ]   ダミー                                 */
/*                          [ 11 ]   ダミー                                 */
/*                          [ 12 ]   ダミー                                 */
/*                          [ 13 ]   ダミー                                 */
/*                          [ 14 ]   ダミー                                 */
/*                          [ 15 ]   ダミー                                 */
/*--------------------------------------------------------------------------*/
usint   sampleDSPBuff[ 16 ];
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ＤＰＲＡＭ書き込み用サンプリングデータ格納                          */
/*  [データ説明]                                                            */
/*      usint   SamplingRec[ 16 ]                                           */
/*                                      [ 0 ]       平均電流                */
/*                                      [ 1 ]       平均電圧                */
/*                                      [ 2 ]       短絡回数                */
/*                                      [ 3 ]       アーク切れ              */
/*                                      [ 4 ]       パルス周波数            */
/*                                      [ 5 ]       パラメータ１            */
/*                                      [ 6 ]       パラメータ２            */
/*                                      [ 7 ]       ダミー                  */
/*                                      [ 8 ]       パルスカウンタ          */
/*                                      [ 9 ]       モータ電流（ｑ軸電流）  */
/*                                      [10 ]       ワイヤ速度              */
/*                                      [11～15 ]   ダミー                  */
/*--------------------------------------------------------------------------*/
usint       SamplingRec[ 16 ];          // @-R040701RTW<ALT1>
//------------------------------------
usint   SAMPLING_M;     //溶接データ記録：マクロ周期／５０
usint   SAMPLING_N;     //品質モニタ：平均化時間／５０
usint   SAMPLING_L;     //溶接データ記録：マクロ周期（１秒間の移動積算回数）
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      センサ                                                              */
/*  [使用状況]                                                              */
/*      静的                                                                */
/*--------------------------------------------------------------------------*/
usint       snsSW;          // @-R0411XXRK1  2004.11.19 ｾﾝｻｸﾗｽと別領域にする
SNSCLS      snscls;
AVERAGE_M   avr_snsV;

/*-------------------------------------------------------------*/
/*  [概要]                                                     */
/*      dbgTASK使用ﾜｰｸ                                         */
/*  [使用状況]                                                 */
/*                                                             */
/*-------------------------------------------------------------*/
int     dbgRP;
int     dbgWP;
DBGREC  dbgBuff[ DBG_MAX ];
uchar   vrDbgBuff[ 256 ];
#endif
/*-------------------------------------------------------------*/
/*  [概要]                                                     */
/*      ＣＲＡＴＥＲ実行フラグ   （１＝実行中）                */
/*  [使用状況]                                                 */
/*                                                             */
/*-------------------------------------------------------------*/
int     isCRATER;
/*-------------------------------------------------------------*/
/*  [概要]                                                     */
/*      主電源出力状態                                         */
/*  [使用状況]                                                 */
/*                                                             */
/*-------------------------------------------------------------*/
int     isMainPowerSts;
#if false
/*-------------------------------------------------------------*/
/*  [概要]                                                     */
/*      旧/新ハードのアドレス設定                              */
/*  [使用状況]                                                 */
/*                                                             */
/*-------------------------------------------------------------*/
// @-R040701RTW<ALT1-HD>
pusint      pFIFO_AMP;
pusint      pFIFO_VOLT;
pusint      pFIFO_CTL;
pusint      pDATSAMPLINGTIME;
unsigned char * pFPGA_PROG;
pusint      pFPGA_CTRL;
#endif
/*-------------------------------------------------------------*/
/*  [概要]                                                     */
/*      オートエクステンション用パラメータ                     */
/*  [使用状況]                                                 */
/*                                                             */
/*-------------------------------------------------------------*/
usint       AutoExtParm[ 10 ];
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      加速度                                                              */
/*  [データ説明]                                                            */
/*      DC_ACC          [0]＝トーチＳＷＯＮ（スローダウン中）               */
/*                      [1]＝初期短絡（初期短絡終了まで）                   */
/*                      [2]＝本溶接中（ＣＲＡＴＥＲ実行前まで）             */
/*                      [3]＝ＣＲＡＴＥＲ実行中                             */
/*                      [4]＝トーチＳＷＯＦＦ                               */
/*--------------------------------------------------------------------------*/
//int         DC_ACC;       //2004. 8.27
//int         DC_ACC[ 5 ];  //2004.10.12
int         DC_ACC_Offset[ 5 ]; // 加速度オフセット 2004.09.15
int         _ACC;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      パルス種別                                                          */
/*  [データ説明]                                                            */
/*      DC_PMODE        １＝パルス      ２＝短絡                            */
/*--------------------------------------------------------------------------*/
int         DC_PMODE;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      スローダウン速度                                                    */
/*--------------------------------------------------------------------------*/
//int         DC_SLOW;        //スローダウン速度//2004.10.12
int         DC_SLOW_Offset; //スローダウン速度 オフセット 2004.09.13
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接機種データ                                                      */
/*--------------------------------------------------------------------------*/
WELDCODE    DC_WELDCODE;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ワイヤ定数                                                          */
/*--------------------------------------------------------------------------*/
float       DC_RPM;
sint        G_Bunsi;
sint        G_Bunbo;
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      送給ディレイ時間                                                    */
/*--------------------------------------------------------------------------*/
//int       DC_DELAY;     //2004.10.12
//int     isEnbDelay;     // ０＝送給ディレイ禁止 2007.1.12REPEAT
int     DC_DELAY_Offset;    // 微調
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      連続アークスタート処理                                              */
/*--------------------------------------------------------------------------*/
//int     isCD;         // ０＝トーチＯＮ後、一度も電流検出なし 2005.12.27 del
int     ContArcTimer;   // 連続アークスタートタイマ
int     ContArc_Offset; // 微調
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接ログ：短絡回数カウントバッファ                                  */
/*  [データ説明]                                                            */
/*      usint   ErrStatusBuff[ 8 ]                                          */
/*                                      [ 0 ]       平均電流                */
/*                                      [ 1 ]       平均電圧                */
/*                                      [ 2 ]       短絡回数                */
/*                                      [ 3 ]       アーク切れ              */
/*                                      [ 4 ]       モータ電流              */
/*                                      [ 5 ]       パラメータ１            */
/*                                      [ 6 ]       パラメータ２            */
/*                                      [ 7 ]       ダミー                  */
/*--------------------------------------------------------------------------*/
// @-R040701RTW
usint   ErrStatusBuff[ 8 ];
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接種別ＩＤバッファ                                                */
/*  [データ説明]                                                            */
/*      usint       ifBuff              コマンドフラグ                      */
/*                                      材質コード                          */
/*                                      溶接法コード                        */
/*                                      溶接種別フラグ                      */
/*                                      予約                                */
/*                                      ワイヤ径コード                      */
/*                                      予約                                */
/*                                      予約                                */
/*--------------------------------------------------------------------------*/
usint   ifBuff[ 16 ];   // @-R050204RK1

#if false
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      アークセンサ                                                        */
/*  [使用状況]                                                              */
/*                                                                          */
/*--------------------------------------------------------------------------*/
ASNSCLS asnscls;
#endif
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      ワイヤ送給係数                                                      */
/*--------------------------------------------------------------------------*/
sint    WireSpd_Offset; // 微調
#if false
/*--------------------------------------------------------------------------*/
/*  [概要]                                                                  */
/*      溶接データ記録バッファ制御データ    @-R050701RK1                    */
/*--------------------------------------------------------------------------*/
PFILEMON    pFileMon;
PFILEMON    pFileMon_TP;
PFILEMON    pFileMon_PC[ 2 ];
usint       isWeldRecComm;
#endif

/* end */
