//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ｏｕｔｐｕｔ＿ｍｏｔｏｒ＿ｍｅｍｂｅｒ
//　【関数レベル】
//　　　ＬＥＶＥＬ：３
//  【機能説明】
//      モータ出力
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      なし
//  【更新履歴】
//      2006.07.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#include  "custom.h"

void output_motor_member(Bit16 xtt_Ctrl_word , Bit16 xtt_Ctrl_word_bkup)
{
     unsigned short int pui_Motor_ctrl;

     pui_Motor_ctrl = 0x0000;          //2006.8.30 clear

     if (xtt_Ctrl_word.Motor_ctrl_code != xtt_Ctrl_word_bkup.Motor_ctrl_code) //前回の状態と比較
     {
         if (xtt_Ctrl_word.Motor_ctrl_code)      //モータ制御コードチェック
         {
             //モータ起動
             pui_Motor_ctrl = 0x0003;
         } else {
             //モータ停止
             //pui_Motor_ctrl = 0x0000;
             pui_Motor_ctrl = 0x0001; //2007.3.22
         }
         //IMJTOCR4  = 0x07; //2006.2.15 割禁　ihara     
         //hpiWrite( hpicmdOUTSRVSEQ , &pui_Motor_ctrl);   //DSPに送信 2019.04.02 del ihara
         //IMJTOCR4  = 0x05; //2006.2.9 割許　ihara     
     }
     return;
}
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of L3_output_motor_member.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
