//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ｃｄ＿ｅｒｒ＿ｍｅｍｂｅｒ
//　【関数レベル】
//　　　ＬＥＶＥＬ：３
//  【機能説明】
//      電流検出異常
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      なし
//  【更新履歴】
//      2006.07.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#include "custom.h"

unsigned char cd_err_member(unsigned char xuc_Err_code)
{
    unsigned char puc_Err_code;

    puc_Err_code = xuc_Err_code;          //2006.9.8 現状の継承

//<><><><><><><><><>本ファイルは2007.1.26ファイルごと移植<><><><><><><><><>


#if 0
//<><><><> 待機中に電流、電圧が規定値を超えるか、電流のみが超えるとエラー発生 2007.1.19 <><><><>　2007.1.22削除
    if(gtt_Ctrl_flag.Second_output_err == ON)
    {
       puc_Err_code = CURRENT_DETECT_ERR;      //電流検出異常
    }
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#endif

#if 1  
    //<><><><><><><> 2007.1.22 復活 <><><><><><><><>
    if (gtt_Ctrl_flag.Welder_init_execution == ON)
    {
        //if(gtt_Internal_pack.Data.Out.fPowerStatus.Bit1Sw.Cd == ON) //2007.1.22削除
        if(gtt_Fpga.Curr_result > 10)   //2007.1.22　変更
        {
           puc_Err_code = CURRENT_DETECT_ERR;      //電流検出異常
        }
    }
    //<><><><><><><><><><><><><><><><><><><><><><><>
#endif





    return(puc_Err_code);
}
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of L3_cd_err_member.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
