//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ａｔｔｒｉｂｕｔｅ＿ｓｅｔ＿ｍｅｍｂｅｒ
//　【関数レベル】
//　　　ＬＥＶＥＬ：３
//  【機能説明】
//      溶接機属性の設定
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      なし
//  【更新履歴】
//      2006.07.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#include  "custom.h"

void attribute_set_member(void)
{
#if G3_NEW_COM
        //gtt_Attribute.Version[]                = "000";        //ROMver　（３文字）
        //gtt_Attribute.Kind_code                = 'D';          //種別（Ｄ：ＭＡＧ　Ｃ：ＴＩＧ　１文字）
        //gtt_Attribute.Capacity_code[]          = "450";        //定格出力　（３文字）
        //gtt_Attribute.Model_code[]             = "GZ3";        //機種（３文字）
        //gtt_Attribute.Special_code[]           = "   ";        //特殊品（３文字）：標準品はスペース３個
#endif
        return;
}
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of L3_attribute_set_member.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
