//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ｒｅ＿ｃｏｍ＿ｓｅｔ＿ｍｅｍｂｅｒ
//　【関数レベル】
//　　　ＬＥＶＥＬ：３
//  【機能説明】
//      リモコン通信設定
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      なし
//  【更新履歴】
//      2007.12.03  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#include  "custom.h"

void re_com_set_member(void)
{
     // ＵＡＲＴ設定
     S1SMOD     = 0x08;	//
     S1MOD      = 0x2e;                //8BitUART InternalClock 2BitStop EVENParity

     S1TCNT     = 0x10;                //1/8Freq Disable

     S1BAUR     = 7;                   //ボーレート19200bps

     S1RCNT     = 0x00;                //ＳＩＯ０受信許可
     S1RCNT     = 0x10;                //ＳＩＯ０受信許可

     S1TCNT     = 0x10;                //ＳＩＯ０送信制御レジスタ(送信許可)
     S1TCNT     = 0x11;                //ＳＩＯ０送信制御レジスタ(送信許可)

     SI03SEL    = 0x00;                //割り込み要因レジスタ
     SI03MASK   = 0x54;                //割り込みマスク(全割り込み禁止)
     return;
}
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of L3_re_com_set_member.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
