//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ｄｓｐ＿ｃｏｄｅ＿ｔｒａｎｓｆｅｒ＿ｍｅｍｂｅｒ
//　【関数レベル】
//　　　ＬＥＶＥＬ：３
//  【機能説明】
//      ＤＳＰコード転送、起動
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      ｈｐｉライブラリーを使用（ｈｐｉ＿ｌｉｂ．ｃ　ｈｐｉ＿ａｐｉ．ｃ）
//      ＩＦライブラリーを使用
//  【更新履歴】
//      2006.07.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#include  "custom.h"

int dsp_code_transfer_member(void)
{
	unsigned short int   Parm;
	int rc = 0;

	Parm = 1;

        P11DATA &= (0xff - 0x04);      // P115 = 0
        initDelay(100);
        P11DATA |= 0x04;               // P115 = 1
        //if(hpiInit())        rc |= 0x01;  2019.04.02 del ihara
        //if(hpiDownLoad())    rc |= 0x02;  2019.04.02 del ihara
        //hpiOpen();                        2019.04.02 del ihara
        //hpiBoot();                        2019.04.02 del ihara

	initDelay(1000);
	initDelay(1000);

	NormalInit();            //ＩＦライブラリ

        gtt_Ctrl_flag.Dsp_ready = OFF;
        //hpiWrite( hpicmdIFREADY , &Parm ); //CPU READY 信号をDSPに転送 2019.04.02 del ihara
        while(gtt_Ctrl_flag.Dsp_ready == OFF){
              WDG_Clear();
        }
	// DSP-WDG起動
	P11DATA |= 0x08;         // P114 = 1

        return(rc);
}
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of L3_dsp_code_transfer_member.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
