//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ｐｃ＿ｃｏｍ＿ｓｅｔ＿ｍｅｍｂｅｒ
//　【関数レベル】
//　　　ＬＥＶＥＬ：３
//  【機能説明】
//      ＰＣ通信設定
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      なし
//  【更新履歴】
//      2006.07.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#include  "custom.h"

void pc_com_set_member(void)
{
     //ＵＡＲＴ設定
     S2SMOD     = 0x08;
     S2MOD      = 0x20;                //8BitUART InternalClock Stop 1Bit NoneParity

     S2TCNT     = 0x10;                //1/8Freq Disable
     S2BAUR     = 15;                  //ボーレート9600bps

     S2RCNT     = 0x00;                //ＳＩＯ１受信許可
     S2RCNT     = 0x10;                //ＳＩＯ１受信許可

     S2TCNT     = 0x10;                //ＳＩＯ１送信制御レジスタ(送信許可)
     S2TCNT     = 0x11;                //ＳＩＯ１送信制御レジスタ(送信許可)

     SI03SEL    = 0x00;                //割り込み要因レジスタ
     SI03MASK   = 0x54;                //割り込みマスク(全割り込み禁止)
     return;
}
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of L3_pc_com_set_member.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
