//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ｒ８＿ｃｏｍ＿ｓｅｔ＿ｍｅｍｂｅｒ
//　【関数レベル】
//　　　ＬＥＶＥＬ：３
//  【機能説明】
//      Ｒ８通信設定
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      なし
//  【更新履歴】
//      2006.07.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#include  "custom.h"

void r8_com_set_member(void)
{
     // ＵＡＲＴ設定
     S4SMOD     = 0x08;	//
     S4MOD      = 0x20;                //8BitUART InternalClock 1BitStop NO_Parity

     S4TCNT     = 0x10;                //1/8Freq Disable

     S4BAUR     = 7;                   //ボーレート19200bps

     S4RCNT     = 0x00;                //ＳＩＯ０受信許可
     S4RCNT     = 0x10;                //ＳＩＯ０受信許可

     S4TCNT     = 0x10;                //ＳＩＯ０送信制御レジスタ(送信許可)
     S4TCNT     = 0x11;                //ＳＩＯ０送信制御レジスタ(送信許可)

     SI45SEL    = 0x00;                //割り込み要因レジスタ
     SI45MASK   = 0x40;                //割り込みマスク(全割り込み禁止)
     return;
}
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of L3_r8_com_set_member.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
