//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//　【関数名】
//　　　ｒｏｂ＿ｓｎｄ＿ｃｌａｓｓ
//　【関数レベル】
//　　　ＬＥＶＥＬ：２
//  【機能説明】
//      ロボット送信 ＆　ＰＣ（ＳＧシリーズ）送信
//  【引数】
//      なし
//  【戻り値】
//      なし  
//  【備考】
//      なし
//  【更新履歴】
//      2006.07.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#include  "custom.h"
#include  <string.h>
#include  <math.h> //2009.03.26

//----------------------------
// BP4 Phase12 by @Tny 2009.02.19
static	ubool	bBlink_Check;
static	ubool	gb_Volt7SegBlink;
//----------------------------

//------------------------------------------------
// BP4 Phase13 by @Tny 2009.02.23
#if 0
static char guc_Material_code[20][3] = {"STL", //軟鋼
                                        "SUS", //ＳＵＳ
                                        "ALH", //硬質アルミ
                                        "ALS", //軟質アルミ
                                        "STF", //軟鋼ＦＣＷ
                                        "SUF", //ステンレス（フェライト系）
                                        "FEZ", //Ｚｎメッキ
                                        "TI ", //チタン
                                        "ALB", //アルミブレーズ
                                        "SIB", //Ｓｉブレーズ
                                        "SUF"  //ステンレス（フェライト系）ＦＣＷ
                                         };

static char guc_Wire_code[20][2] =      {"06",
                                         "08",
                                         "09",
                                         "10",
                                         "12",
                                         "14",
                                         "16",
                                         "35",
                                         "45",
                                         "52"
                                         };

static char guc_Method_code[20][3]   =  {"CO2", //ＣＯ２
                                         "MAG", //ＭＡＧ
                                         "MIG", //ＭＩＧ
                                         "M9G", //ＭＡＧ（９０：１０）
                                         "TIG", //ＴＩＧ
                                         "MA2", //ＳＰ－ＭＡＧ２
                                         "M92", //ＳＰ－ＭＡＧ２（９０：１０）
                                         "MTS" //新ＣＯ２（ＨＧ－ＣＯ２）
                                         };

static char guc_Sequence_code[20][3] = {"NON", //通常シーケンス
                                        "CRT", //クレータ有り
                                        "ICR", //イニシャル　クレータ　（クレータパルスなし）
                                        "ICP", //イニシャル　クレータ　（クレータパルス有り）
                                        "SPT"  //アークスポット
                                        };
#endif
//---------------------------------------------------
                                       //****************

//---------------------------------------------------
// BP4 Phase13 by @Tny 2009.02.23	BP4 Phase16 by @Tny 2003.03.10
static char guc_ServiceMenu[SERVICE_DATA_NO][16]	= {	"                ", //S00 パスワード入力
														"DC TIG EN ﾎｯﾄI  ", //S01
														"DC TIG EN ﾎｯﾄT  ", //S02
														"DC TIG EN ﾎｯﾄST ", //S03
														"DC TIG EP ﾎｯﾄI  ", //S04
														"DC TIG EP ﾎｯﾄT  ", //S05
														"DC TIG EP ﾎｯﾄST ", //S06
														"AC(MIX) ﾎｯﾄI1   ", //S07
														"AC(MIX) ﾎｯﾄT1   ", //S08
														"AC(MIX) ﾎｯﾄT2   ", //S09
														"AC(MIX) ﾎｯﾄST   ", //S10
														//"ｶﾞｽｹﾞﾝｱﾂ ｹﾝｼｭﾂ  ", //S10 2009.04.03
														"ｻｲﾁｮｳｽﾎﾟｯﾄｼﾞｶﾝ  ", //S11
														"ｲﾁｼﾞﾃﾞﾝｱﾂｵﾌｾｯﾄ  ", //S12
														"ﾃﾞﾝﾘｭｳﾎｾｲ       ", //S13
														"CT ｵﾌｾｯﾄ        ", //S14
														"VT ｵﾌｾｯﾄ        ", //S15
														"ﾃﾞﾝｷｮｸﾀﾝﾗｸﾚﾍﾞﾙ  ", //S16
														"ﾋｮｳｼﾞﾎｾｲ        ", //S17
														"ｼｭﾂﾘｮｸﾁｮｳｾｲｹﾞｲﾝ ", //S18 2009.04.03
														//"S19 ------------", //S19
														"ｴﾗｰﾘﾚｷ ﾉ ｸﾘｱ    ", //S19	BP4 by @Tny 2009.04.08
														"S20 ------------", //S20
														"S21 ------------", //S21
														"S22 ------------", //S22
														"S23 ------------", //S23
														"S24 ------------", //S24
														"S25 ------------", //S25
														"S26 ------------", //S26
														"S27 ------------", //S27
														"S28 ------------", //S28
														"S29 ------------"  //S29
													};
//---------------------------------------------------
//---------------------------------------------------
// BP4 Phase14 by @Tny 2009.02.24	BP4 Phase16 by @Tny 2003.03.10
static char guc_RescueMenu[RESCUE_DATA_NO][16]		= {	"R00 ------------", //R00
                                                        "ｴﾗｰﾘﾚｷ ﾉ ｲﾁﾗﾝ   ", //R01
														//"ｴﾗｰﾘﾚｷ ﾉ ｸﾘｱ    ", //R02
														"CHﾒﾓﾘ ｷｵｸ ﾛｯｸ   ", //R02 2009.04.06
														"ﾒﾓﾘ ﾉ ｵｰﾙｸﾘｱ    ", //R03
														"ｴﾝﾁｮｳｱｼｽﾄ       ", //R04 2010.02.25
														//"ｱｰｸｷﾚﾎﾞｳｼｱｼｽﾄ   "  //R05 2010.02.25
														"ｱｰｸｹｲｿﾞｸｱｼｽﾄ    ", //R05 2010.02.25 2010.03.18
//														"ｺｳﾘｭｳﾊｹｲﾓｰﾄﾞ    "  //R06	「交流波形出力モード」追加		2011.11.08
														"ｺｳﾘｭｳｼｭﾂﾘｮｸﾓｰﾄﾞ "  //R06	「交流出力モード」に名称変更	2011.11.16
													};
static char guc_RescueMenu2[RESCUE_DATA_NO][2][16]	= {	"                ", "                ", //R00
                                                        "                ", "                ", //R01
														//" ｸﾘｱ ?  NO      ", " ｸﾘｱ ?  YES     ", //R02
														" ｼﾞｯｺｳ ?  NO    ", " ｼﾞｯｺｳ ?  YES   ", //R02 2009.04.06
														" ｸﾘｱ ?  NO      ", " ｸﾘｱ ?  YES     ", //R03
														" ｱｼｽﾄ?   OFF    ", " ｱｼｽﾄ?   ON     ", //R04 2010.01.20 by @Tny 2010.01.29 EXT→ｱｼｽﾄ
														" ｱｼｽﾄ?   OFF    ", " ｱｼｽﾄ?   ON     ", //R05 2010.02.25
//2011.11.08											" ﾓｰﾄﾞ?  NO      ", " ﾓｰﾄﾞ?  YES     "  //R06	「交流波形出力モード」追加		2011.11.08
														" ﾓｰﾄﾞ?   OFF    ", " ﾓｰﾄﾞ?   ON     "  //R06	「交流波形出力モード」文言修正	2011.11.08
													};
static char guc_ServiceMenu2[SERVICE_DATA_NO][2][16]	= {	"                ", "                ", //S00 パスワード入力
															"          A     ", "          A     ", //S01
															"          ms    ", "          ms    ", //S02 2009.04.13 msec->ms
															"          ms    ", "          ms    ", //S03 2009.04.13 msec->ms
															"          A     ", "          A     ", //S04
															"          ms    ", "          ms    ", //S05 2009.04.13 msec->ms
															"          ms    ", "          ms    ", //S06 2009.04.13 msec->ms
															"          A     ", "          A     ", //S07
															"          ms    ", "          ms    ", //S08 //2009.04.03 2009.04.13 msec->ms
															"          ms    ", "          ms    ", //S09 2009.04.13 msec->ms
															"          ms    ", "          ms    ", //S10 2009.04.13 msec->ms
															"          s     ", "          s     ", //S11 2009.04.13 sec->s
															"                ", "                ", //S12 2009.04.13 A->space
															"ﾎｾｲ?    ﾅｼ      ", "ﾎｾｲ?    ｱﾘ      ", //S13
															"                ", "                ", //S14
															"                ", "                ", //S15
															"          %     ", "          %     ", //S16
															"          A     ", "          A     ", //S17
															"                ", "                ", //S18
															" ｸﾘｱ ?  NO      ", " ｸﾘｱ ?  YES     ", //S19	BP4 by @Tny 2009.04.08
															"                ", "                ", //S20
															"                ", "                ", //S21
															"                ", "                ", //S22
															"                ", "                ", //S23
															"                ", "                ", //S24
															"                ", "                ", //S25
															"                ", "                ", //S26
															"                ", "                ", //S27
															"                ", "                ", //S28
															"                ", "                "  //S29
													};
//---------------------------------------------------


// BP4 Phase3 by @Tny 2009.01.13
static char guc_Dital_code[92][16]   = {"DC TIG ｽﾀｰﾄｷｮｸｾｲ", //P00
                                        "ﾎｯﾄ ﾃﾞﾝﾘｭｳ ﾚﾍﾞﾙ ", //P01
                                        "ﾃﾞﾝｱﾂﾋｮｳｼﾞ ｳﾑ   ", //P02
                                        "ｸﾚｰﾀ ｼｭｳﾘｮｳ ﾎｳﾎｳ", //P03
                                        "ﾃﾞﾝｷｮｸﾀﾝﾗｸ ｳﾑ   ", //P04
                                        "ﾋｮｳｼﾞ ﾎｼﾞ ｼﾞｶﾝ  ", //P05
                                        "AC ｱｰｸｷﾞﾚ ﾘｶﾊﾞﾘｰ", //P06
                                        "ﾋﾂﾞｹ/ｼﾞｶﾝ ｾｯﾃｲ  ", //P07
                                        "ｼﾞｺｸ ﾋｮｳｼﾞ ｾｯﾃｲ ", //P08
                                        "ﾃﾞﾝﾘｭｳﾋｮｳｼﾞﾅｲﾖｳ ", //P09
                                        "ﾃﾞﾝﾎﾞｳ ｼｮﾘ      ", //P10
                                        "ｱｰｸﾄﾞﾗｲﾌﾞ ﾚﾍﾞﾙ  ", //P11
                                        "ｼﾞｮｳｹﾝﾒｲ ﾆｭｳﾘｮｸ ", //P12 2009.03.07
                                        "LCDｺﾝﾄﾗｽﾄ       ", //P13 2009.03.07
                                        "ｴｷｽﾊﾟｰﾄﾓｰﾄﾞｶﾝﾄﾞ ", //P14 2009.03.07
                                        "ｴｷｽﾊﾟｰﾄﾏｽｸｼﾞｶﾝ  ", //P15 2010.01.08
                                        "ﾘﾓｺﾝｾﾝﾀｸ        ", //P16 2009.03.07
                                        "ｶﾍﾝﾊﾝﾌﾟｸｾﾝﾀｸ    ", //P17 //2009.03.16
                                        "ｼｭﾂﾘｮｸｾｲｹﾞﾝ     ", //P18 //2010.01.08 by @Tny
                                        "ﾏｲﾙﾄﾞﾊﾟﾙｽ       ", //P19 //2010.01.20 by @Tny
                                        "----------------", //P20 //2011.09.30
                                        //"AC ｼｭｳﾊｽｳ ﾋｮｳｼﾞ ", //P20 //2010.01.20 by @Tny
                                        //"ﾄﾞｳｻﾃﾞﾝｱﾂA      ", //P21 2009.02.13
                                        //"ｱｰｸｱｼｽﾄ         ", //P21 2010.02.25
                                        "ｺｳﾘｭｳﾊｹｲｱｼｽﾄ    ", //P21 2010.02.25　2010.03.18
//                                      "ｿﾌﾄｽﾀｰﾄｼﾞｶﾝ     ", //P22 2011.10.01			「ソフトスタート時間」削除 2011.10.31
                                        //"ﾄﾞｳｻﾃﾞﾝｱﾂC      ", //P22 2009.02.13
                                        //"----------------", //P23 2009.02.13 2009.03.07 del
                                        "ｼｮｳｻｲｼﾞｮｳｹﾝﾋｮｳｼﾞ", //P22 2011.10.03			「ソフトスタート時間」削除に伴う変更 2011.10.31
#if true	// <IIF NEW>
                                        "IIF ﾉ ｾﾝﾀｸ      ", //P23 <IIF NEW> 2009.11.17 by @Tny	「ソフトスタート時間」削除に伴う変更 2011.10.31
#else
                                        "ｶﾞｲﾌﾞﾄｸｾｲC      ", //P23 2009.02.13
#endif
                                        "----------------", //P24						「ソフトスタート時間」削除に伴う変更 2011.10.31
//                                        "ｻﾝﾌﾟﾘﾝｸﾞ        ", //P25 2009.02.13
//                                        "----------------", //P26
                                        "P ｹﾞｲﾝ          ", //P25 2019.08.21
                                        "I ｹﾞｲﾝ          ", //P26 2019.08.21
                                        "----------------", //P27
                                        "----------------", //P28
                                        "----------------", //P29
                                        "----------------", //P30
                                        "----------------", //P31
                                        "----------------", //P32
                                        "----------------", //P33
                                        "----------------", //P34
                                        "----------------", //P35
                                        "----------------", //P36
                                        "----------------", //P37
                                        "----------------", //P38
                                        "----------------", //P39
                                        "----------------", //P40
                                        "----------------", //P41
                                        "----------------", //P42
                                        "----------------", //P43
                                        "----------------", //P44
                                        "----------------", //P45
                                        "----------------", //P46
                                        "----------------", //P47
                                        "----------------", //P48
                                        "----------------", //P49
                                        "INPUT PASS WORD ", //P50
                                        "CHANGE PASS WORD", //P51
                                        "CONTROLLER LOCK ", //P52
                                        "SUB MONITOR TYPE", //P53
                                        "----------------", //P54
                                        "----------------", //P55
                                        "----------------", //P56
                                        "----------------", //P57
                                        "----------------", //P58
                                        "----------------", //P59
                                        "----------------", //P60
                                        "----------------", //P61
                                        "----------------", //P62
                                        "----------------", //P63
                                        "----------------", //P64
                                        "----------------", //P65
                                        "----------------", //P66
                                        "----------------", //P67
                                        "----------------", //P68
                                        "----------------", //P69
                                        "----------------", //P70
                                        "----------------", //P71
                                        "----------------", //P72
                                        "----------------", //P73
                                        "----------------", //P74
                                        "----------------", //P75
                                        "----------------", //P76
                                        "----------------", //P77
                                        "----------------", //P78
                                        "----------------", //P79
                                        "----------------", //P80
                                        "----------------", //P81
                                        "----------------", //P82
                                        "----------------", //P83
                                        "----------------", //P84
                                        "----------------", //P85
                                        "----------------", //P86
                                        "----------------", //P87
                                        "----------------", //P88
                                        "----------------", //P89
                                        "----------------", //P90
                                        //"ROBOT CONNECT   "  //ロボット接続時の表示 2008.10.03
                                        "<< ﾛﾎﾞｯﾄ ﾂｳｼﾝ >>"  //ロボット接続時の表示 2009.07.14
                                       };


static char guc_Dital_code2[92][3][16] = {"ｷｮｸｾｲ?  EN      ","ｷｮｸｾｲ?  EP      ","                ", //P00	// BP4 Phase16 by @Tny 2009.03.10
                                          "ﾚﾍﾞﾙ?  ｼﾞｬｸ     ","ﾚﾍﾞﾙ?  ﾋｮｳｼﾞｭﾝ  ","ﾚﾍﾞﾙ?  ｷｮｳ      ", //P01
                                          "ﾋｮｳｼﾞ?  ﾅｼ      ","ﾋｮｳｼﾞ?  ｱﾘ      ","                ", //P02
                                          "ﾎｳﾎｳ?  ﾂｳｼﾞｮｳ   ","ﾎｳﾎｳ?  ﾄｰﾁｽｲｯﾁ  ","                ", //P03
                                          "ﾀﾝﾗｸ ｹﾝﾁ?  ﾅｼ   ","ﾀﾝﾗｸ ｹﾝﾁ?  ｱﾘ   ","                ", //P04	BP4 Phase13 by @Tny 2009.02.24
                                          "          s     ","          s     ","          s     ", //P05   2010.01.29 sec→s
                                          "ﾘｶﾊﾞﾘｰ?  ﾅｼ     ","ﾘｶﾊﾞﾘｰ?  ｱﾘ     ","                ", //P06 2009.04.08 アリ、ナシの順番変更
                                          "   '  /  /      ","       :    ﾓﾄﾞﾙ","                ", //P07	→:0x7e/←:0x7f	BP4 Phase14 by @Tny 2009.02.24
                                          "ﾋｮｳｼﾞ?  ﾋﾂﾞｹ    ","ﾋｮｳｼﾞ?  ｼﾞｶﾝ    ","ﾋｮｳｼﾞ?  ﾅｼ      ", //P08
                                          "ﾋｮｳｼﾞ?  ﾍｲｷﾝﾁ   ","ﾋｮｳｼﾞ?  ｼﾞｯｺｳﾁ  ","                ", //P09
                                          "ﾃﾞﾝﾎﾞｳ?  ｱﾘ     ","ﾃﾞﾝﾎﾞｳ?  ﾅｼ     ","                ", //P10
                                          "ﾚﾍﾞﾙ?     %     ","ﾚﾍﾞﾙ?     %     ","                ", //P11
                                          "                ","                ","                ", //P12
                                          "ｺﾝﾄﾗｽﾄ?         ","ｺﾝﾄﾗｽﾄ?         ","ｺﾝﾄﾗｽﾄ?         ", //P13 LCD
                                          "                ","                ","                ", //P14 エキスパートモード 2009.03.07 2009.04.10 %削除
                                          "          s     ","          s     ","          s     ", //P15 エキスパートモード マスク時間 2010.01.08 2010.01.29 sec→s
                                          "BPR4            ","BPR1            ","                ", //P16 2009.03.28 BPR1,BPR4の順番変更
                                          "ｶﾍﾝﾊﾝﾌﾟｸ? ﾅｼ    ","ｶﾍﾝﾊﾝﾌﾟｸ? ｱﾘ    ","                ", //P17 2009.03.16
                                          "          A     ","          A     ","          A     ", //P18 2010.01.08 by @Tny
                                          "ﾚﾍﾞﾙ?     ﾚﾍﾞﾙ  ","ﾚﾍﾞﾙ?     ﾚﾍﾞﾙ  ","ﾚﾍﾞﾙ?     ﾚﾍﾞﾙ  ", //P19 2010.01.20 by @Tny
                                          "                ","                ","                ", //P20 2011.09.30
                                          //"ﾋｮｳｼﾞ? ﾅｼ       ","ﾋｮｳｼﾞ? ｱﾘ       ","                ", //P20 2010.01.20 by @Tny
                                          "ﾚﾍﾞﾙ?     ﾚﾍﾞﾙ  ","ﾚﾍﾞﾙ?     ﾚﾍﾞﾙ  ","ﾚﾍﾞﾙ?     ﾚﾍﾞﾙ  ", //P21 2010.03.03 アークアシスト
                                          //"                ","                ","                ", //P21 2010.02.26 アークアシスト
                                          //"          %     ","          %     ","          %     ", //P22 2009.02.13 エキスパートモード試験用
//                                          "          s     ","          s     ","          s     ", //P22 2011.10.01		「ソフトスタート時間」削除 2011.10.31
                                          //"                ","                ","                ", //P23 2009.02.13 エキスパートモード試験用
                                          "ﾋｮｳｼﾞ?  ﾅｼ      ","ﾋｮｳｼﾞ?  ｱﾘ      ","                ", //P22 2011.10.03		「ソフトスタート時間」削除に伴う変更 2011.10.31
                                          "                ","                ","                ", //P23					「ソフトスタート時間」削除に伴う変更 2011.10.31
                                          "          %     ","          %     ","          %     ", //P24 2009.02.13 エキスパートモード試験用
                                          "          cnt   ","          cnt   ","          cnt   ", //P25 2009.02.13 エキスパートモード試験用
                                          "                ","                ","                ", //P26
                                          "                ","                ","                ", //P27
                                          "                ","                ","                ", //P28
                                          "                ","                ","                ", //P29
                                          "                ","                ","                ", //P30
                                          "                ","                ","                ", //P31
                                          "                ","                ","                ", //P32
                                          "                ","                ","                ", //P33
                                          "                ","                ","                ", //P34
                                          "                ","                ","                ", //P35
                                          "                ","                ","                ", //P36
                                          "                ","                ","                ", //P37
                                          "                ","                ","                ", //P38
                                          "                ","                ","                ", //P39
                                          "                ","                ","                ", //P40
                                          "                ","                ","                ", //P41
                                          "                ","                ","                ", //P42
                                          "                ","                ","                ", //P43
                                          "                ","                ","                ", //P44
                                          "                ","                ","                ", //P45
                                          "                ","                ","                ", //P46
                                          "                ","                ","                ", //P47
                                          "                ","                ","                ", //P48
                                          "                ","                ","                ", //P49
                                          "                ","                ","                ", //P50
                                          "                ","                ","                ", //P51
                                          "                ","                ","                ", //P52
                                          "                ","                ","                ", //P53
                                          "                ","                ","                ", //P54
                                          "                ","                ","                ", //P55
                                          "                ","                ","                ", //P56
                                          "                ","                ","                ", //P57
                                          "                ","                ","                ", //P58
                                          "                ","                ","                ", //P59
                                          "                ","                ","                ", //P60
                                          "                ","                ","                ", //P61
                                          "                ","                ","                ", //P62
                                          "                ","                ","                ", //P63
                                          "                ","                ","                ", //P64
                                          "                ","                ","                ", //P65
                                          "                ","                ","                ", //P66
                                          "                ","                ","                ", //P67
                                          "                ","                ","                ", //P68
                                          "                ","                ","                ", //P69
                                          "                ","                ","                ", //P70
                                          "                ","                ","                ", //P71
                                          "                ","                ","                ", //P72
                                          "                ","                ","                ", //P73
                                          "                ","                ","                ", //P74
                                          "                ","                ","                ", //P75
                                          "                ","                ","                ", //P76
                                          "                ","                ","                ", //P77
                                          "                ","                ","                ", //P78
                                          "                ","                ","                ", //P79
                                          "                ","                ","                ", //P80
                                          "                ","                ","                ", //P81
                                          "                ","                ","                ", //P82
                                          "                ","                ","                ", //P83
                                          "                ","                ","                ", //P84
                                          "                ","                ","                ", //P85
                                          "                ","                ","                ", //P86
                                          "                ","                ","                ", //P87
                                          "                ","                ","                ", //P88
                                          "                ","                ","                ", //P89
                                          "                ","                ","                ", //P90
                                          "                ","                ","                "  //ロボット接続時の表示 2008.10.03
                                       };

//-------------------------------
// 「微弱モード」の追加		2011.10.28
//-------------------------------
static char guc_Dital_code2_HotLevel[4][17] = {"ﾚﾍﾞﾙ?  ﾋﾞｼﾞｬｸ    ","ﾚﾍﾞﾙ?  ｼﾞｬｸ     ","ﾚﾍﾞﾙ?  ﾋｮｳｼﾞｭﾝ  ","ﾚﾍﾞﾙ?  ｷｮｳ      "}; //P01
//-------------------------------
//
//-------------------------------


//-----------------------------------------------------------------------------------
// < IIF NEW >
//  ＩＩＦ設定画面関係					2009.11.17 @Tny
//-----------------------------------------------------------------------------------
// ＩＩＦ設定画面１行目
static char guc_Dital_Iif_Select_1st[6][4][16]	= {	"[ ]ｾｯﾃｲｾﾝﾀｸ     ", // 出力ポート設定画面
													"[ ]ﾎﾟｰﾄｾﾝﾀｸ     ",
													"[ ]OT:  ｷﾉｳ ｾﾝﾀｸ",
													"                ",
													"[ ]ｾｯﾃｲｾﾝﾀｸ     ", // 入力ポート設定画面
													"[1]ﾎﾟｰﾄｾﾝﾀｸ     ",
													"[2]IN:  ｷﾉｳ ｾﾝﾀｸ",
													"[3]IN: ﾄﾞｳｻ ｾﾝﾀｸ",
													"[ ]ｾｯﾃｲｾﾝﾀｸ     ", // アナログ入力ポート設定画面
													"[ ]ﾎﾟｰﾄｾﾝﾀｸ     ",
													"[ ]AG:  ｷﾉｳ ｾﾝﾀｸ",
													"                ",
													"[1]ｾｯﾃｲｾﾝﾀｸ     ", // 設定確定画面
													"[2]ｾｯﾃｲｶｸﾃｲ     ",
													"ﾃﾞﾝｹﾞﾝ ｦ        ",
													"                ",
													"[1]ｾｯﾃｲｾﾝﾀｸ     ", // アナログポートシフト量の校正画面
													"[2]ｾｯﾃｲｶｸﾃｲ     ",
													"AGﾎﾟｰﾄｺｳｾｲ      ",
													"                ",
													"[1]ｾｯﾃｲｾﾝﾀｸ     ", // ＩＩＦ設定終了画面
													"                ",
													"                ",
													"                "
												};
// ＩＩＦ設定画面２行目
static char guc_Dital_Iif_Select_2nd[6][4][16]	= {	"ｾｯﾃｲ:           ", // 出力ポート設定画面
													"ﾎﾟｰﾄ(OT)   :    ",
													"                ",
													"                ",
													"ｾｯﾃｲ:           ", // 入力ポート設定画面
													"ﾎﾟｰﾄ(IN)   :    ",
													"                ",
													"    ｾｯﾃﾝ ﾄﾞｳｻ   ",
													"ｾｯﾃｲ:           ", // アナログ入力ポート設定画面
													"ﾎﾟｰﾄ(AG)   :    ",
													"                ",
													"                ",
													"ｾｯﾃｲ:           ", // 設定確定画面
													"                ",
													"  ｻｲｷﾄﾞｳ ｼﾃｸﾀﾞｻｲ",
													"                ",
													"ｾｯﾃｲ:           ", // アナログポートシフト量の校正画面
													"AG ﾆ 0V ｦ ﾆｭｳﾘｮｸ",
													"                ",
													"                ",
													"ｾｯﾃｲ:           ", // ＩＩＦ設定終了画面
													"                ",
													"                ",
													"                "
												};
// ＩＩＦ設定画面選択内容
const char guc_Dital_Iif_Select_Disp[6][11]		= {	"ｼｭﾂﾘｮｸ     ", // 出力ポート設定画面
													"ﾆｭｳﾘｮｸ     ", // 入力ポート設定画面
													"ｱﾅﾛｸﾞﾆｭｳﾘｮｸ", // アナログ入力ポート設定画面
													"ｾｯﾃｲｶｸﾃｲ   ", // 設定確定画面
													"ｱﾅﾛｸﾞｺｳｾｲ  ", // アナログポートシフト量の校正画面
													"ﾓﾄﾞﾙ       "  // ＩＩＦ設定終了画面
												};
// ＩＩＦ設定画面出力ポート選択内容
const char guc_Dital_Iif_OT_Select[12][6]		= {	"NO USE", // 未使用
													"CURDET", // 電流検出
													"ARCOUT", // アーク切れ異常
													"STKOUT", // スティック異常
													"ERR   ", // エラー
													"ALM   ", // アラーム
													"WELD  ", // 溶接中
													"GAS-ON", // ガス動作確認
													"GP-OT1", // 汎用出力＃１
													"GP-OT2", // 汎用出力＃２
													"GP-OT3", // 汎用出力＃３
													"      "  // 
												};
// ＩＩＦ設定画面入力ポート選択内容
const char guc_Dital_Iif_IN_Select[18][6]		= {	"NO USE", // 未使用
													"TSW   ", // トーチスイッチ
													"GAS-CK", // ガス制御
													"STKSET", // スティック指令
													"EM-STP", // 非常停止
													"BIN1  ", // 再生Ｃｈバイナリ＃１
													"BIN2  ", // 再生Ｃｈバイナリ＃２
													"BIN3  ", // 再生Ｃｈバイナリ＃３
													"BIN4  ", // 再生Ｃｈバイナリ＃４
													"BIN5  ", // 再生Ｃｈバイナリ＃５
													"BIN6  ", // 再生Ｃｈバイナリ＃６
													"CNT   ", // 入力許可信号
													"STB   ", // ストロ－ブ信号
													"STOP1 ", // 一時停止＃１
													"STOP2 ", // 一時停止＃２
													"      ", //
													"      ", //
													"      "  // 
												};
// ＩＩＦ設定画面入力ポート選択内容
const char guc_Dital_Iif_AG_Select[12][6]		= {	"NO USE", // 未使用
													"PR-CUR", // 溶接電流
													"PL-CUR", // パルス電流
													"I-CUR ", // 初期電流
													"C-CUR ", // クレータ電流
													"PL-FQ ", // パルス周波数
													"PL-DT ", // パルス幅
													"CLNING", // クリーニング幅
													"AC-FQ ", // 交流周波数
													"MIX-FQ", // ＭＩＸ周波数
													"DC-DT ", // 直流比率
													"      "  // 
												};
// ＩＩＦ設定画面：その他の表示文字
const char guc_YES_NO_Disp[2][3]				= {	"YES",	"NO " };
const char guc_OK_NG_Disp[2][2]					= {	"OK",	"NG"  };
const char guc_A_B_Disp[2][1]					= {	"A",	"B"   };


// < IIF NEW >
//-----------------------------------------------------------------------------------


//-----------------------------------------------------------------------------------------------------------------------------------------------
// <NAVI Enhancements(Phase 1)> 2011.10.26 by @Tny
// <<******* ナビ検索結果から表示するデータ ********>>
const char gc_Navi_gas_char[25][9]			=  {"        ", //             0
												" 1      ", //             1
												" 2      ", //             2
												" 3      ", //             3
												" 4      ", //             4
												" 5      ", //             5
												" 6      ", //             6
												" 7      ", //             7
												" 8      ", //             8
												" 9      ", //             9
												"10      ", //            10
												"11      ", //            11
												"12      ", //            12
												"13      ", //            13
												"14      ", //            14
												"15      ", //            15
												"16      ", //            16
												"17      ", //            17
												"18      ", //            18
												"19      ", //            19
												"20      ", //            20
												"21      ", //            21
												"22      ", //            22
												"23      ", //            23
												"ﾓﾄﾞﾙ    "  //            24
												};

const char gc_Navi_filler_char[25][9]		=  {"        ", //             0
												"ﾅｼ      ", //             1
												"0.6     ", //             2
												"0.8     ", //             3
												"1.0     ", //             4
												"1.2     ", //             5
												"1.4     ", //             6
												"1.6     ", //             7
												"1.8     ", //             8
												"2.0     ", //             9
												"2.2     ", //            10
												"2.4     ", //            11
												"2.6     ", //            12
												"2.8     ", //            13
												"3.0     ", //            14
												"3.2     ", //            15
												"3.4     ", //            16
												"3.6     ", //            17
												"3.8     ", //            18
												"4.0     ", //            19
												"4.2     ", //            20
												"4.4     ", //            21
												"4.6     ", //            22
												"4.8     ", //            23
												"ﾓﾄﾞﾙ    "  //            24
												};

const char gc_Navi_electroad_char[25][9]	=  {"        ", //             0
												"0.6     ", //             1
												"0.8     ", //             2
												"1.0     ", //             3
												"1.2     ", //             4
												"1.4     ", //             5
												"1.6     ", //             6
												"1.8     ", //             7
												"2.0     ", //             8
												"2.2     ", //             9
												"2.4     ", //            10
												"2.6     ", //            11
												"2.8     ", //            12
												"3.0     ", //            13
												"3.2     ", //            14
												"3.4     ", //            15
												"3.6     ", //            16
												"3.8     ", //            17
												"4.0     ", //            18
												"4.2     ", //            19
												"4.4     ", //            20
												"4.6     ", //            21
												"4.8     ", //            22
												"5.0     ", //            23
												"ﾓﾄﾞﾙ    "  //            24
												};

const char gc_Navi_el_rd_angle_char[25][9]	=  {"        ", //             0
												" 5      ", //             1
												"10      ", //             2
												"15      ", //             3
												"20      ", //             4
												"25      ", //             5
												"30      ", //             6
												"35      ", //             7
												"40      ", //             8
												"45      ", //             9
												"50      ", //            10
												"55      ", //            11
												"60      ", //            12
												"65      ", //            13
												"70      ", //            14
												"75      ", //            15
												"80      ", //            16
												"85      ", //            17
												"90      ", //            18
												"        ", //            19
												"        ", //            20
												"        ", //            21
												"        ", //            22
												"        ", //            23
												"ﾓﾄﾞﾙ    "  //            24
												};
//-----------------------------------------------------------------------------------------------------------------------------------------------


// Phase11 by @Tny 2008/09/16
static char gc_Dital_unit[92][2]     = {"--",               //P00
                                        "--",               //P01
                                        "--",               //P02
                                        "--",               //P03
                                        "--",               //P04
                                        "Sc",               //P05
                                        "Sc",               //P06
                                        "--",               //P07
                                        "--",               //P08
                                        "--",               //P09
                                        "--",               //P10
                                        "--",               //P11
                                        "--",               //P12
                                        "--",               //P13
                                        "--",               //P14
                                        "--",               //P15
                                        "Sc",               //P16
                                        "SW",               //P17
                                        "A ",               //P18
                                        "V ",               //P19
                                        "HZ",               //P20
                                        "% ",               //P21
                                        "mS",               //P22
                                        "--",               //P23
                                        "--",               //P24
                                        "--",               //P25
                                        "--",               //P26
                                        "--",               //P27
                                        //"mS",               //P28
                                        "Sc",               //P28 2008.11.27
                                        "--",               //P29
                                        "--",               //P30
                                        "--",               //P31
                                        "SW",               //P32
                                        "--",               //P33
                                        "--",               //P34
                                        "SW",               //P35
                                        "SW",               //P36
                                        "Sc",               //P37
                                        //"Sc",               //P38
                                        "--",               //P38 2008.11.27
                                        "SW",               //P39 2008.10.21追加
                                        //"--",               //P40
                                        "SW",               //P40 2008.11.27
                                        "--",               //P41
                                        "--",               //P42
                                        "--",               //P43
                                        "--",               //P44
                                        "--",               //P45
                                        "--",               //P46
                                        "--",               //P47
                                        "--",               //P48
                                        "--",               //P49
                                        "--",               //P50
                                        "--",               //P51
                                        "SW",               //P52
                                        //"--",               //P53
                                        "SW",               //P53 2008.11.27
                                        "SW",               //P54
                                        "--",               //P55
                                        "--",               //P56
                                        "--",               //P57
                                        "SW",               //P58
                                        "--",               //P59
                                        "--",               //P60
                                        "--",               //P61
                                        "--",               //P62
                                        "--",               //P63
                                        "--",               //P64
                                        "--",               //P65
                                        "--",               //P66
                                        "--",               //P67
                                        "--",               //P68
                                        "--",               //P69
                                        "SW",               //P70
                                        "--",               //P71
                                        "--",               //P72
                                        //"SW",               //P73
                                        "--",               //P73 2008.11.27
                                        "SW",               //P74
                                        "--",               //P75
                                        "--",               //P76
                                        "--",               //P77
                                        //"SW",               //P78
                                        "--",               //P78 2008.11.27
                                        //"A ",               //P79
                                        //"V ",               //P80
                                        //"mS",               //P81
                                        "--",               //P79 2008.11.27
                                        "--",               //P80 2008.11.27
                                        "--",               //P81 2008.11.27
                                        "--",               //P82
                                        "--",               //P83
                                        "--",               //P84
                                        "--",               //P85
                                        "--",               //P86
                                        "--",               //P87
                                        "--",               //P88
                                        "--",               //P89
                                        "--",               //P90
                                        "  "                //P91 ロボット接続時の表示 2008.10.03
                                       };

static unsigned short gus_Point_code[92]      = {0x0000,             //P00
                                                 0x0000,             //P01
                                                 0x0000,             //P02
                                                 0x0000,             //P03
                                                 0x0000,             //P04
                                                 0x0000,             //P05
                                                 0x0000,             //P06
                                                 0x0000,             //P07
                                                 0x0000,             //P08
                                                 0x0000,             //P09
                                                 0x0000,             //P10
                                                 0x0000,             //P11
                                                 0x0000,             //P12
                                                 0x0000,             //P13
                                                 0x0000,             //P14
                                                 0x0000,             //P15
                                                 0x0000,             //P16
                                                 0x0000,             //P17
                                                 0x0000,             //P18
                                                 0x0000,             //P19
                                                 0x0000,             //P20
                                                 0x0000,             //P21
                                                 0x0000,             //P22
                                                 0x0000,             //P23
                                                 0x0000,             //P24
                                                 0x0000,             //P25
                                                 0x0000,             //P26
                                                 0x0000,             //P27
                                                 0x0000,             //P28
                                                 0x0000,             //P29
                                                 0x0000,             //P30
                                                 0x0000,             //P31
                                                 0x0000,             //P32
                                                 0x0000,             //P33
                                                 0x0000,             //P34
                                                 0x0000,             //P35
                                                 0x0000,             //P36
                                                 0x0000,             //P37
                                                 0x0000,             //P38
                                                 0x0000,             //P39
                                                 0x0000,             //P40
                                                 0x0000,             //P41
                                                 0x0000,             //P42
                                                 0x0000,             //P43
                                                 0x0000,             //P44
                                                 0x0000,             //P45
                                                 0x0000,             //P46
                                                 0x0000,             //P47
                                                 0x0000,             //P48
                                                 0x0000,             //P49
                                                 0x0000,             //P50
                                                 0x0000,             //P51
                                                 0x0000,             //P52
                                                 0x0000,             //P53
                                                 0x0000,             //P54
                                                 0x0000,             //P55
                                                 0x0000,             //P56
                                                 0x0000,             //P57
                                                 0x0000,             //P58
                                                 0x0000,             //P59
                                                 0x0000,             //P60
                                                 0x0000,             //P61
                                                 0x0000,             //P62
                                                 0x0000,             //P63
                                                 0x0000,             //P64
                                                 0x0000,             //P65
                                                 0x0000,             //P66
                                                 0x0000,             //P67
                                                 0x0000,             //P68
                                                 0x0000,             //P69
                                                 0x0000,             //P70
                                                 0x0000,             //P71
                                                 0x0000,             //P72
                                                 0x0000,             //P73
                                                 0x0000,             //P74
                                                 0x0000,             //P75
                                                 0x0000,             //P76
                                                 0x0000,             //P77
                                                 0x0000,             //P78
                                                 0x0000,             //P79
                                                 0x0000,             //P80
                                                 0x0000,             //P81
                                                 0x0000,             //P82
                                                 0x0000,             //P83
                                                 0x0000,             //P84
                                                 0x0000,             //P85
                                                 0x0000,             //P86
                                                 0x0000,             //P87
                                                 0x0000,             //P88
                                                 0x0000,             //P89
                                                 0x0000,             //P90
                                                 0x0000              //ロボット接続時の表示 2008.10.03
                                                 };

//桁    16 15 14 13__12 11 10  9__8  7  6  5__4  3  2  1
//１書き込みで点ＯＮ


//下記ファンクション名は最終的にＦＲＡＭ領域に書かれる。
//ＯｕｔＰｕｔ　ファンクション名
static char gc_Output_function_upper[11][3] = {"NO ",       //未使用
                                               "CUR",       //Function No.1 upper data 電流検出
                                               "STK",       //Function No.2 upper data スティック検出結果
                                               "IDL",       //Function No.3 upper data 待機中
                                               "---",       //Function No.4 upper data
                                               "---",       //Function No.5 upper data
                                               "---",       //Function No.6 upper data
                                               "---",       //Function No.7 upper data
                                               "---",       //Function No.8 upper data
                                               "---"        //Function No.9 upper data
                                              };

static char gc_Output_function_lower[11][3] = {"USE",       //未使用
                                               "DET",       //Function No.1 lower data 電流検出
                                               "OUT",       //Function No.2 lower data スティック検出結果
                                               "E  ",       //Function No.3 lower data 待機中
                                               "---",       //Function No.4 lower data
                                               "---",       //Function No.5 lower data
                                               "---",       //Function No.6 lower data
                                               "---",       //Function No.7 lower data
                                               "---",       //Function No.8 lower data
                                               "---"        //Function No.9 lower data
                                              };



//ＩｎＰｕｔ　ファンクション名
static char gc_Input_function_upper[20][3] = { "NO ",       //未使用
                                               "EM ",       //Function No.1 upper data 非常停止
                                               "STO",       //Function No.2 upper data 一時停止１
                                               "STO",       //Function No.3 upper data 一時停止２
                                               "GAS",       //Function No.4 upper data ガスチェック
                                               "WIR",       //Function No.5 upper data インチング
                                               "STK",       //Function No.6 upper data スティックチェック命令
                                               "TS ",       //Function No.7 upper data トーチスイッチ
                                               "---",       //Function No.8 upper data
                                               "---",       //Function No.9 upper data
                                               "EXT",       //Function No.10 upper data 外部選択ユニットビット１
                                               "EXT",       //Function No.11 upper data 外部選択ユニットビット２
                                               "EXT",       //Function No.12 upper data 外部選択ユニットビット３
                                               "EXT",       //Function No.13 upper data 外部選択ユニットビット４
                                               "EXT",       //Function No.14 upper data 外部選択ユニットビット５
                                               "EXT",       //Function No.15 upper data 外部選択ユニットビット６
                                               "CNT",       //Function No.16 upper data 外部選択ユニットコントロール信号
                                               "STB",       //Function No.17 upper data 外部選択ユニットストローブ信号
                                               "---",       //Function No.18 upper data
                                               "---"        //Function No.19 upper data
                                              };

static char gc_Input_function_lower[20][3] = { "USE",       //未使用
                                               "STP",       //Function No.1 lower data 非常停止
                                               "P1 ",       //Function No.2 lower data 一時停止１
                                               "P2 ",       //Function No.3 lower data 一時停止２
                                               " CK",       //Function No.4 lower data ガスチェック
                                               " CK",       //Function No.5 lower data インチング
                                               "SET",       //Function No.6 lower data スティックチェック命令
                                               "   ",       //Function No.7 lower data トーチスイッチ
                                               "---",       //Function No.8 lower data
                                               "---",       //Function No.9 lower data
                                               "1  ",       //Function No.10 lower data 外部選択ユニットビット１
                                               "2  ",       //Function No.11 lower data 外部選択ユニットビット２
                                               "3  ",       //Function No.12 lower data 外部選択ユニットビット３
                                               "4  ",       //Function No.13 lower data 外部選択ユニットビット４
                                               "5  ",       //Function No.14 lower data 外部選択ユニットビット５
                                               "6  ",       //Function No.15 lower data 外部選択ユニットビット６
                                               "   ",       //Function No.16 lower data 外部選択ユニットコントロール信号
                                               "   ",       //Function No.17 lower data 外部選択ユニットストローブ信号
                                               "---",       //Function No.18 lower data
                                               "---"        //Function No.19 lower data
                                              };



//Ａｎａｌｏｇ　ファンクション名
static char gc_Analog_function_upper[10][3] = {"NO ",       //未使用
                                               "CUR",       //Function No.1 upper data 電流指令値１５Ｖ
                                               "CUR",       //Function No.2 upper data 電流指令値１２Ｖ
                                               "CUR",       //Function No.3 upper data 電流指令値１０Ｖ
                                               "VLT",       //Function No.4 upper data 電圧指令値１５Ｖ
                                               "VLT",       //Function No.5 upper data 電圧指令値１２Ｖ
                                               "VLT",       //Function No.6 upper data 電圧指令値１０Ｖ
                                               "---",       //Function No.7 upper data
                                               "---",       //Function No.8 upper data
                                               "---"        //Function No.9 upper data
                                              };

static char gc_Analog_function_lower[10][3] = {"USE",       //未使用
                                               "15V",       //Function No.1 lower data 電流指令値１５Ｖ
                                               "12V",       //Function No.2 lower data 電流指令値１２Ｖ
                                               "10V",       //Function No.3 lower data 電流指令値１０Ｖ
                                               "15V",       //Function No.4 lower data 電圧指令値１５Ｖ
                                               "12V",       //Function No.5 lower data 電圧指令値１２Ｖ
                                               "10V",       //Function No.6 lower data 電圧指令値１０Ｖ
                                               "---",       //Function No.7 lower data
                                               "---",       //Function No.8 lower data
                                               "---"        //Function No.9 lower data
                                              };



//カレンダー関連
static char gc_Calender_name[5][3]         = { "YY-", //年
                                               "MM-", //月
                                               "DD-", //日
                                               "HH-", //時
                                               "mm-"  //分
                                              };



//*** 調整関連 ***
//ＤＣ
const char gc_Dc_adjust_p_data[2]         = {  99,  //電圧
                                                13   //ISL0
                                              };
static char gc_Dc_adjust_name[2][3]        = {"VLT",
                                              "ISL"
                                             };
//ＤＰ
const char gc_Dp_adjust_p_data[5]         = {  99,  //電圧
                                                 7,  //IP
                                                 8,  //IB
                                                14,  //パルス周波数
                                                15   //パルス幅
                                              };
static char gc_Dp_adjust_name[5][3]        = {"VLT",
                                              "IP ",
                                              "IB ",
                                              "FRQ",
                                              "WDT" 
                                             };
//ＡＣ 2008.09.12
const char gc_Ac_adjust_p_data[2]         = {  99,  //電圧
                                               23  //ＥＮ比率
                                              };
//ＡＣ 初期 2008.10.01
const char gc_Ac_init_adjust_p_data[2]    = {  99,  //電圧
                                               24  //ＥＮ比率
                                              };
//ＡＣ クレータ 2008.10.01
const char gc_Ac_crater_adjust_p_data[2]  = {  99,  //電圧
                                               25  //ＥＮ比率
                                              };
static char gc_Ac_adjust_name[2][3]       = {"VLT",
                                              "EN "
                                             };
//ＡＣＰ 2008.09.12
const char gc_Ap_adjust_p_data[6]         = {  99,  //電圧
                                               23,  //ＥＮ比率
                                                7,  //IP
                                                8,  //IB
                                               14,  //パルス周波数
                                               15   //パルス幅
                                              };
//ＡＣＰ 初期 2008.10.01
const char gc_Ap_init_adjust_p_data[6]    = {  99,  //電圧
                                               24,  //ＥＮ比率
                                                7,  //IP
                                                8,  //IB
                                               14,  //パルス周波数
                                               15   //パルス幅
                                              };
//ＡＣＰ クレータ 2008.10.01
const char gc_Ap_crater_adjust_p_data[6]  = {  99,  //電圧
                                               25,  //ＥＮ比率
                                                7,  //IP
                                                8,  //IB
                                               14,  //パルス周波数
                                               15   //パルス幅
                                              };

static char gc_Ap_adjust_name[6][3]        = {"VLT",
                                              "EN ",
                                              "IP ",
                                              "IB ",
                                              "FRQ",
                                              "WDT" 
                                             };

const char gc_Navi_material_char[25][9]   =  {"        ", //             0
                                              "ｱﾙﾐ     ", //アルミ       1
                                              "ｽﾃﾝﾚｽ   ", //ステンレス   2
                                              "ｵｳﾄﾞｳ   ", //黄銅         3
                                              "ﾁﾀﾝ     ", //チタン       4
                                              "ﾅﾝｺｳ    ", //軟鋼         5
                                              "ﾄﾞｳ     ", //銅           6
                                              "        ", //             7
                                              "        ", //             8
                                              "        ", //             9
                                              "        ", //            10
                                              "        ", //            11
                                              "        ", //            12
                                              "        ", //            13
                                              "        ", //            14
                                              "        ", //            15
                                              "        ", //            16
                                              "        ", //            17
                                              "        ", //            18
                                              "        ", //            19
                                              "        ", //            20
                                              "        ", //            21
                                              "        ", //            22
                                              "        ", //            23
                                              "ﾓﾄﾞﾙ    "  //            24
                                             };
const char gc_Navi_thickness_char[25][9]  =  {"        ", //             0
                                              " 0.3mm  ", //             1
                                              " 0.5mm  ", //             2
                                              " 0.6mm  ", //             3
                                              " 0.8mm  ", //             4
                                              " 1.0mm  ", //             5
                                              " 1.2mm  ", //             6
                                              " 1.5mm  ", //             7
                                              " 1.6mm  ", //             8
                                              " 2.0mm  ", //             9
                                              " 2.5mm  ", //            10
                                              " 3.0mm  ", //            11
                                              " 4.0mm  ", //            12
                                              " 5.0mm  ", //            13
                                              " 6.0mm  ", //            14
                                              " 8.0mmP1", //            15 //2010.01.07
                                              " 8.0mmP2", //            16 //2010.01.07
                                              "10.0mmP1", //            17 //2010.01.07
                                              "10.0mmP2", //            18 //2010.01.07
                                              "12.0mmP1", //            19 //2010.01.07
                                              "12.0mmP2", //            20 //2010.01.07
                                              "        ", //            21
                                              "        ", //            22
                                              "        ", //            23
                                              "ﾓﾄﾞﾙ    "  //            24
                                             };

const char gc_Navi_joint_char[25][9]      =  {"        ", //             0
                                              "ﾂｷｱﾜｾ   ", //             1
                                              "ｽﾐﾆｸ    ", //             2
                                              "        ", //             3
                                              "        ", //             4
                                              "        ", //             5
                                              "        ", //             6
                                              "        ", //             7
                                              "        ", //             8
                                              "        ", //             9
                                              "        ", //            10
                                              "        ", //            11
                                              "        ", //            12
                                              "        ", //            13
                                              "        ", //            14
                                              "        ", //            15
                                              "        ", //            16
                                              "        ", //            17
                                              "        ", //            18
                                              "        ", //            19
                                              "        ", //            20
                                              "        ", //            21
                                              "        ", //            22
                                              "        ", //            23
                                              "ﾓﾄﾞﾙ    "  //            24
                                             };

const char gc_Navi_direction_char[25][9]  =  {"        ", //             0
                                              "ｼﾀﾑｷ    ", //             1
                                              "ﾀﾁﾑｶｲ   ", //             2
                                              "        ", //             3
                                              "        ", //             4
                                              "        ", //             5
                                              "        ", //             6
                                              "        ", //             7
                                              "        ", //             8
                                              "        ", //             9
                                              "        ", //            10
                                              "        ", //            11
                                              "        ", //            12
                                              "        ", //            13
                                              "        ", //            14
                                              "        ", //            15
                                              "        ", //            16
                                              "        ", //            17
                                              "        ", //            18
                                              "        ", //            19
                                              "        ", //            20
                                              "        ", //            21
                                              "        ", //            22
                                              "        ", //            23
                                              "ﾓﾄﾞﾙ    "  //            24
                                             };

const char gc_Navi_pulse_char[25][9]      =  {"        ", //             0
                                              "ﾅｼ      ", //             1
                                              "ｱﾘ      ", //             2
                                              "        ", //             3
                                              "        ", //             4
                                              "        ", //             5
                                              "        ", //             6
                                              "        ", //             7
                                              "        ", //             8
                                              "        ", //             9
                                              "        ", //            10
                                              "        ", //            11
                                              "        ", //            12
                                              "        ", //            13
                                              "        ", //            14
                                              "        ", //            15
                                              "        ", //            16
                                              "        ", //            17
                                              "        ", //            18
                                              "        ", //            19
                                              "        ", //            20
                                              "        ", //            21
                                              "        ", //            22
                                              "        ", //            23
                                              "ﾓﾄﾞﾙ    "  //            24
                                             };



//-----------------------------------------------------------------------------
// BP4 Phase5 by @Tny 2009.01.21	BP4 Phase13 by @Tny 2009.02.23
/***
**  ID     = InitialStringInput
**  name   = 文字列入力前処理
**  func   = 文字列入力処理の前処理を行う（Ｃコンパイラの予約文字を文字として対応するため）
**  called = void InitialStringInput(ubool Sw, ubool Pass, const char *InitialString);
**  io     = Sw				: ubool             : 動作フラグ（true:選択文字の最終設定処理込み）
**           Pass   		: ubool             : パスワード入力用選択文字列入力（true:パスワード入力用選択文字の最終設定処理込み）
**           InitialString	: const char *     : 既に設定されている文字列（初期文字列）
**  return = none
**  using  =                                   :     /          : 
**  common =                                   :        :   :
**  note   = 
**  date   = 2009/01/19 by 谷川真也
***/
void InitialStringInput(ubool Sw, ubool Pass, const char *InitialString)
{
	if(Sw){
		short	i;
		
		if(Pass){
			short	Length	= (short)strlen(PassSelectCharacterSrc);	// 文字数を求める

			for(i=0;i<Length;i++){
				if(i == 10)	SelectCharacter[i] = DeleteCode;
				else 		SelectCharacter[i] = PassSelectCharacterSrc[i];
			}
		}
		else{
			short	Length	= (short)strlen(SelectCharacterSrc);	// 文字数を求める

			for(i=0;i<Length;i++){
				if(i == DoubleQuotationCommaPosition)		SelectCharacter[i] = DoubleQuotationCommaCode;
				else if(i == SingleQuotationCommaPosition)	SelectCharacter[i] = SingleQuotationCommaCode;
				else if(i == DeletePosition)				SelectCharacter[i] = DeleteCode;
				else 										SelectCharacter[i] = SelectCharacterSrc[i];
			}
		}
		SelectCharacter[i]		= 0x00;		// NULLコードセット
		gt_SelectCharacter[0]	= 0x00;		// 入力文字列データ格納エリア（最大２０文字）の初期化
		guc_StringInput			= 0;		// 文字列入力処理実行中フラグ
	}
	gss_SelectCharIndex		= 0;										// 選択文字インデックス
	strcpy((char *)gt_SelectCharacter, InitialString);					// 既に設定されている文字列（初期文字列）の転送
	gus_InputCharIndex		= (unsigned short)strlen(InitialString);	// 入力文字位置インデックス
	gt_SelectCharacter[gus_InputCharIndex] = 0x00;						// NULLコードセット
}
//-----------------------------------------------------------------------------
/***
**  ID     = StringInput_Disp
**  name   = 文字列入力処理
**  func   = 文字列の入力を行う
**  called = void StringInput_Disp(ubool Sw, unsigned char *Title, unsigned char *StringStorageArea, unsigned short Length);
**  io     = Sw					: ubool             : パスワード動作フラグ（true:パスワード入力モード（入力文字列は全て「＊」になる／false:通常文字列入力）
**           Title				: unsigned char *  : タイトルとして表示する文字列（最大１２文字）の先頭アドレス
**           StringStorageArea	: unsigned char *  : 入力された文字列を格納するエリアの先頭アドレス
**           Length				: unsigned short   : 入力文字数
**  return = none
**  using  =                                   :     /          : 
**  common =                                   :        :   :
**  note   = 
**  date   = 2009/01/19 by 谷川真也
***/
void StringInput_Disp(ubool Sw, const char *Title, unsigned char *StringStorageArea, unsigned short Length)
{
	uchar   i;
	if(guc_StringInput == 1){	// 文字列入力処理実行中？
		unsigned short	Index = (unsigned short)strlen(SelectCharacterSrc);
		for(i=0;i<16;i++){	// 表示文字列の初期化
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[i]  = ' ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[i]  = ' ';
		}

		// タイトルの表示
 		strcpy((char *)ComuniPackRemo.Data.From.uc_Com_lcd_data1, Title);
		ComuniPackRemo.Data.From.uc_Com_lcd_data1[strlen(Title)] = ' ';

		// 選択文字表示（現在選択文字には点滅制御）
		if(gss_SelectCharIndex == 0){
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[13] = SelectCharacter[Index - 1];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[14] = SelectCharacter[0];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[15] = SelectCharacter[1];
		}
		else if(gss_SelectCharIndex >= (Index - 1)){
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[13] = SelectCharacter[Index - 2];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[14] = SelectCharacter[Index - 1];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[15] = SelectCharacter[0];
		}
		else{
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[13] = SelectCharacter[gss_SelectCharIndex - 1];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[14] = SelectCharacter[gss_SelectCharIndex    ];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[15] = SelectCharacter[gss_SelectCharIndex + 1];
		}

		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag	= 0x0002;	// 0000 0000 0000 0010b
		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no				= 1;		//点滅対象行番号
		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time		= 5;		//点滅時点灯時間
		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time		= 5;		//点滅時消灯時間
		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times			= 100;		//点滅繰り返し回数
		//REMO_Send_CMD(0x36);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
		REMO_Send_CMD(0x36);
#else
		gb_RemCom_0x36	= true;
#endif
//-----------------------------------------------------------

		// 入力文字列の表示（現在入力位置にはカーソル(0xFF)表示）
 		if(Sw){	// パスワード入力？
			for(i=0;i<(unsigned char)strlen((const char *)gt_SelectCharacter);i++){
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[i] = '*';
			}
		}
 		else{
			strcpy((char *)ComuniPackRemo.Data.From.uc_Com_lcd_data2, (const char *)gt_SelectCharacter);	// 入力文字の表示
		}
		ComuniPackRemo.Data.From.uc_Com_lcd_data2[gus_InputCharIndex]	= SelectCode;	// 入力文字位置にカーソル文字を表示

	}
	else if(guc_StringInput == 2){	// 文字列入力処理終了中？
		guc_StringInput	= 1;									// 文字列入力処理フラグのクリア
		ComuniPackRemo.Data.From.uc_Com_lcd_data1[13] = ' ';
		ComuniPackRemo.Data.From.uc_Com_lcd_data1[14] = ' ';
		ComuniPackRemo.Data.From.uc_Com_lcd_data1[15] = ' ';
 		if(Sw){	// パスワード入力？
			for(i=0;i<(unsigned char)strlen((const char *)gt_SelectCharacter);i++){
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[i] = '*';
			}
		}
 		else{
	 		strcpy((char *)ComuniPackRemo.Data.From.uc_Com_lcd_data2, (const char *)gt_SelectCharacter);	// 入力文字の表示
		}
		if(gus_InputCharIndex < 16){
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[gus_InputCharIndex]	= ' ';	// 入力文字位置にカーソル文字を表示
		}
		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag	= 0x0000;	// 0000 0000 0000 0000b
		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no				= 1;		//点滅対象行番号
		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time		= 5;		//点滅時点灯時間
		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time		= 5;		//点滅時消灯時間
		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times			= 100;		//点滅繰り返し回数
		//REMO_Send_CMD(0x36);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
		REMO_Send_CMD(0x36);
#else
		gb_RemCom_0x36	= true;
#endif
//-----------------------------------------------------------
	}
}
//-----------------------------------------------------------------------------




void char_set_class(unsigned char block, char *p , char n1, char n2, char n3)
{
     if (block == 1)
     {
         if (n1 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[0]  = *p;
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[0]  = *p | (0x80);
         }
         if (n2 == false)
         {
            ComuniPackRemo.Data.From.uc_Com_16led_data[1]  = *(p+1);
         } else {
            ComuniPackRemo.Data.From.uc_Com_16led_data[1]  = *(p+1) | (0x80);
         }
         if (n3 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[2]  = *(p+2);
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[2]  = *(p+2) | (0x80);
         }
     }
     if (block == 2)
     {
         if (n1 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[3]  = *p;
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[3]  = *p | (0x80);
         }
         if (n2 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[4]  = *(p+1);
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[4]  = *(p+1) | (0x80);
         }
     }
     if (block == 3)
     {
         if (n1 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[5]  = *p;
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[5]  = *p | (0x80);
         }
         if (n2 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[6]  = *(p+1);
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[6]  = *(p+1) | (0x80);
         }
         if (n3 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[7]  = *(p+2);
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[7]  = *(p+2) | (0x80);
         }
     }
     if (block == 4)
     {
         if (n1 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[8]  = *p;
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[8]  = *p | (0x80);
         }
         if (n2 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[9]  = *(p+1);
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[9]  = *(p+1) | (0x80);
         }
     }
     if (block == 5)
     {
         if (n1 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[10]  = *p;
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[10]  = *p | (0x80);
         }
         if (n2 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[11]  = *(p+1);
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[11]  = *(p+1) | (0x80);
         }
         if (n3 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[12]  = *(p+2);
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[12]  = *(p+2) | (0x80);
         }
     }
     if (block == 6)
     {
         if (n1 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[13]  = *p;
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[13]  = *p | (0x80);
         }
         if (n2 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[14]  = *(p+1);
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[14]  = *(p+1) | (0x80);
         }
         if (n3 == false)
         {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[15]  = *(p+2);
         } else {
         	ComuniPackRemo.Data.From.uc_Com_16led_data[15]  = *(p+2) | (0x80);
         }
     }
     if (block == 7)
     {
//----- Phase17 by @Tny 2008/09/24 -----
#if true
        if(gtt_End_welding_display.us_Display_time > 0){
            ComuniPackRemo.Data.From.uc_Com_16led_data[16]  = 'V';
            ComuniPackRemo.Data.From.uc_Com_16led_data[17]  = ' ';
        }
        else{
            if (n1 == false)
            {
            	ComuniPackRemo.Data.From.uc_Com_16led_data[16]  = *p;
            } else {
            	ComuniPackRemo.Data.From.uc_Com_16led_data[16]  = *p | (0x80);
            }
            if (n2 == false)
            {
            	ComuniPackRemo.Data.From.uc_Com_16led_data[17]  = *(p+1);
            } else {
            	ComuniPackRemo.Data.From.uc_Com_16led_data[17]  = *(p+1) | (0x80);
            }
        }
#endif
//---------------------------------------------------------------------
     }
     return;
}

void all_char_set_class(char *p , unsigned short n)
{
     unsigned char puc_Index;
     unsigned short pus_Dimension;
     pus_Dimension = 0x0001;
        for (puc_Index = 0 ; puc_Index < 16 ; puc_Index++)
        {
            if ((n & pus_Dimension) == pus_Dimension)
         	{
         		ComuniPackRemo.Data.From.uc_Com_16led_data[puc_Index]  = *(p + puc_Index) | (0x80);
         	} else {
         		ComuniPackRemo.Data.From.uc_Com_16led_data[puc_Index]  = *(p + puc_Index);
         	}
            if (pus_Dimension == 0x8000) break;
            pus_Dimension = pus_Dimension << 1;
        }
     return;
}

void all_char_lcd1_set_class(char *p , unsigned short n) //2009.01.13
{
     unsigned char puc_Index;
     unsigned short pus_Dimension;
     pus_Dimension = 0x0001;
        for (puc_Index = 0 ; puc_Index < 16 ; puc_Index++)
        {
            if ((n & pus_Dimension) == pus_Dimension)
         	{
         		ComuniPackRemo.Data.From.uc_Com_lcd_data1[puc_Index]  = *(p + puc_Index) | (0x80);
         	} else {
         		ComuniPackRemo.Data.From.uc_Com_lcd_data1[puc_Index]  = *(p + puc_Index);
         	}
            if (pus_Dimension == 0x8000) break;
            pus_Dimension = pus_Dimension << 1;
        }
     return;
}

void all_char_lcd2_set_class(char *p , unsigned short n) //2009.01.13
{
     unsigned char puc_Index;
     unsigned short pus_Dimension;
     pus_Dimension = 0x0001;
        for (puc_Index = 0 ; puc_Index < 16 ; puc_Index++)
        {
            if ((n & pus_Dimension) == pus_Dimension)
         	{
         		ComuniPackRemo.Data.From.uc_Com_lcd_data2[puc_Index]  = *(p + puc_Index) | (0x80);
         	} else {
         		ComuniPackRemo.Data.From.uc_Com_lcd_data2[puc_Index]  = *(p + puc_Index);
         	}
            if (pus_Dimension == 0x8000) break;
            pus_Dimension = pus_Dimension << 1;
        }
     return;
}


void nume5_set_class(short n) //５桁の数値を表示
{
     unsigned char puc_Nume_work10000;
     unsigned char puc_Nume_work1000;
     unsigned char puc_Nume_work100;
     unsigned char puc_Nume_work10;
     unsigned char puc_Nume_work1;
     unsigned char puc_Nume_work;
     unsigned char puc_Nume_work10000_disp;
     unsigned char puc_Nume_work1000_disp;
     unsigned char puc_Nume_work100_disp;
     unsigned char puc_Nume_work10_disp;
     unsigned char puc_Nume_work1_disp;
     signed short  pss_Data;
     
     if (n < 0)
     {
         pss_Data = n * -1;
     } else {
         pss_Data = n;
     } 
     

     puc_Nume_work10000 = (unsigned char)( pss_Data / 10000);
     if (puc_Nume_work10000 == 0)
     {
         puc_Nume_work10000_disp = 0x20;
     } else {
         puc_Nume_work10000_disp = puc_Nume_work10000 + 0x30;
     }

     puc_Nume_work1000 = (unsigned char)(( pss_Data - ((unsigned short)puc_Nume_work10000 * 10000))/ 1000);
     if (puc_Nume_work1000 == 0 && puc_Nume_work10000 == 0)
     {
         puc_Nume_work1000_disp = 0x20;
     } else {
         puc_Nume_work1000_disp = puc_Nume_work1000 + 0x30;
     }

     puc_Nume_work100 = (unsigned char)(( pss_Data - ((unsigned short)puc_Nume_work10000 * 10000) - ((unsigned short)puc_Nume_work1000 * 1000))/ 100);
     if (puc_Nume_work100 == 0 && puc_Nume_work1000 == 0 && puc_Nume_work10000 == 0)
     {
         puc_Nume_work100_disp = 0x20;
     } else {
         puc_Nume_work100_disp = puc_Nume_work100 + 0x30;
     }

     puc_Nume_work10 = (unsigned char)(( pss_Data - ((unsigned short)puc_Nume_work10000 * 10000) - ((unsigned short)puc_Nume_work1000 * 1000) -  ((unsigned short)puc_Nume_work100 * 100))/ 10);
     if (puc_Nume_work10 == 0 && puc_Nume_work100 == 0 && puc_Nume_work1000 == 0 && puc_Nume_work10000 == 0)
     {
         puc_Nume_work10_disp = 0x20;
     } else {
         puc_Nume_work10_disp = puc_Nume_work10 + 0x30;
     }

     puc_Nume_work1 = (unsigned char)(( pss_Data - ((unsigned short)puc_Nume_work10000 * 10000) - ((unsigned short)puc_Nume_work1000 * 1000) -  ((unsigned short)puc_Nume_work100 * 100) - ((unsigned short)puc_Nume_work10 * 10)));

     ComuniPackRemo.Data.From.uc_Com_16led_data[10]  = 0x20;
     ComuniPackRemo.Data.From.uc_Com_16led_data[11]  = puc_Nume_work10000_disp;
     ComuniPackRemo.Data.From.uc_Com_16led_data[12]  = puc_Nume_work1000_disp;
     ComuniPackRemo.Data.From.uc_Com_16led_data[13]  = puc_Nume_work100_disp;
     ComuniPackRemo.Data.From.uc_Com_16led_data[14]  = puc_Nume_work10_disp;
     ComuniPackRemo.Data.From.uc_Com_16led_data[15]  = puc_Nume_work1;

     return;
}

void nume3_set_class(unsigned block,short n) //３桁の数値を表示 block1,3,5,6専用
{
     unsigned char puc_Nume_work100;
     unsigned char puc_Nume_work10;
     unsigned char puc_Nume_work1;
     signed short  pss_Data;
     
     pss_Data = n;
     
     puc_Nume_work100 = (unsigned char)( pss_Data / 100);
     puc_Nume_work10 = ((unsigned char)( pss_Data - (puc_Nume_work100 * 100))/ 10);
     puc_Nume_work1 = ((unsigned char)( pss_Data -  (puc_Nume_work100 * 100) - (puc_Nume_work10 * 10)));

     if (block == 1)
     {
         ComuniPackRemo.Data.From.uc_Com_16led_data[0]  = puc_Nume_work100;
         ComuniPackRemo.Data.From.uc_Com_16led_data[1]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[2]  = puc_Nume_work1;
     }
     if (block == 3)
     {
         ComuniPackRemo.Data.From.uc_Com_16led_data[5]  = puc_Nume_work100;
         ComuniPackRemo.Data.From.uc_Com_16led_data[6]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[7]  = puc_Nume_work1;
     }
     if (block == 5)
     {
         ComuniPackRemo.Data.From.uc_Com_16led_data[10]  = puc_Nume_work100;
         ComuniPackRemo.Data.From.uc_Com_16led_data[11]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[12]  = puc_Nume_work1;
     }
     if (block == 6)
     {
         ComuniPackRemo.Data.From.uc_Com_16led_data[13]  = puc_Nume_work100;
         ComuniPackRemo.Data.From.uc_Com_16led_data[14]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[15]  = puc_Nume_work1;
     }

     return;
}


void nume2_set_class(unsigned block,short n) //２桁の数値を表示 block2,4専用
{
     unsigned char puc_Nume_work10;
     unsigned char puc_Nume_work1;
     signed short  pss_Data;
     
     pss_Data = n;
     
     puc_Nume_work10 = (unsigned char)( pss_Data / 10);
     puc_Nume_work1 = ((unsigned char)( pss_Data - (puc_Nume_work10 * 10)));

     if (block == 2)
     {
         ComuniPackRemo.Data.From.uc_Com_16led_data[3]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[4]  = puc_Nume_work1;
     }
     if (block == 4)
     {
         ComuniPackRemo.Data.From.uc_Com_16led_data[8]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[9]  = puc_Nume_work1;
     }
     return;
}
//------ Phase8 by @Tny 2008/09/11 ------
#if true
void nume3_set_class_b(unsigned block,short n) //３桁の数値を表示 block1,3,5,6専用
{
     unsigned char puc_Nume_work100;
     unsigned char puc_Nume_work10;
     unsigned char puc_Nume_work1;
     signed short  pss_Data;
     
     pss_Data = n;
     
     puc_Nume_work100 = (unsigned char)( pss_Data / 100);
     puc_Nume_work10 = ((unsigned char)( pss_Data - (puc_Nume_work100 * 100))/ 10);
     puc_Nume_work1 = ((unsigned char)( pss_Data -  (puc_Nume_work100 * 100) - (puc_Nume_work10 * 10)));

     if (block == 1)
     {
         if(puc_Nume_work100 > 0)   ComuniPackRemo.Data.From.uc_Com_16led_data[0]  = puc_Nume_work100;
         ComuniPackRemo.Data.From.uc_Com_16led_data[1]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[2]  = puc_Nume_work1;
     }
     if (block == 3)
     {
         if(puc_Nume_work100 > 0)   ComuniPackRemo.Data.From.uc_Com_16led_data[5]  = puc_Nume_work100;
         ComuniPackRemo.Data.From.uc_Com_16led_data[6]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[7]  = puc_Nume_work1;
     }
     if (block == 5)
     {
         if(puc_Nume_work100 > 0)   ComuniPackRemo.Data.From.uc_Com_16led_data[10]  = puc_Nume_work100;
         ComuniPackRemo.Data.From.uc_Com_16led_data[11]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[12]  = puc_Nume_work1;
     }
     if (block == 6)
     {
         if(puc_Nume_work100 > 0)   ComuniPackRemo.Data.From.uc_Com_16led_data[13]  = puc_Nume_work100;
         ComuniPackRemo.Data.From.uc_Com_16led_data[14]  = puc_Nume_work10;
         ComuniPackRemo.Data.From.uc_Com_16led_data[15]  = puc_Nume_work1;
     }

     return;
}
#endif
//---------------------------------------------------------------------
void ac_freq_set_class() //2010.01.20 交流周波数表示のための計算と表示値ｓｅｔ
{
     unsigned char puc_Nume_work100;
     unsigned char puc_Nume_work10;
     unsigned char puc_Nume_work1;
     signed short pss_Data;

     //周波数演算
     //pss_Data = ac_frequency_limit_member(gtt_Internal_pack.Data.In.usAcFreq); //2019.03.15 ihara del
     puc_Nume_work100 = (unsigned char)( pss_Data / 100);
     puc_Nume_work10 = ((unsigned char)( pss_Data - (puc_Nume_work100 * 100))/ 10);
     puc_Nume_work1 = ((unsigned char)( pss_Data -  (puc_Nume_work100 * 100) - (puc_Nume_work10 * 10)));

         ComuniPackRemo.Data.From.uc_Com_lcd_data2[0]  = ' ';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[1]  = 'ｵ';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[2]  = '-';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[3]  = 'ﾄ';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[4]  = 'ｼ';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[5]  = 'ｭ'; //2010.01.29　小文字のユに変更
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[6]  = 'ｳ';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[7]  = 'ﾊ';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[8]  = 'ｽ';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[9]  = 'ｳ';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[10] = ':';
         if (puc_Nume_work100 == 0)                          //2010.01.29　100Hz未満の時百の位をスペースにする。
         {
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[11] = ' ';
         } else {
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[11] = puc_Nume_work100 + 0x30;
         }
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[12] = puc_Nume_work10  + 0x30;
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[13] = puc_Nume_work1   + 0x30;
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[14] = 'H';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[15] = 'z';

     return;
}


void pulse_set_class(unsigned char select) //2011.10.03 パルス関連表示のための計算と表示値ｓｅｔ
{
     unsigned char puc_Nume_work100;
     unsigned char puc_Nume_work10;
     unsigned char puc_Nume_work1;
     signed short pss_Data;
     unsigned char puc_select;

     puc_select = select;
     switch (puc_select)
     {
        case 0: //IP
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[0]  = '>';
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[8]  = ' ';
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[0]  = ' ';
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[8]  = ' ';
             break;
        case 1: //IB
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[0]  = ' ';
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[8]  = ' ';
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[0]  = '>';
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[8]  = ' ';
             break;
        case 2: //DUTY
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[0]  = ' ';
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[8]  = '>';
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[0]  = ' ';
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[8]  = ' ';
             break;
        case 3: //FREQ
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[0]  = ' ';
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[8]  = ' ';
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[0]  = ' ';
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[8]  = '>';
             break;
     }
     

         //IP
         ComuniPackRemo.Data.From.uc_Com_lcd_data1[1]  = 'I';
         ComuniPackRemo.Data.From.uc_Com_lcd_data1[2]  = 'P';
         ComuniPackRemo.Data.From.uc_Com_lcd_data1[3]  = ':';

         pss_Data = gtt_Internal_pack.Data.In.usIP;
         puc_Nume_work100 = (unsigned char)( pss_Data / 100);
         puc_Nume_work10 = ((unsigned char)( pss_Data - (puc_Nume_work100 * 100))/ 10);
         puc_Nume_work1 = ((unsigned char)( pss_Data -  (puc_Nume_work100 * 100) - (puc_Nume_work10 * 10)));

         if (puc_Nume_work100 == 0)                          //100未満の時百の位をスペースにする。
         {
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[4] = ' ';
         } else {
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[4] = puc_Nume_work100 + 0x30;
         }
         if (puc_Nume_work10 == 0 && puc_Nume_work100 == 0)                           //10未満の時百の位をスペースにする。
         {
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[5] = ' ';
         } else {
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[5] = puc_Nume_work10  + 0x30;
         }
         ComuniPackRemo.Data.From.uc_Com_lcd_data1[6] = puc_Nume_work1   + 0x30;
         ComuniPackRemo.Data.From.uc_Com_lcd_data1[7] = 'A';


         //IB
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[1]   = 'I';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[2]   = 'B';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[3]   = ':';

         pss_Data = gtt_Internal_pack.Data.In.usWeldingCurr;
         puc_Nume_work100 = (unsigned char)( pss_Data / 100);
         puc_Nume_work10 = ((unsigned char)( pss_Data - (puc_Nume_work100 * 100))/ 10);
         puc_Nume_work1 = ((unsigned char)( pss_Data -  (puc_Nume_work100 * 100) - (puc_Nume_work10 * 10)));

         if (puc_Nume_work100 == 0)                          //100未満の時百の位をスペースにする。
         {
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[4] = ' ';
         } else {
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[4] = puc_Nume_work100 + 0x30;
         }
         if (puc_Nume_work10 == 0 && puc_Nume_work100 == 0)                           //10未満の時百の位をスペースにする。
         {
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[5] = ' ';
         } else {
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[5] = puc_Nume_work10  + 0x30;
         }
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = puc_Nume_work1   + 0x30;
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = 'A';



         //PW
         ComuniPackRemo.Data.From.uc_Com_lcd_data1[9]  = 'W';
         ComuniPackRemo.Data.From.uc_Com_lcd_data1[10] = ':';

         pss_Data = gtt_Internal_pack.Data.In.usPulseDuty;
         puc_Nume_work100 = (unsigned char)( pss_Data / 100);
         puc_Nume_work10 = ((unsigned char)( pss_Data - (puc_Nume_work100 * 100))/ 10);
         puc_Nume_work1 = ((unsigned char)( pss_Data -  (puc_Nume_work100 * 100) - (puc_Nume_work10 * 10)));

         if (puc_Nume_work100 == 0)                          //100未満の時百の位をスペースにする。
         {
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[11] = ' ';
         } else {
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[11] = puc_Nume_work100 + 0x30;
         }
         if (puc_Nume_work10 == 0 && puc_Nume_work100 == 0)                           //10未満の時百の位をスペースにする。
         {
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[12] = ' ';
         } else {
             ComuniPackRemo.Data.From.uc_Com_lcd_data1[12] = puc_Nume_work10  + 0x30;
         }
         ComuniPackRemo.Data.From.uc_Com_lcd_data1[13] = puc_Nume_work1   + 0x30;
         ComuniPackRemo.Data.From.uc_Com_lcd_data1[14] = '%';


         //PF
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[9]   = 'F';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[10]  = ':';

         pss_Data = gtt_Internal_pack.Data.In.usPulseFreq;
         if (pss_Data  < 100)
         {
             puc_Nume_work100 = (unsigned char)( pss_Data / 100);
             puc_Nume_work10 = ((unsigned char)( pss_Data - (puc_Nume_work100 * 100))/ 10);
             puc_Nume_work1 = ((unsigned char)( pss_Data -  (puc_Nume_work100 * 100) - (puc_Nume_work10 * 10)));

             ComuniPackRemo.Data.From.uc_Com_lcd_data2[11] = puc_Nume_work10 + 0x30;
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[12] = '.';
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[13] = puc_Nume_work1   + 0x30;
         } else {
             pss_Data = pss_Data / 10;
             puc_Nume_work100 = (unsigned char)( pss_Data / 100);
             puc_Nume_work10 = ((unsigned char)( pss_Data - (puc_Nume_work100 * 100))/ 10);
             puc_Nume_work1 = ((unsigned char)( pss_Data -  (puc_Nume_work100 * 100) - (puc_Nume_work10 * 10)));

             if (puc_Nume_work100 == 0)                          //100未満の時百の位をスペースにする。
             {
                 ComuniPackRemo.Data.From.uc_Com_lcd_data2[11] = ' ';
             } else {
                 ComuniPackRemo.Data.From.uc_Com_lcd_data2[11] = puc_Nume_work100 + 0x30;
             }
             if (puc_Nume_work10 == 0 && puc_Nume_work100 == 0)                           //10未満の時百の位をスペースにする。
             {
                 ComuniPackRemo.Data.From.uc_Com_lcd_data2[12] = ' ';
             } else {
                 ComuniPackRemo.Data.From.uc_Com_lcd_data2[12] = puc_Nume_work10  + 0x30;
             }
             ComuniPackRemo.Data.From.uc_Com_lcd_data2[13] = puc_Nume_work1   + 0x30;
         }
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[14] = 'H';
         ComuniPackRemo.Data.From.uc_Com_lcd_data2[15] = 'z';

     return;
}


void rob_snd_class (void)
{

     signed short pss_Okcv_adjust_data_work;
     signed short pss_Select_dital_data_work;
     signed short pss_Current_work;
     signed short pss_Voltage_work;


     signed short pss_Parametar_set_data_work; //2008.02.25


     unsigned char puc_Not_volt_display; //2009.02.13


        //ComuniPack.Data.From.usWeldingOutCurr = gtt_Fpga.Curr_result;		// 出力電流値 2010.03.24 del
        //ComuniPack.Data.From.usWeldingOutVolt = gtt_Fpga.Volt_result;		// 出力電圧値 2010.03.24 del
        ComuniPack.Data.From.ucImprudence     = gtt_Internal_pack.Data.Out.ucImprudence;              // 短絡回数値
        ComuniPack.Data.From.ucMotorCurr2     = gtt_Internal_pack.Data.Out.ucMotorCurr2;             // モータ電流値２
        ComuniPack.Data.From.usMotorRPM2      = gtt_Internal_pack.Data.Out.usMotorRPM2;		// モータ回転数２
        ComuniPack.Data.From.ucMotorRPM      = (unsigned char)(gtt_Internal_pack.Data.Out.usMotorRPM2 / 10); // モータ回転数１ 2007.4.5
        ComuniPack.Data.From.BackUp.usWeldTimes = gtt_Internal_pack.Data.Out.BackUp.usWeldTimes; //溶接回数

     if (guc_Robot_connect_flag == true)
     {

        ComuniPack.Data.From.usWeldingOutCurr = gss_RCurrent_work;		// 出力電流値
        ComuniPack.Data.From.usWeldingOutVolt = gss_RVoltage_work;		// 出力電圧値
     } else { //2010.03.24
		
		if (gss_Select_dital[P_CURR_DISPLAY] == false) // 平均値
        {
		    ComuniPack.Data.From.usWeldingOutCurr = gtt_Fpga.Curr_result;		// 出力電流値
            ComuniPack.Data.From.usWeldingOutVolt = gtt_Fpga.Volt_result;		// 出力電圧値
        } else {
			ComuniPack.Data.From.usWeldingOutCurr = gtt_Fpga.Curr_result_rms;		// 出力電流値
            ComuniPack.Data.From.usWeldingOutVolt = gtt_Fpga.Volt_result_rms;		// 出力電圧値
	    }
     }



     //変更2007.3.30～

        // 電流データを送信バッファにセットする
#if 0
        ComuniPack.Data.From.usWeldingOutCurr = gtt_Fpga.Curr_result;		// 出力電流値
        ComuniPack.Data.From.usWeldingOutVolt = gtt_Fpga.Volt_result;		// 出力電圧値
        ComuniPack.Data.From.ucImprudence     = gtt_Internal_pack.Data.Out.ucImprudence;              // 短絡回数値
        ComuniPack.Data.From.ucMotorCurr2     = gtt_Internal_pack.Data.Out.ucMotorCurr2;             // モータ電流値２
        ComuniPack.Data.From.usMotorRPM2      = gtt_Internal_pack.Data.Out.usMotorRPM2;		// モータ回転数２
        ComuniPack.Data.From.ucMotorRPM      = (unsigned char)(gtt_Internal_pack.Data.Out.usMotorRPM2 / 10); // モータ回転数１ 2007.4.5
        ComuniPack.Data.From.BackUp.usWeldTimes = gtt_Internal_pack.Data.Out.BackUp.usWeldTimes; //溶接回数
#endif


        if (gtt_En.uc_En_inquiry == 3) //ロボットからの問い合わせで、ＥＮ比率とＥＮ比率計算後一元化電圧を送信 2008.10.03
        {
            gtt_En.uc_En_inquiry = 0;
            ComuniPack.Data.From.uc_En_a    = gtt_Internal_pack.Data.Out.uc_En_a;
            ComuniPack.Data.From.us_En_Okcv = gtt_Internal_pack.Data.Out.us_En_Okcv;
            GD2_Send_CMD(0xe3);
        }

        //*******************************　ロボット送信部　************************************
#if 1 //2008.12.08復活
        if(Timer._500m != gtt_Ctrl_counter.Backup_500m && gtt_Internal_pack.Data.bRS422Connection && guc_Robot_connect_flag == true)	// 500m秒経過した？ 2008.12.08変更
        {
           if((guc_Sequence_mode > IDLING) && (guc_Sequence_mode < BURN_BACK))
           {
               GD2_Send_CMD(0xc1);
               GD2_Send_CMD(0xc3);
           } else {
               if((ComuniPack.Data.To.fWelderCheck.Bit1Sw.Motor_on) && (gtt_Internal_pack.Data.Out.ucMotorCurr2 != 0)) //2007.3.15
               {
                 GD2_Send_CMD(0xc3);		// モータ回転ONでモータ回転中の場合は回転数を送信
               }
           }
           gtt_Ctrl_counter.Backup_500m = Timer._500m;
        }
#endif
        //*************************************************************************************
        //**********************2007.11.29　リモコン通信実験用　*******************************

        //************************************* 初期表示 **************************************

    if (guc_Robot_connect_flag == true && guc_Robot_connect_one_shot_flag == OFF)
    {
        guc_Robot_connect_one_shot_flag = ON;
        gtt_Ctrl_flag.User_all_parameter_reset_exe = ON; //ＣＨ０のユーザーパラメータ、詳細データを初期化 ロボット接続に影響を与えないため
        guc_Crater_mode_counter = 0; //クレータ無しモードに変更
        all_char_lcd1_set_class(guc_Dital_code[ROBOT_CONNECT] , gus_Point_code[ROBOT_CONNECT]); // BP3 Phase2 2009.01.13 @Tny
        all_char_lcd2_set_class(guc_Dital_code2[ROBOT_CONNECT][0] , gus_Point_code[ROBOT_CONNECT]); // BP4 Phase3 2009.01.13 @Tny
        //char_set_class(7,"  ",false,false,false); //2008.10.06 2009.07.14 del
        //REMO_Send_CMD(0x20);
        guc_Select_counter = MODE_WELDING; //2010.03.23
        gtt_Ctrl_flag.Set_screen_on_off = OFF; //2010.03.23

//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if true //2009.07.14
		REMO_Send_CMD(0x34); //2009.07.14
		REMO_Send_CMD(0x35); //2009.07.14
#else
		gb_RemCom_0x20	= true;
#endif
//-----------------------------------------------------------

        ComuniPackRemo.Data.From.t_Led.uc_Led[0] = 0x00; //2008.10.06
        ComuniPackRemo.Data.From.t_Led.uc_Led[1] = 0x00; //2008.10.06
        ComuniPackRemo.Data.From.t_Led.uc_Led[2] = 0x00; //2009.07.14
        ComuniPackRemo.Data.From.t_Led.uc_Led[3] = 0x00; //2009.07.14
        ComuniPackRemo.Data.From.t_Led.uc_Led[4] = 0x00; //2009.07.14
        ComuniPackRemo.Data.From.t_Led.uc_Led[5] = 0x00; //2009.07.14
        //REMO_Send_CMD(0x22); //2008.10.06
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if true //2009.07.14
		REMO_Send_CMD(0x38); //2009.07.14
#else
		gb_RemCom_0x22	= true;
#endif
//-----------------------------------------------------------

#if 0 //2009.07.14
        ComuniPackRemo.Data.From.uc_Com_7led_data[0] = ' ';
        ComuniPackRemo.Data.From.uc_Com_7led_data[1] = ' ';
        ComuniPackRemo.Data.From.uc_Com_7led_data[2] = ' ';
        ComuniPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
        ComuniPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
        ComuniPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
        
        InternalPackRemo.Data.From.uc_Com_7led_data[0] = ' ';
        InternalPackRemo.Data.From.uc_Com_7led_data[1] = ' ';
        InternalPackRemo.Data.From.uc_Com_7led_data[2] = ' ';
        InternalPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
        InternalPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
        InternalPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
#endif
        ComuniPackRemo.Data.From.uc_Com_7led_data[0] = 'C';
        ComuniPackRemo.Data.From.uc_Com_7led_data[1] = 'o';
        ComuniPackRemo.Data.From.uc_Com_7led_data[2] = 'n';
        ComuniPackRemo.Data.From.uc_Com_7led_data[3] = '-';
        ComuniPackRemo.Data.From.uc_Com_7led_data[4] = '-';
        ComuniPackRemo.Data.From.uc_Com_7led_data[5] = '-';
        
        InternalPackRemo.Data.From.uc_Com_7led_data[0] = 'C';
        InternalPackRemo.Data.From.uc_Com_7led_data[1] = 'o';
        InternalPackRemo.Data.From.uc_Com_7led_data[2] = 'n';
        InternalPackRemo.Data.From.uc_Com_7led_data[3] = '-';
        InternalPackRemo.Data.From.uc_Com_7led_data[4] = '-';
        InternalPackRemo.Data.From.uc_Com_7led_data[5] = '-';
        //REMO_Send_CMD(0x21);         
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if true //2009.07.14
		REMO_Send_CMD(0x21);
#else
		gb_RemCom_0x21	= true;
#endif
//-----------------------------------------------------------
         //<><><> 2009.07.14 <><><>
         ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no = 0x80;           // ７セグ
         ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 1;       // 点滅表示の有り無し
         ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 20;       // 点滅時点灯時間
         ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 5;       // 点滅時消灯時間
         ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;     // 点滅繰り返し回数
		 //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if true //2019.09.02
		REMO_Send_CMD(0x23);
#else
		gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
         
                 
    }
    


    if (ComuniPackRemo.Data.bRS422Connection == true && guc_Robot_connect_flag == false)
    {
        //＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞
        //＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞  起動時時の表示処理  2007.12.09 ＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞
        //＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞
        if (guc_Initial_display_flag == false)
        {
//--------- Phase13 by @Tny 2008/09/18 --------
#if true
            if((gus_Initial_timer > 0) || ((gtt_Dsw.Sw.No7 == false)&&(gb_Iif_BuiltIn)&&((guc_Init_wait_sequence > 0) || (gb_Iif_Input == false))))
#endif
//--------------------------------------------
           {
              if (guc_Machine_no_flag == 0)
              {
                  gus_Dps_timer = 450; //2009.02.17 350->450 ロード用に復活
                  //gus_Dps_timer = 350; //2009.02.12 ロード用に復活
                  //gus_Dps_timer = 150; //2009.01.20
//---------------------------------------------------
// BP4 Phase15 by @Tny 2009.02.25	//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
				  gus_Initial_timer = 1500; // 初期処理待ち時間：再更新
				  gus_Dps_timer		= 150;	// 初期表示時間
//---------------------------------------------------
                  guc_Machine_no_flag = 1;
                  char_set_class(1,"STD",false,false,false);
                  char_set_class(2,"--",false,false,false);
                  char_set_class(3,"---",false,false,false);
                  char_set_class(4,"YC",false,false,false);
//                  char_set_class(5,"500",false,false,false); //2009.12.28 500BP4
                  char_set_class(5,"300",false,false,false); //2011.09.28 300BP4
                  char_set_class(6,"BP4",false,false,false);//2009.01.09 BP表示   2009.01.13 BP3->BP4
                  char_set_class(7,"  ",false,false,false); //2008.07.28
                  //REMO_Send_CMD(0x20);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x20);
#else
					gb_RemCom_0x20	= true;
#endif
//-----------------------------------------------------------
              }
              //ＤＰＳ＋Ｖｅｒの表示処理
#if 0 //2009.01.20
              if (gus_Dps_timer < 300 && guc_Dps_R8_flag == false)
              {
                  guc_Dps_R8_flag = true;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[0] = ComuniPackRemo.Data.To.Dps_Ver.uc_Dps_no_upper;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[1] = ComuniPackRemo.Data.To.Dps_Ver.uc_Dps_no_mid;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[2] = ComuniPackRemo.Data.To.Dps_Ver.uc_Dps_no_lower;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[3] = ComuniPackRemo.Data.To.Dps_Ver.uc_Ver_no_upper;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[4] = ComuniPackRemo.Data.To.Dps_Ver.uc_Ver_no_mid;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[5] = ComuniPackRemo.Data.To.Dps_Ver.uc_Ver_no_lower;
                  //REMO_Send_CMD(0x21);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x21);
#else
					gb_RemCom_0x21	= true;
#endif
//-----------------------------------------------------------
              }
              if (gus_Dps_timer < 200 && guc_Dps_M16_flag == false)
              {
                  guc_Dps_M16_flag = true;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[0] = ComuniPackRemo.Data.To.Dps_Ver.uc_Dps_no_upper16;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[1] = ComuniPackRemo.Data.To.Dps_Ver.uc_Dps_no_mid16;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[2] = ComuniPackRemo.Data.To.Dps_Ver.uc_Dps_no_lower16;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[3] = ComuniPackRemo.Data.To.Dps_Ver.uc_Ver_no_upper16;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[4] = ComuniPackRemo.Data.To.Dps_Ver.uc_Ver_no_mid16;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[5] = ComuniPackRemo.Data.To.Dps_Ver.uc_Ver_no_lower16;
                  //REMO_Send_CMD(0x21);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x21);
#else
					gb_RemCom_0x21	= true;
#endif
//-----------------------------------------------------------
              }
#endif
              //if (gus_Dps_timer < 100 && guc_Dps_M32_flag == false)
              //if (gus_Dps_timer < 150 && guc_Dps_M32_flag == false) //2009.01.20
              //if (gus_Dps_timer < 300 && guc_Dps_M32_flag == false) //2009.02.12 ロード用に300に変更
              if (gus_Dps_timer < 350 && guc_Dps_M32_flag == false) //2009.02.17 350に変更
              {
                  guc_Dps_M32_flag = true;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[0] = ComuniPackRemo.Data.To.Dps_Ver.uc_Dps_no_upper32;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[1] = ComuniPackRemo.Data.To.Dps_Ver.uc_Dps_no_mid32;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[2] = ComuniPackRemo.Data.To.Dps_Ver.uc_Dps_no_lower32;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[3] = ComuniPackRemo.Data.To.Dps_Ver.uc_Ver_no_upper32;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[4] = ComuniPackRemo.Data.To.Dps_Ver.uc_Ver_no_mid32;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[5] = ComuniPackRemo.Data.To.Dps_Ver.uc_Ver_no_lower32;
                  //REMO_Send_CMD(0x21);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x21);
#else
					gb_RemCom_0x21	= true;
#endif
//-----------------------------------------------------------
              }
              //if (gus_Dps_timer < 5 && guc_Dps_space_flag == false)
              if (gus_Dps_timer < 5 && guc_Dps_space_flag == false) //2009.02.12 5->50　ロード用に変更
              {
                  guc_Dps_space_flag = true;
                  ComuniPackRemo.Data.From.uc_Com_7led_data[0] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[1] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[2] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
                  
                  InternalPackRemo.Data.From.uc_Com_7led_data[0] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[1] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[2] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
                  //REMO_Send_CMD(0x21);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x21);
#else
					gb_RemCom_0x21	= true;
#endif
//-----------------------------------------------------------
//--------- Phase13 & Phase16 by @Tny 2008/09/18 2008/09/22 --------
#if true
                if((gtt_Dsw.Sw.No7 == false)&&(gb_Iif_BuiltIn)){
                  char_set_class(1,"I/F",false,false,false);
                  char_set_class(2," L",false,false,false);
                  char_set_class(3,"INK",false,false,false);
                  char_set_class(4," W",false,false,false);
                  char_set_class(5,"AIT",false,false,false);
                  char_set_class(6,"ING",false,false,true);
                  //REMO_Send_CMD(0x20);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x20);
#else
					gb_RemCom_0x21	= true;
#endif
//-----------------------------------------------------------
                }
#endif
//--------------------------------------------
              }
               
           } else {
                  //ＬＥＤ一覧表
                  //  0:LED22 初期
                  //  1:LED23 本溶接
                  //  2:LED24 クレータ
                  //  3:LED25 各種設定
                  //  4:LED26 電圧表示
                  //  5:LED27 波形制御
                  //  6:LED32 インチング
                  //  7:LED33 ガス
                  //  8:LED28 選択”溶接”
                  //  9:LED29 選択”詳細”
                  // 10:LED30 選択”記憶”
                  // 11:LED31 選択”再生”
                  // 12:LED15 一元
                  // 13:LED16 個別
                //************************* 通常時の表示処理 2007.12.06 ********************
     	         led11_data = (unsigned char)(gtt_Internal_pack.Data.In.usWeldingCurr / 100);
        	     if (led11_data == 0)
      	         {
                     com_led11_data = 0x20;
        	     } else {
                     com_led11_data = led11_data + 0x30;
                 }
                 led12_data = ((unsigned char)(gtt_Internal_pack.Data.In.usWeldingCurr - (led11_data * 100)) / 10);
                 if (led11_data == 0 && led12_data == 0)
                 {
                     com_led12_data = 0x20;
                 } else {
                     com_led12_data = led12_data + 0x30;
                 } 
      
                 led13_data = (unsigned char)(gtt_Internal_pack.Data.In.usWeldingCurr - (led11_data * 100) - (led12_data * 10));
                 com_led13_data = led13_data + 0x30;

                 led21_data = (unsigned char)(gtt_Internal_pack.Data.In.usWeldingVolt / 100);
                 if (led21_data == 0)
                 {
                    com_led21_data = 0x20;
                 } else {
                    com_led21_data = led21_data + 0x30;
                 }
                 led22_data = ((unsigned char)(gtt_Internal_pack.Data.In.usWeldingVolt - (led21_data * 100)) / 10);
                 if (led21_data == 0 && led22_data == 0)
                 {
                    com_led22_data = 0x20;
                 } else {
                    com_led22_data = led22_data + 0x30;
                 }
      
                 led23_data = (unsigned char)(gtt_Internal_pack.Data.In.usWeldingVolt - (led21_data * 100) - (led22_data * 10));
                 com_led23_data = led23_data + 0x30;
                
                 ComuniPackRemo.Data.From.uc_Com_7led_data[0] = com_led11_data;
                 ComuniPackRemo.Data.From.uc_Com_7led_data[1] = com_led12_data;
                 ComuniPackRemo.Data.From.uc_Com_7led_data[2] = com_led13_data;
                 ComuniPackRemo.Data.From.uc_Com_7led_data[3] = com_led21_data;
                 ComuniPackRemo.Data.From.uc_Com_7led_data[4] = com_led22_data | 0x08;
                 ComuniPackRemo.Data.From.uc_Com_7led_data[5] = com_led23_data;
                 //**************************************************************************

                 
                 if (guc_Pulse_mode_data == 0x03) //2008.02.08
                 {
                     gtt_Internal_pack.Data.In.fPulseMode.ALL = 0x10;
                 } else if (guc_Pulse_mode_data == 0x05) {
                     gtt_Internal_pack.Data.In.fPulseMode.ALL = 0x00;
                 }
                 gtt_Internal_pack.Data.In.fPulseMode.ALL = gtt_Internal_pack.Data.In.fPulseMode.ALL | 0x03;//上記に伴い追加2008.03.27

                 //all_char_lcd1_set_class("ﾖｳｾﾂﾃﾞﾝﾘｭｳｾｯﾃｲ  " , 0x0000);
                 
                  //REMO_Send_CMD(0x20);
                 //REMO_Send_CMD(0x35); //2009.01.13
                 //REMO_Send_CMD(0x36); //2009.01.13

                 // REMO_Send_CMD(0x21);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x21);
#else
					gb_RemCom_0x21	= true;
#endif
//-----------------------------------------------------------
                  ComuniPackRemo.Data.From.t_Led.uc_Led[0] = 0;
                  ComuniPackRemo.Data.From.t_Led.uc_Led[1] = 0;
                  //REMO_Send_CMD(0x22);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x22);
#else
					gb_RemCom_0x22	= true;
#endif
//-----------------------------------------------------------
                  guc_Initial_display_flag = true;

                  { //起動時の詳細データの反映 2008.10.27
                    unsigned char puc_Index;
                    for (puc_Index = 0 ; puc_Index <= SELECT_DITAL_MAX ; puc_Index++)
                    {
                         //ditail_set_member(puc_Index); 2009.03.07 del
                    }
                  }


           }
            
        } else {
        //＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞
        //＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞  通常時の表示処理  2007.12.09 ＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞
        //＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞＜＞

            //<><><><><><><><><><><><> 通常時の指令電流・電圧計算処理 2007.12.06 <><><><><><><><><><><><><>

            //if((guc_Sequence_mode >= INITIAL_WELD) && (guc_Sequence_mode <= BURN_BACK)) //2008.08.04変更
            if((guc_Sequence_mode >= PRE_FLOW) && (guc_Sequence_mode <= BURN_BACK)) //2010.02.10変更
            {
		if((guc_Sequence_mode >= PRE_FLOW) && (guc_Sequence_mode <= HF_CTRL)) //2010.02.10
                {
		    gss_Current_work = 0;
                    gss_Voltage_work = 0;
                    gss_Current_result_work = 0;		//
                    gss_Voltage_result_work = 0;		//
                    gsl_Current_result_work_rms = 0;		//
                    gsl_Voltage_result_work_rms = 0;	
                    gtt_Ctrl_counter.Avr_result = 0;


                    gtt_Ctrl_flag.uc_One_shot_voltage = false;  //2013.02.13	2013_02_13_500BP4より移植　2014.06.11

					//<><><> 電極短絡の回避 2014.06.24 <><><>
        		    gtt_Ctrl_counter.us_One_shot_voltage = ((1000 / gtt_Internal_pack.Data.In.usPulseFreq) * 10);
		            //<><><><><><><><><><><><><><><><><><><><>


                }
#if 1
             if (guc_Method_condition_data == EXP_DC_METHOD || guc_Method_condition_data == EXP_AC_METHOD) //2009.02.23
             {
                if(Timer._10m != gtt_Ctrl_counter.Backup_10m) //2009.02.16 500->200 2009.02.23 200->50 2009.03.17 50 -> 10
                {
                   if (gss_Select_dital[P_CURR_DISPLAY] == false) // 2009.03.26 平均値
                   {
                	gss_Current_result_work = gss_Current_result_work + gtt_Fpga.Curr_result;
                	gss_Voltage_result_work = gss_Voltage_result_work + gtt_Fpga.Volt_result;
                	gtt_Ctrl_counter.Avr_result++;
                	if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT)
                	{
                            gss_Current_work = gss_Current_result_work / gtt_Ctrl_counter.Avr_result;
                            gss_Voltage_work = gss_Voltage_result_work / gtt_Ctrl_counter.Avr_result;
                            gss_Current_result_work = 0;		//
                            gss_Voltage_result_work = 0;		//
                            gtt_Ctrl_counter.Avr_result = 0;
                            //gss_Weld_end_current = pss_Current_work; //2009.03.23 del
                            //gss_Weld_end_voltage = pss_Voltage_work; //2009.03.23 del
                            gtt_Ctrl_flag.Weld_end_disp = OFF;
                	}
                    } else { //2009.03.26 実効値
                	gsl_Current_result_work_rms = gsl_Current_result_work_rms + gtt_Fpga.Curr_result_rms;
                	gsl_Voltage_result_work_rms = gsl_Voltage_result_work_rms + gtt_Fpga.Volt_result_rms;
                	gtt_Ctrl_counter.Avr_result++;
                	if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT)
                	{
                            //<><><>型変換実施 2010.02.18 <><><>
                            double pd_Current_data;
                            double pd_Voltage_data;
                            pd_Current_data = gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result;
                            pd_Voltage_data = gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result;
//2011.10.01                            gss_Current_work = (short)sqrt(pd_Current_data);
                            gss_Current_work = (short)(sqrt(pd_Current_data)-(double)0.5);//2011.10.01 300BP4
                            gss_Voltage_work = (short)sqrt(pd_Voltage_data);
                            //<><><><><><><><><><><><><><><><><>

                            //gss_Current_work = sqrt(gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                            //gss_Voltage_work = sqrt(gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                            gsl_Current_result_work_rms = 0;		//
                            gsl_Voltage_result_work_rms = 0;		//
                            gtt_Ctrl_counter.Avr_result = 0;
                            gtt_Ctrl_flag.Weld_end_disp = OFF;
                	}
                    }
                	//gtt_Ctrl_counter.Backup_500m = Timer._500m;
                	//gtt_Ctrl_counter.Backup_200m = Timer._200m; //2009.02.16 500->200
                	//gtt_Ctrl_counter.Backup_50m = Timer._50m; //2009.02.16 500->200 2009.02.23 200->50
                	gtt_Ctrl_counter.Backup_10m = Timer._10m; //2009.02.16 500->200 2009.02.23 200->50 2009.03.23 50->10
                }
             } else {
                if (guc_Pulse_mode_data == 0) //パルス無 2009.03.23
                {
                    if(Timer._10m != gtt_Ctrl_counter.Backup_10m) //エキスパートモード以外では平均化を多くし、安定化させる 2009.03.17 50->10
                    {
                       if (gss_Select_dital[P_CURR_DISPLAY] == false) // 2009.03.26 平均値
                       {
                	   gss_Current_result_work = gss_Current_result_work + gtt_Fpga.Curr_result;
                	   gss_Voltage_result_work = gss_Voltage_result_work + gtt_Fpga.Volt_result;
                	   gtt_Ctrl_counter.Avr_result++;
                	   if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                	   {
                               gss_Current_work = gss_Current_result_work / gtt_Ctrl_counter.Avr_result;
                               gss_Voltage_work = gss_Voltage_result_work / gtt_Ctrl_counter.Avr_result;
                               gss_Current_result_work = 0;		//
                               gss_Voltage_result_work = 0;		//
                               gtt_Ctrl_counter.Avr_result = 0;
                               //gss_Weld_end_current = pss_Current_work; //2009.03.23 del
                               //gss_Weld_end_voltage = pss_Voltage_work; //2009.03.23 del
                               gtt_Ctrl_flag.Weld_end_disp = OFF;
                	   }
                        } else { //2009.03.26 実効値
                	   gsl_Current_result_work_rms = gsl_Current_result_work_rms + gtt_Fpga.Curr_result_rms;
                	   gsl_Voltage_result_work_rms = gsl_Voltage_result_work_rms + gtt_Fpga.Volt_result_rms;
                	   gtt_Ctrl_counter.Avr_result++;
                	   if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                	   {
                               //<><><>型変換実施 2010.02.18 <><><>
                               double pd_Current_data;
                               double pd_Voltage_data;
                               pd_Current_data = gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result;
                               pd_Voltage_data = gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result;
//2011.10.01                               gss_Current_work = (short)sqrt(pd_Current_data);
                               gss_Current_work = (short)(sqrt(pd_Current_data)-(double)0.5);//2011.10.01 300BP4
                               gss_Voltage_work = (short)sqrt(pd_Voltage_data);
                               //<><><><><><><><><><><><><><><><><>

                               //gss_Current_work = sqrt(gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                               //gss_Voltage_work = sqrt(gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                               gsl_Current_result_work_rms = 0;		//
                               gsl_Voltage_result_work_rms = 0;		//
                               gtt_Ctrl_counter.Avr_result = 0;
                               gtt_Ctrl_flag.Weld_end_disp = OFF;
                	   }
                        }
                	   //gtt_Ctrl_counter.Backup_50m = Timer._50m;
                	   gtt_Ctrl_counter.Backup_10m = Timer._10m; //2009.03.23
                   }
                } else { //パルス有 2009.03.23
                   //if (gtt_Internal_pack.Data.In.usPulseFreq < 8) // 0.1～0.7Hz区間
                   if (gtt_Internal_pack.Data.In.usPulseFreq < 5) // 0.1～0.4Hz区間 2009.03.27
                   {
                       //出力電流値
                       switch (guc_Sequence_mode)
                       {
                           case INITIAL_WELD:
                           case CRATER_WELD:
                           case BURN_BACK:
                           case UP_SLOPE:
                           case DOWN_SLOPE:
                           case MAIN_WELD:
                                //この区間はパルスがないので電流、電圧を算出する
                                if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                {
                                   if (gss_Select_dital[P_CURR_DISPLAY] == false) // 2009.03.26 平均値
                                   {
                	               gss_Current_result_work = gss_Current_result_work + gtt_Fpga.Curr_result;
                	               gss_Voltage_result_work = gss_Voltage_result_work + gtt_Fpga.Volt_result;
                	               gtt_Ctrl_counter.Avr_result++;
                	               if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                	               {
                                           gss_Current_work = gss_Current_result_work / gtt_Ctrl_counter.Avr_result;
                                           gss_Voltage_work = gss_Voltage_result_work / gtt_Ctrl_counter.Avr_result;
                                           gss_Current_result_work = 0;
                                           gss_Voltage_result_work = 0;
                                           gtt_Ctrl_counter.Avr_result = 0;
                                           gtt_Ctrl_flag.Weld_end_disp = OFF;
                	               }
                                    } else { //2009.03.26 実効値
                	               gsl_Current_result_work_rms = gsl_Current_result_work_rms + gtt_Fpga.Curr_result_rms;
                	               gsl_Voltage_result_work_rms = gsl_Voltage_result_work_rms + gtt_Fpga.Volt_result_rms;
                	               gtt_Ctrl_counter.Avr_result++;
                	               if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                	               {
                                           //<><><>型変換実施 2010.02.18 <><><>
                                           double pd_Current_data;
                                           double pd_Voltage_data;
                                           pd_Current_data = gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result;
                                           pd_Voltage_data = gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result;
//2011.10.01                                           gss_Current_work = (short)sqrt(pd_Current_data);
                                           gss_Current_work = (short)(sqrt(pd_Current_data)-(double)0.5);//2011.10.01 300BP4
                                           gss_Voltage_work = (short)sqrt(pd_Voltage_data);
                                           //<><><><><><><><><><><><><><><><><>

                                           //gss_Current_work = sqrt(gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                                           //gss_Voltage_work = sqrt(gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                                           gsl_Current_result_work_rms = 0;		//
                                           gsl_Voltage_result_work_rms = 0;		//
                                           gtt_Ctrl_counter.Avr_result = 0;
                                           gtt_Ctrl_flag.Weld_end_disp = OFF;
                	               }
                                    }
                	               gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                }
                                break;
#if 0 //2009.03.27
                           case UP_SLOPE:
                                //gss_Current_work = (short)((gf_Up_slop_base_curr + gf_Up_slop_pulse_curr) / 2);
                                gss_Current_work = (short)((gf_Up_slop_base_curr * (100 - gtt_Internal_pack.Data.In.usPulseDuty) / 100) + ((gf_Up_slop_pulse_curr * gtt_Internal_pack.Data.In.usPulseDuty) / 100));
                                break;
                           case DOWN_SLOPE:
                                //gss_Current_work = (short)((gf_Down_slop_base_curr + gf_Down_slop_pulse_curr) / 2); 
                                gss_Current_work = (short)((gf_Down_slop_base_curr * (100 - gtt_Internal_pack.Data.In.usPulseDuty) / 100) + ((gf_Down_slop_pulse_curr * gtt_Internal_pack.Data.In.usPulseDuty) / 100));
                                break;
                           case MAIN_WELD:
                                //gss_Current_work = (short)((gtt_Internal_pack.Data.In.usWeldingCurr + gtt_Internal_pack.Data.In.usIP) / 2);
                                gss_Current_work = (short)(((float)gtt_Internal_pack.Data.In.usWeldingCurr * (100 - gtt_Internal_pack.Data.In.usPulseDuty) / 100) + (((float)gtt_Internal_pack.Data.In.usIP * gtt_Internal_pack.Data.In.usPulseDuty) / 100));
                                break;
#endif
                           default:
                                break;
                       }

                       //出力電圧
#if 0 //2009.03.27
                       switch (guc_Sequence_mode)
                       {
                           case UP_SLOPE:
                           case DOWN_SLOPE:
                           case MAIN_WELD:
                                if (gss_Select_dital[P_CURR_DISPLAY] == false) // 2009.03.26 平均値
                                {
                                    if (gtt_Ctrl_flag.Condition_change == OFF) //ベース電圧の算出（ピークに移ったら算出）
                                    {
                	                if (gtt_Ctrl_flag.Base_avr_result == OFF)
                	                {
                                            gtt_Ctrl_flag.Base_avr_result = ON;
                                            if (gtt_Ctrl_counter.Base_avr_result == 0) gtt_Ctrl_counter.Base_avr_result = 1;
                                            gss_Base_voltage_work = gsi_Base_voltage_result_work / gtt_Ctrl_counter.Base_avr_result;
                                            gsi_Base_voltage_result_work = 0;
                                            gtt_Ctrl_counter.Base_avr_result = 0;
                                            gtt_Ctrl_flag.Weld_end_disp = OFF;
                	                }
                                        if (gtt_Ctrl_flag.Peak_read_delay == OFF)
                                        {
                                            gtt_Ctrl_flag.Peak_read_delay = ON;
                                            gtt_Ctrl_counter.Peak_read_delay = 10;
                                        } else if (gtt_Ctrl_counter.Peak_read_delay <= 0){
                                            if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                            {
                	                       gsi_Base_voltage_result_work = gsi_Base_voltage_result_work + gtt_Fpga.Volt_result;
                	                       gtt_Ctrl_counter.Base_avr_result++;
                	                       gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                            }
                                        }
                                        gtt_Ctrl_flag.Base_read_delay = OFF;
                                    } else { //ピーク電圧の算出（ベースに移ったら算出）
                                        if (gtt_Ctrl_flag.Base_read_delay == OFF)
                                        {
                                            gtt_Ctrl_flag.Base_read_delay = ON;
                                            gtt_Ctrl_counter.Base_read_delay = 10;
                                        } else if (gtt_Ctrl_counter.Base_read_delay <= 0){
                                            if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                            {
                	                       gsi_Base_voltage_result_work = gsi_Base_voltage_result_work + gtt_Fpga.Volt_result;
                	                       gtt_Ctrl_counter.Base_avr_result++;
                	                       gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                            }
                                        }
                                        gtt_Ctrl_flag.Peak_read_delay = OFF;
                                        gtt_Ctrl_flag.Base_avr_result = OFF;
                                    }
                                    gss_Voltage_work = gss_Base_voltage_work;
                                } else { //2009.03.26 実効値
                                    if (gtt_Ctrl_flag.Condition_change == OFF) //ベース電圧の算出（ピークに移ったら算出）
                                    {
                	                if (gtt_Ctrl_flag.Base_avr_result == OFF)
                	                {
                                            gtt_Ctrl_flag.Base_avr_result = ON;
                                            if (gtt_Ctrl_counter.Base_avr_result == 0) gtt_Ctrl_counter.Base_avr_result = 1;
                                            gss_Base_voltage_work = sqrt(gsl_Base_voltage_result_work_rm / gtt_Ctrl_counter.Base_avr_result);
                                            gsl_Base_voltage_result_work_rm = 0;
                                            gtt_Ctrl_counter.Base_avr_result = 0;
                                            gtt_Ctrl_flag.Weld_end_disp = OFF;
                	                }
                                        if (gtt_Ctrl_flag.Peak_read_delay == OFF)
                                        {
                                            gtt_Ctrl_flag.Peak_read_delay = ON;
                                            gtt_Ctrl_counter.Peak_read_delay = 10;
                                        } else if (gtt_Ctrl_counter.Peak_read_delay <= 0){
                                            if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                            {
                	                       gsl_Base_voltage_result_work_rm = gsl_Base_voltage_result_work_rm + gtt_Fpga.Volt_result_rms;
                	                       gtt_Ctrl_counter.Base_avr_result++;
                	                       gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                            }
                                        }
                                        gtt_Ctrl_flag.Base_read_delay = OFF;
                                    } else { //ピーク電圧の算出（ベースに移ったら算出）
                                        if (gtt_Ctrl_flag.Base_read_delay == OFF)
                                        {
                                            gtt_Ctrl_flag.Base_read_delay = ON;
                                            gtt_Ctrl_counter.Base_read_delay = 10;
                                        } else if (gtt_Ctrl_counter.Base_read_delay <= 0){
                                            if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                            {
                	                       gsl_Base_voltage_result_work_rm = gsl_Base_voltage_result_work_rm + gtt_Fpga.Volt_result_rms;
                	                       gtt_Ctrl_counter.Base_avr_result++;
                	                       gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                            }
                                        }
                                        gtt_Ctrl_flag.Peak_read_delay = OFF;
                                        gtt_Ctrl_flag.Base_avr_result = OFF;
                                    }
                                    gss_Voltage_work = gss_Base_voltage_work;
                                }
                                break;
                           default:
                                break;
                       }
#endif                       
                   //} else if (gtt_Internal_pack.Data.In.usPulseFreq >= 8 && gtt_Internal_pack.Data.In.usPulseFreq <= 50) { //0.8～5.0Hz区間
                   //} else if (gtt_Internal_pack.Data.In.usPulseFreq >= 5 && gtt_Internal_pack.Data.In.usPulseFreq <= 50) { //0.8～5.0Hz区間 2009.03.27 test
                   } else if (gtt_Internal_pack.Data.In.usPulseFreq >= 5 && gtt_Internal_pack.Data.In.usPulseFreq <= 10) { //0.8～1.0Hz区間 2009.03.27 test
	                       


                       //出力電流値
                       switch (guc_Sequence_mode)
                       {
                           case INITIAL_WELD:
                           case CRATER_WELD:
                           case BURN_BACK:
                                //この区間はパルスがないので電流、電圧を算出する
                                if (gss_Select_dital[P_CURR_DISPLAY] == false) // 2009.03.26 平均値
                                {
                                    if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                    {
                	               gss_Current_result_work = gss_Current_result_work + gtt_Fpga.Curr_result;
                	               gss_Voltage_result_work = gss_Voltage_result_work + gtt_Fpga.Volt_result;
                	               gtt_Ctrl_counter.Avr_result++;
                	               if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                	               {
                                       gss_Current_work = gss_Current_result_work / gtt_Ctrl_counter.Avr_result;
                                       gss_Voltage_work = gss_Voltage_result_work / gtt_Ctrl_counter.Avr_result;
                                       gss_Current_result_work = 0;
                                       gss_Voltage_result_work = 0;
                                       gtt_Ctrl_counter.Avr_result = 0;
                                       gtt_Ctrl_flag.Weld_end_disp = OFF;
                	               }
                	               gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                    }
                                } else { //2009.03.26 実効値
                                    if(Timer._10m != gtt_Ctrl_counter.Backup_10m) //2010.03.03
                                    {
                	               gsl_Current_result_work_rms = gsl_Current_result_work_rms + gtt_Fpga.Curr_result_rms;
                	               gsl_Voltage_result_work_rms = gsl_Voltage_result_work_rms + gtt_Fpga.Volt_result_rms;
                	               gtt_Ctrl_counter.Avr_result++;
                	               if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                	               {
                                           //<><><>型変換実施 2010.02.18 <><><>
                                           double pd_Current_data;
                                           double pd_Voltage_data;
                                           pd_Current_data = gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result;
                                           pd_Voltage_data = gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result;
//2011.10.01                                           gss_Current_work = (short)sqrt(pd_Current_data);
                                           gss_Current_work = (short)(sqrt(pd_Current_data)-(double)0.5);//2011.10.01 300BP4
                                           gss_Voltage_work = (short)sqrt(pd_Voltage_data);
                                           //<><><><><><><><><><><><><><><><><>

                                           //gss_Current_work = sqrt(gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                                           //gss_Voltage_work = sqrt(gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                                           gsl_Current_result_work_rms = 0;		//
                                           gsl_Voltage_result_work_rms = 0;		//
                                           gtt_Ctrl_counter.Avr_result = 0;
                                           gtt_Ctrl_flag.Weld_end_disp = OFF;
                	               }
                	               gtt_Ctrl_counter.Backup_10m = Timer._10m; //2010.03.03
                                    }
                                }
                                break;
                           case UP_SLOPE:
                           case DOWN_SLOPE:
                           case MAIN_WELD:
                                if (gss_Select_dital[P_CURR_DISPLAY] == false) // 2009.03.26 平均値
                                {
                                    if (gtt_Ctrl_flag.Condition_change == OFF) //ベース電圧の算出（ピークに移ったら算出）
                                    {
                	                if (gtt_Ctrl_flag.Base_avr_result == OFF)
                	                {
                                        gtt_Ctrl_flag.Base_avr_result = ON;
                                        if (gtt_Ctrl_counter.Base_avr_result == 0) gtt_Ctrl_counter.Base_avr_result = 1;
                                        gss_Base_current_work = gsi_Base_current_result_work / gtt_Ctrl_counter.Base_avr_result;
                                        gss_Base_voltage_work = gsi_Base_voltage_result_work / gtt_Ctrl_counter.Base_avr_result;
                                        gsi_Base_current_result_work = 0;
                                        gsi_Base_voltage_result_work = 0;
                                        gtt_Ctrl_counter.Base_avr_result = 0;
                                        gtt_Ctrl_flag.Weld_end_disp = OFF;
                	                }
                                        if (gtt_Ctrl_flag.Peak_read_delay == OFF)
                                        {
                                            gtt_Ctrl_flag.Peak_read_delay = ON;
                                            gtt_Ctrl_counter.Peak_read_delay = 10;
                                        } else if (gtt_Ctrl_counter.Peak_read_delay <= 0){
                                          if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                          {
                	                     gsi_Base_current_result_work = gsi_Base_current_result_work + gtt_Fpga.Curr_result;
                	                     gsi_Base_voltage_result_work = gsi_Base_voltage_result_work + gtt_Fpga.Volt_result;
                	                     gtt_Ctrl_counter.Base_avr_result++;
                	                     gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                          }
                                        }
                                        gtt_Ctrl_flag.Base_read_delay = OFF;
                                    } else { //ピーク電圧の算出（ベースに移ったら算出）
                                        if (gtt_Ctrl_flag.Base_read_delay == OFF)
                                        {
                                            gtt_Ctrl_flag.Base_read_delay = ON;
                                            gtt_Ctrl_counter.Base_read_delay = 10;
                                        } else if (gtt_Ctrl_counter.Base_read_delay <= 0){
                                            if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                            {
                	                       gsi_Base_current_result_work = gsi_Base_current_result_work + gtt_Fpga.Curr_result;
                	                       gsi_Base_voltage_result_work = gsi_Base_voltage_result_work + gtt_Fpga.Volt_result;
                	                       gtt_Ctrl_counter.Base_avr_result++;
                	                       gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                            }
                                        }
                                        gtt_Ctrl_flag.Peak_read_delay = OFF;
                                        gtt_Ctrl_flag.Base_avr_result = OFF;
                                    }
                                } else { //2009.03.26 実効値
                                    if (gtt_Ctrl_flag.Condition_change == OFF) //ベース電圧の算出（ピークに移ったら算出）
                                    {
                	                if (gtt_Ctrl_flag.Base_avr_result == OFF)
                	                {
                                        gtt_Ctrl_flag.Base_avr_result = ON;
                                        if (gtt_Ctrl_counter.Base_avr_result == 0) gtt_Ctrl_counter.Base_avr_result = 1;

                                            //<><><>型変換実施 2010.02.18 <><><>
                                            {
                                            double pd_Current_data;
                                            double pd_Voltage_data;
                                            pd_Current_data = gsl_Base_current_result_work_rm / gtt_Ctrl_counter.Base_avr_result;
                                            pd_Voltage_data = gsl_Base_voltage_result_work_rm / gtt_Ctrl_counter.Base_avr_result;
//2011.10.01                                            gss_Base_current_work = (short)sqrt(pd_Current_data);
                                            gss_Base_current_work = (short)(sqrt(pd_Current_data)-(double)0.5);//2011.10.01 300BP4
                                            gss_Base_voltage_work = (short)sqrt(pd_Voltage_data);
                                            }
                                            //<><><><><><><><><><><><><><><><><>

                                            //gss_Base_current_work = sqrt(gsl_Base_current_result_work_rm / gtt_Ctrl_counter.Base_avr_result); //2010.02.18 del
                                            //gss_Base_voltage_work = sqrt(gsl_Base_voltage_result_work_rm / gtt_Ctrl_counter.Base_avr_result); //2010.02.18 del
                                            gsl_Base_current_result_work_rm = 0;
                                            gsl_Base_voltage_result_work_rm = 0;
                                            gtt_Ctrl_counter.Base_avr_result = 0;
                                            gtt_Ctrl_flag.Weld_end_disp = OFF;
                	                }
                                        if (gtt_Ctrl_flag.Peak_read_delay == OFF)
                                        {
                                            gtt_Ctrl_flag.Peak_read_delay = ON;
                                            gtt_Ctrl_counter.Peak_read_delay = 10;
                                        } else if (gtt_Ctrl_counter.Peak_read_delay <= 0){
                                          if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                          {
                	                     gsl_Base_current_result_work_rm = gsl_Base_current_result_work_rm + gtt_Fpga.Curr_result_rms;
                	                     gsl_Base_voltage_result_work_rm = gsl_Base_voltage_result_work_rm + gtt_Fpga.Volt_result_rms;
                	                     gtt_Ctrl_counter.Base_avr_result++;
                	                     gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                          }
                                        }
                                        gtt_Ctrl_flag.Base_read_delay = OFF;
                                    } else { //ピーク電圧の算出（ベースに移ったら算出）
                                        if (gtt_Ctrl_flag.Base_read_delay == OFF)
                                        {
                                            gtt_Ctrl_flag.Base_read_delay = ON;
                                            gtt_Ctrl_counter.Base_read_delay = 10;
                                        } else if (gtt_Ctrl_counter.Base_read_delay <= 0){
                                            if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                            {
                	                       gsl_Base_current_result_work_rm = gsl_Base_current_result_work_rm + gtt_Fpga.Curr_result_rms;
                	                       gsl_Base_voltage_result_work_rm = gsl_Base_voltage_result_work_rm + gtt_Fpga.Volt_result_rms;
                	                       gtt_Ctrl_counter.Base_avr_result++;
                	                       gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                            }
                                        }
                                        gtt_Ctrl_flag.Peak_read_delay = OFF;
                                        gtt_Ctrl_flag.Base_avr_result = OFF;
                                    }
                                }


							 	//<><><> 電極短絡の回避 2013.02.13 	2013_02_13_500BP4より移植　2014.06.11 2014.06.24 <><><>
   		                		if(guc_Sequence_mode > HF_CTRL)
                                {
                                   if (gtt_Ctrl_flag.uc_One_shot_voltage == false)
                                   {
										if(gtt_Ctrl_counter.us_One_shot_voltage <= 0)	// 2014.06.24
										{
                                       		gtt_Ctrl_flag.uc_One_shot_voltage = true;
										}
                                       gss_Voltage_work = gtt_Special_menu.ss_Service_data[S_E_L_SHORT_LEVEL];
									   gss_Base_voltage_work = gtt_Special_menu.ss_Service_data[S_E_L_SHORT_LEVEL];
                                   }
                                }
                                //<><><><><><><><><><><><><><><><><><><><>


                                gss_Current_work = gss_Base_current_work;
                                gss_Voltage_work = gss_Base_voltage_work;
                                break;
                           default:
                                break;
                       }
                   //} else if (gtt_Internal_pack.Data.In.usPulseFreq >= 11 && gtt_Internal_pack.Data.In.usPulseFreq <= 50){ //1.1Hz～5.0Hzの区間
                   //} else if (gtt_Internal_pack.Data.In.usPulseFreq >= 11 && gtt_Internal_pack.Data.In.usPulseFreq <= 40){ //1.1Hz～4.0Hzの区間 2010.03.05
                   } else if (gtt_Internal_pack.Data.In.usPulseFreq >= 11 && gtt_Internal_pack.Data.In.usPulseFreq <= 25){ //1.1Hz～2.5Hzの区間 2011.11.14

	                        	//<><><> 電極短絡の回避 2013.02.13 	2013_02_13_500BP4より移植　2014.06.11 <><><>
   		                		if(guc_Sequence_mode > HF_CTRL)
                                {
                                   if (gtt_Ctrl_flag.uc_One_shot_voltage == false)
                                   {
                                       gtt_Ctrl_flag.uc_One_shot_voltage = true;
                                       gss_Voltage_work = gtt_Special_menu.ss_Service_data[S_E_L_SHORT_LEVEL];
                                   }
                                }
                                //<><><><><><><><><><><><><><><><><><><><>

                                if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                {
                                   if (gss_Select_dital[P_CURR_DISPLAY] == false) // 2009.03.26 平均値
                                   {
                                   short pss_Avr_result_work;
                	               gsl_Current_result_work2 = gsl_Current_result_work2 + gtt_Fpga.Curr_result;
                	               gsl_Voltage_result_work2 = gsl_Voltage_result_work2 + gtt_Fpga.Volt_result;
                	               gtt_Ctrl_counter.Avr_result++;
                	               //if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                                   pss_Avr_result_work = 2000; //2009.04.11
                	               if (gtt_Ctrl_counter.Avr_result >=  (pss_Avr_result_work / gtt_Internal_pack.Data.In.usPulseFreq)) //2009.04.11
                	               {
                                           gss_Current_work = gsl_Current_result_work2 / gtt_Ctrl_counter.Avr_result;
                                           gss_Voltage_work = gsl_Voltage_result_work2 / gtt_Ctrl_counter.Avr_result;
                                           gsl_Current_result_work2 = 0;
                                           gsl_Voltage_result_work2 = 0;
                                           gtt_Ctrl_counter.Avr_result = 0;
                                           gtt_Ctrl_flag.Weld_end_disp = OFF;
                	               }
                                    } else { //2009.03.26 実効値
                                   short pss_Avr_result_work;
                	               gsl_Current_result_work_rms = gsl_Current_result_work_rms + gtt_Fpga.Curr_result_rms;
                	               gsl_Voltage_result_work_rms = gsl_Voltage_result_work_rms + gtt_Fpga.Volt_result_rms;
                	               gtt_Ctrl_counter.Avr_result++;
                                   pss_Avr_result_work = 2000; //2009.04.11
                	               if (gtt_Ctrl_counter.Avr_result >=  (pss_Avr_result_work / gtt_Internal_pack.Data.In.usPulseFreq)) //2009.04.11
                	               //if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                	               {
                                           //<><><>型変換実施 2010.02.18 <><><>
                                           double pd_Current_data;
                                           double pd_Voltage_data;
                                           pd_Current_data = gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result;
                                           pd_Voltage_data = gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result;
//2011.10.01                                           gss_Current_work = (short)sqrt(pd_Current_data);
                                           gss_Current_work = (short)(sqrt(pd_Current_data)-(double)0.5);//2011.10.01 300BP4
                                           gss_Voltage_work = (short)sqrt(pd_Voltage_data);
                                           //<><><><><><><><><><><><><><><><><>
                                           //gss_Current_work = sqrt(gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                                           //gss_Voltage_work = sqrt(gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                                           gsl_Current_result_work_rms = 0;		//
                                           gsl_Voltage_result_work_rms = 0;		//
                                           gtt_Ctrl_counter.Avr_result = 0;
                                           gtt_Ctrl_flag.Weld_end_disp = OFF;
                                        }
                                    }
                	            gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                }
                   //} else {//5.1Hz以上の区間
                   } else {//4.1Hz以上の区間 2010.03.05
                                if(Timer._10m != gtt_Ctrl_counter.Backup_10m)
                                {
                                   if (gss_Select_dital[P_CURR_DISPLAY] == false) // 2009.03.26 平均値
                                   {
                                   short pss_Avr_result_work;
                	               gss_Current_result_work = gss_Current_result_work + gtt_Fpga.Curr_result;
                	               gss_Voltage_result_work = gss_Voltage_result_work + gtt_Fpga.Volt_result;
                	               gtt_Ctrl_counter.Avr_result++;
                	               if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                	               {
                                           gss_Current_work = gss_Current_result_work / gtt_Ctrl_counter.Avr_result;
                                           gss_Voltage_work = gss_Voltage_result_work / gtt_Ctrl_counter.Avr_result;
                                           gss_Current_result_work = 0;
                                           gss_Voltage_result_work = 0;
                                           gtt_Ctrl_counter.Avr_result = 0;
                                           gtt_Ctrl_flag.Weld_end_disp = OFF;
                	               }
                                    } else { //2009.03.26 実効値
                	               gsl_Current_result_work_rms = gsl_Current_result_work_rms + gtt_Fpga.Curr_result_rms;
                	               gsl_Voltage_result_work_rms = gsl_Voltage_result_work_rms + gtt_Fpga.Volt_result_rms;
                	               gtt_Ctrl_counter.Avr_result++;
                	               if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT2)
                	               {
                                           //<><><>型変換実施 2010.02.18 <><><>
                                           double pd_Current_data;
                                           double pd_Voltage_data;
                                           pd_Current_data = gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result;
                                           pd_Voltage_data = gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result;
//2011.10.01                                           gss_Current_work = (short)sqrt(pd_Current_data);
                                           gss_Current_work = (short)(sqrt(pd_Current_data)-(double)0.5);//2011.10.01 300BP4
                                           gss_Voltage_work = (short)sqrt(pd_Voltage_data);
                                           //<><><><><><><><><><><><><><><><><>
                                           //gss_Current_work = sqrt(gsl_Current_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                                           //gss_Voltage_work = sqrt(gsl_Voltage_result_work_rms / gtt_Ctrl_counter.Avr_result); //2010.02.18 del
                                           gsl_Current_result_work_rms = 0;		//
                                           gsl_Voltage_result_work_rms = 0;		//
                                           gtt_Ctrl_counter.Avr_result = 0;
                                           gtt_Ctrl_flag.Weld_end_disp = OFF;
                                        }
                                    }
                	            gtt_Ctrl_counter.Backup_10m = Timer._10m;
                                }
                   }

                }
             
             }
#endif



#if 1
                
                //if(Timer._500m != gtt_Ctrl_counter.Backup_500m) //2008.03.03
                //if(Timer._200m != gtt_Ctrl_counter.Backup_200m) //2009.02.16 500->200
#if 0
                if(Timer._50m != gtt_Ctrl_counter.Backup_50m) //2009.02.16 500->200 2009.02.23 200->50
                {
                	gss_Current_result_work = gss_Current_result_work + gtt_Fpga.Curr_result;
                	gss_Voltage_result_work = gss_Voltage_result_work + gtt_Fpga.Volt_result;
                	gtt_Ctrl_counter.Avr_result++;
                	if (gtt_Ctrl_counter.Avr_result >= AVR_RESULT_COUNT)
                	{
                            gss_Current_work = gss_Current_result_work / gtt_Ctrl_counter.Avr_result;
                            gss_Voltage_work = gss_Voltage_result_work / gtt_Ctrl_counter.Avr_result;
                            gss_Current_result_work = 0;		//
                            gss_Voltage_result_work = 0;		//
                            gtt_Ctrl_counter.Avr_result = 0;
                            gss_Weld_end_current = pss_Current_work;
                            gss_Weld_end_voltage = pss_Voltage_work;
                            gtt_Ctrl_flag.Weld_end_disp = OFF;
                	}
                	//gtt_Ctrl_counter.Backup_500m = Timer._500m;
                	//gtt_Ctrl_counter.Backup_200m = Timer._200m; //2009.02.16 500->200
                	gtt_Ctrl_counter.Backup_50m = Timer._50m; //2009.02.16 500->200 2009.02.23 200->50
                }
#endif
#if 0 //2009.02.20
                if (guc_Method_condition_data == EXP_DC_METHOD || guc_Method_condition_data == EXP_AC_METHOD) //2009.02.19エキスパートﾓｰﾄﾞ試験用
                {
                   gss_Voltage_work = gtt_Fpga.Volt_result;
                   gss_Weld_end_voltage = pss_Voltage_work;
                }
#endif
                //リファレンス電圧の測定 2009.02.20
                //if (guc_Method_condition_data == EXP_DC_METHOD || guc_Method_condition_data == EXP_AC_METHOD) //2009.02.19エキスパートﾓｰﾄﾞ試験用
                if ((guc_Method_condition_data == EXP_DC_METHOD || guc_Method_condition_data == EXP_AC_METHOD) && guc_Sequence_mode == MAIN_WELD) //エキスパートモード時メイン溶接時のみ起動
                {

#if 0 //2010.01.12 del
                    if (gtt_Ctrl_flag.Ref_voltage == OFF)
                    {
                        gtt_Ctrl_flag.Ref_voltage = ON;
                        gtt_Ctrl_flag.Ref_voltage_result = OFF;
                        gtt_Ctrl_counter.Ref_voltage = 5000;
                        //gtt_Ctrl_flag.Cal = ON;
                        gf_Out_current = (float)gtt_Internal_pack.Data.In.usWeldingCurr;
                    } else if (gtt_Ctrl_counter.Ref_voltage <= 0 && gtt_Ctrl_flag.Ref_voltage_result == OFF) {
                        gss_Voltage_ref = gss_Voltage_work;
                        gtt_Ctrl_flag.Ref_voltage_result = ON;
                        gtt_Ctrl_flag.Cal = OFF;
                    }
#endif
                    //<><><> リファレンス電圧の取得 2010.01.12 <><><>
                    if (gtt_Ctrl_flag.Ref_voltage == OFF)
                    {
                        gtt_Ctrl_flag.Ref_voltage = ON;
                        gtt_Ctrl_flag.Ref_voltage_result = OFF;
                        //gtt_Ctrl_counter.Ref_voltage = 5000;
                        gtt_Ctrl_counter.Ref_voltage = gss_Select_dital[P_EXTARNAL_MASK_TIME] * 100;
                        gf_Out_current = (float)gtt_Internal_pack.Data.In.usWeldingCurr;
                        gtt_Ctrl_flag.Ref_voltage_add_start    = ON; //リファレンス電圧積算開始フラグ ON
                        gsl_Voltage_ref_add                    = 0;
                        gtt_Ctrl_counter.Ref_voltage_add_count = 0;
                    } else if (gtt_Ctrl_counter.Ref_voltage <= 0 && gtt_Ctrl_flag.Ref_voltage_result == OFF) {
                        //gss_Voltage_ref = gss_Voltage_work;
                        gtt_Ctrl_flag.Ref_voltage_result = ON;
                        gtt_Ctrl_flag.Cal = OFF;
                        gtt_Ctrl_flag.Ref_voltage_add_start = OFF; //リファレンス電圧積算開始フラグ OFF
                        gss_Voltage_ref = gsl_Voltage_ref_add / gtt_Ctrl_counter.Ref_voltage_add_count; //リファレンス電圧算出
                    }
                    if (gtt_Ctrl_flag.Ref_voltage_add_start == ON)
                    {
                        gsl_Voltage_ref_add = gsl_Voltage_ref_add + gss_Voltage_work;
                        gtt_Ctrl_counter.Ref_voltage_add_count++;
                    }
                    //<><><><><><><><><><><><><><><><><><><><><><><>


                    if (gtt_Ctrl_flag.Cal == OFF && gss_Voltage_ref != gss_Voltage_work)
                    {
                     {
                         //目標電流の計算
                        float A_1;
                        short B_1;
                        float a_1;
                        short s_1;
                        float work_1;
                        B_1 = (gss_Voltage_ref - gss_Voltage_work) / 2;
                        //a_1 = ((float)gtt_Internal_pack.Data.In.usWeldingCurr / 300) + (1.0 * ((float)gss_Select_dital[P_EXTARNAL_LEVEL_A]/100.0));
                        a_1 = ((float)gtt_Internal_pack.Data.In.usWeldingCurr / MAX_CURRENT) + (0.5 * ((float)gss_Select_dital[P_EXTARNAL_LEVEL_A]/100.0)); //2009.02.23
                        work_1 = (float)B_1 * a_1;
                        if (work_1 >= 0)
                        {
                            s_1 = (short)(work_1 + 0.5);
                        } else {
                            s_1 = (short)(work_1 - 0.5);
                        }
                        A_1 = (float)gtt_Internal_pack.Data.In.usWeldingCurr;
                        //A_1 = (float)gf_Out_current;
                        A_1 = A_1 + (float)s_1;
#if 0
                        if (A_1 > 300.0)
                        {
                            A_1 = 300.0;
                        }
                        if (A_1 < 4.0)
                        {
                            A_1 = 4.0;
                        }
#endif
                        gf_Target_current = A_1;
                      }
                        gtt_Ctrl_flag.Cal = ON;
                        //gss_Target_current_sabun = (short)gtt_Internal_pack.Data.In.usWeldingCurr - (short)gf_Target_current;
                        //if (gss_Target_current_sabun_bkup == gss_Target_current_sabun)
                        //{
                        //    gtt_Ctrl_flag.Cal = OFF;
                        //} else {
                            //gss_Target_current_sabun_bkup = gss_Target_current_sabun;
                        //}
#if 0 //2010.02.10 ターゲット電流の最大値を溶接指令電流値の２０％に変更
                        if ( gf_Target_current > ((float)gtt_Internal_pack.Data.In.usWeldingCurr + (float)gtt_Internal_pack.Data.In.usWeldingCurr * 0.1))
                        {
                             //gtt_Ctrl_flag.Cal = OFF;
                             gf_Target_current = (float)gtt_Internal_pack.Data.In.usWeldingCurr + (float)gtt_Internal_pack.Data.In.usWeldingCurr * 0.1;
                        } else if ( gf_Target_current < ((float)gtt_Internal_pack.Data.In.usWeldingCurr - (float)gtt_Internal_pack.Data.In.usWeldingCurr * 0.1)) {
                             //gtt_Ctrl_flag.Cal = OFF;
                             gf_Target_current = (float)gtt_Internal_pack.Data.In.usWeldingCurr - (float)gtt_Internal_pack.Data.In.usWeldingCurr * 0.1;
                        }
#endif
                        if ( gf_Target_current > ((float)gtt_Internal_pack.Data.In.usWeldingCurr + (float)gtt_Internal_pack.Data.In.usWeldingCurr * 0.2))
                        {
                             gf_Target_current = (float)gtt_Internal_pack.Data.In.usWeldingCurr + (float)gtt_Internal_pack.Data.In.usWeldingCurr * 0.2;
                        } else if ( gf_Target_current < ((float)gtt_Internal_pack.Data.In.usWeldingCurr - (float)gtt_Internal_pack.Data.In.usWeldingCurr * 0.2)) {
                             gf_Target_current = (float)gtt_Internal_pack.Data.In.usWeldingCurr - (float)gtt_Internal_pack.Data.In.usWeldingCurr * 0.2;
                        }

                        if (gf_Target_current > gf_Out_current )
                        //if (gf_Target_current > gtt_Internal_pack.Data.In.usWeldingCurr)
                        {
                            gtt_Ctrl_flag.hugou = ON;
                        } else if (gf_Target_current < gf_Out_current) {
                            gtt_Ctrl_flag.hugou = OFF;
                        } else {
                            gtt_Ctrl_flag.Cal = OFF;
                        }
                     }
                }

                                                             


                pss_Current_work = gss_Current_work;

                if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                {
                    pss_Voltage_work = gss_Voltage_work;
                    //<><><> 出力電圧表示制限 50V 2010.01.21 <><><>
                    if (pss_Voltage_work >= 500)
                    {
                        pss_Voltage_work = 500;
                    }
                    //<><><><><><><><><><><><><><><><><><><><><><><>
                } else {
                    puc_Not_volt_display = true;
                }

                //2009.04.11
                if (guc_Method_condition_data == STD_HAND_METHOD)
                {
                    if (gtt_Ctrl_flag.Hard_cd == OFF)
                    {
                         pss_Current_work = 0;
                         pss_Voltage_work = 0;
                    }
                }
                


#endif

#if 0
                if(Timer._500m != gtt_Ctrl_counter.Backup_500m)	// 溶接中の電流電圧をテスト的に送るため追加 2008.01.21
                {
                   if (guc_Current_test_flag == OFF)
                   {
                       gss_Curr_result_test = gss_Curr_result_test + 10;		// 出力電流値
                       if (gss_Curr_result_test > 350)
                       {
                           guc_Current_test_flag = ON;
                       }
                   } else {
                       gss_Curr_result_test = gss_Curr_result_test - 10;		// 出力電流値
                       if (gss_Curr_result_test < 50)
                       {
                           guc_Current_test_flag = OFF;
                       }
                   }

                   if (guc_Voltage_test_flag == OFF)
                   {
                       gss_Volt_result_test = gss_Volt_result_test + 10;		// 出力電流値
                       if (gss_Volt_result_test > 350)
                       {
                           guc_Voltage_test_flag = ON;
                       }
                   } else {
                       gss_Volt_result_test = gss_Volt_result_test - 10;		// 出力電流値
                       if (gss_Volt_result_test < 50)
                       {
                           guc_Voltage_test_flag = OFF;
                       }
                   }
                   gtt_Ctrl_counter.Backup_500m = Timer._500m;
                }

                pss_Current_work = gss_Curr_result_test;		// 出力電流値
                pss_Voltage_work = gss_Volt_result_test;		// 出力電圧値
#endif
        	if (puc_Not_volt_display == true) //2009.03.16
                {
            	  if (guc_Select_counter == MODE_WELDING) //溶接表示 2008.08.07		// BP4 Phase6 by @Tny 2009/01/27
            	  {
                        //com_led21_data = ' ';
                        //***** BP4用に変更 2009.01.13 *****
                        switch (gus_Sequence_set_data) //2009.01.19
                    	{
                            case PREFLOW_SET_DATA: //プリフロー
               	                pss_Voltage_work = gtt_Internal_pack.Data.In.sPreFlowTime;
                                break;
                            case AFTERFLOW_SET_DATA: //アフターフロー
               	                pss_Voltage_work = gtt_Internal_pack.Data.In.sAfterFlowTime;
                                break;
                            case UPSLOP_SET_DATA: //アップスロープ
               	                pss_Voltage_work = gtt_Internal_pack.Data.In.sUpSlopTime;
                                break;
                            case DOWNSLOP_SET_DATA: //ダウンスロープ
                                if (guc_Crater_mode_counter != SEQUENCE_ARC_SPOT) //2009.03.06
                                {
               	                    pss_Voltage_work = gtt_Internal_pack.Data.In.sDownSlopTime;
                                } else {
               	                    pss_Voltage_work = gtt_Ditail_work.ss_Arc_spot_time; //2009.03.06 2009.03.16 unsigned->signed
                                }
                                break;
                            case PULSE_ITEM_SET_DATA: //パルス項目の設定
                                switch (guc_Pulse_item_counter)
                                {
                                    case 1: //パルス電流設定
                                           break;
                                    case 2: //パルス幅
               	                           pss_Voltage_work = gtt_Internal_pack.Data.In.usPulseDuty;
                                           break;
                                    case 0: //パルス周波数
               	                           pss_Voltage_work = gtt_Internal_pack.Data.In.usPulseFreq;
                                           if (pss_Voltage_work > 99) //2009.03.02
                                           {
                                               pss_Voltage_work = pss_Voltage_work / 10;
                                           }
                                           break;
                                }
                                break;
                            case AC_TIG_ITEM_SET_DATA: //交流ＴＩＧ設定項目 2009.01.19
                                switch (guc_Ac_tig_set_counter)
                                {
                                    case 1: //クリーニング幅選択 2009.01.19
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.ucCleaningDuty;
                                           break;
                                    case 0: //交流周波数選択
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.usAcFreq;
                                           break;
                                    default:
                                           break;
                                }
                                break;
                            case MIX_TIG_ITEM_SET_DATA: //ＭＩＸＴＩＧ設定項目 2009.01.20
                                switch (guc_Mix_tig_set_counter)
                                {
                                    case 1: //ＭＩＸ周波数選択 2009.01.19
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.ucMixFreq;
                                           break;
                                    case 0: //直流比率選択
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.ucMixAcRatio;
                                           break;
                                    default:
                                           break;
                                }
                                break;
                            case NO_SET_DATA:
                                break;
                    	}
                  }

                }


                if (gus_Pre_display_timer > 0) //2007.12.10
        	    //if (gus_Pre_display_timer > 0 || puc_Not_volt_display == true) //2009.02.13 2009.03.16
                {
//----- Phase18 by @Tny 2008/09/25 -----
#if true
                  com_led21_data = ' ';
#endif
//--------------------------------------------
            	  if (guc_Select_counter == MODE_WELDING) //溶接表示 2008.08.07		// BP4 Phase6 by @Tny 2009/01/27
            	  {
                        //com_led21_data = ' ';
                        //***** BP4用に変更 2009.01.13 *****
                        switch (gus_Sequence_set_data) //2009.01.19
                    	{
                      		case INIT_WELD_CURRENT_SET_DATA://初期 
                    			pss_Current_work = gtt_Internal_pack.Data.In.usWeldingInitCurr;
                        		break;
                      		case MAIN_WELD_CURRENT_SET_DATA://本電流 
                    			pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr;
                        		break;
                      		case CRATER_WELD_CURRENT_SET_DATA://クレータ 
                    			pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCratCurr;
                        		break;
                            case PREFLOW_SET_DATA: //プリフロー
               	                pss_Voltage_work = gtt_Internal_pack.Data.In.sPreFlowTime;
                                break;
                            case AFTERFLOW_SET_DATA: //アフターフロー
               	                pss_Voltage_work = gtt_Internal_pack.Data.In.sAfterFlowTime;
                                break;
                            case UPSLOP_SET_DATA: //アップスロープ
               	                pss_Voltage_work = gtt_Internal_pack.Data.In.sUpSlopTime;
                                break;
                            case DOWNSLOP_SET_DATA: //ダウンスロープ
                                if (guc_Crater_mode_counter != SEQUENCE_ARC_SPOT) //2009.03.06
                                {
               	                    pss_Voltage_work = gtt_Internal_pack.Data.In.sDownSlopTime;
                                } else {
               	                    pss_Voltage_work = gtt_Ditail_work.ss_Arc_spot_time; //2009.03.06 2009.03.16 unsigned->signed
                                }
                                break;
                            case PULSE_ITEM_SET_DATA: //パルス項目の設定
                                switch (guc_Pulse_item_counter)
                                {
                                    case 1: //パルス電流設定
               	                           pss_Current_work = gtt_Internal_pack.Data.In.usIP;
                                           break;
                                    case 2: //パルス幅
               	                           pss_Voltage_work = gtt_Internal_pack.Data.In.usPulseDuty;
                                           break;
                                    case 0: //パルス周波数
               	                           pss_Voltage_work = gtt_Internal_pack.Data.In.usPulseFreq;
                                           if (pss_Voltage_work > 99) //2009.03.02
                                           {
                                               pss_Voltage_work = pss_Voltage_work / 10;
                                           }
                                           break;
                                }
                                break;
                            case AC_TIG_ITEM_SET_DATA: //交流ＴＩＧ設定項目 2009.01.19
                                switch (guc_Ac_tig_set_counter)
                                {
                                    case 1: //クリーニング幅選択 2009.01.19
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.ucCleaningDuty;
                                           break;
                                    case 0: //交流周波数選択
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.usAcFreq;
                                           break;
                                    default:
                                           break;
                                }
                                break;
                            case MIX_TIG_ITEM_SET_DATA: //ＭＩＸＴＩＧ設定項目 2009.01.20
                                switch (guc_Mix_tig_set_counter)
                                {
                                    case 1: //ＭＩＸ周波数選択 2009.01.19
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.ucMixFreq;
                                           break;
                                    case 0: //直流比率選択
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.ucMixAcRatio;
                                           break;
                                    default:
                                           break;
                                }
                                break;
                            case NO_SET_DATA:
                                break;
                    	}

                  } else if (guc_Select_counter == MODE_DETAILS) {	// BP4 Phase6 by @Tny 2009/01/27

                  }
                  if (gus_Pre_display_timer > 0) //2009.02.13
                  {
                   gtt_Ctrl_flag.Pre_set = ON; //2008.01.22
                   gtt_Ctrl_flag.Current_set_out2 = OFF; //2009.02.09
                  }
                   puc_Not_volt_display = false;
                    
                } else {
                       gtt_Ctrl_flag.Pre_set = OFF; //2008.01.22
                }
                 
            } else { //待機中
            
                  //2010.02.10 TS　ON時前回の溶接電流結果が残ってしまうのを防ぐ。
		    gss_Current_result_work = 0;		//
                    gss_Voltage_result_work = 0;		//
                    gsl_Current_result_work_rms = 0;		//
                    gsl_Voltage_result_work_rms = 0;	
                    gtt_Ctrl_counter.Avr_result = 0;
            
            
				pss_Current_work = gss_Current_work;
               	//pss_Voltage_work = gss_Voltage_work; //2009.02.09
               	
				if (gtt_Ctrl_flag.Weld_end_disp == OFF)
            	{
					gtt_Ctrl_counter.Weld_end_disp = 0;
					gtt_Ctrl_flag.Weld_end_disp = ON;
				} else if (gtt_Ctrl_counter.Weld_end_disp <= 0) {
                    
                    //ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set   = true; //電流設定 2009.01.16

            		if (guc_Select_counter == MODE_WELDING) //溶接表示 2008.08.07	// BP4 Phase6 by @Tny 2009/01/27
            		{
                        com_led21_data = ' ';
                    	//switch (guc_Select_current_sel_counter) //2008.02.26変更
                        //***** BP4用に変更 2009.01.13 *****
                        //switch (guc_Sequence_set_data) 
                        switch (gus_Sequence_set_data) //2009.01.19
                    	{
                      		case INIT_WELD_CURRENT_SET_DATA://初期 
                    			pss_Current_work = gtt_Internal_pack.Data.In.usWeldingInitCurr;
                        		break;
                      		case MAIN_WELD_CURRENT_SET_DATA://本電流 
                    			pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr;
                        		break;
                      		case CRATER_WELD_CURRENT_SET_DATA://クレータ 
                    			pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCratCurr;
                        		break;
                            case PREFLOW_SET_DATA: //プリフロー
               	                pss_Voltage_work = gtt_Internal_pack.Data.In.sPreFlowTime;
				                pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.01.16
                                break;
                            case AFTERFLOW_SET_DATA: //アフターフロー
               	                pss_Voltage_work = gtt_Internal_pack.Data.In.sAfterFlowTime;
				                pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.01.16
                                break;
                            case UPSLOP_SET_DATA: //アップスロープ
               	                pss_Voltage_work = gtt_Internal_pack.Data.In.sUpSlopTime;
				                pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.01.16
                                break;
                            case DOWNSLOP_SET_DATA: //ダウンスロープ
               	                //pss_Voltage_work = gtt_Internal_pack.Data.In.sDownSlopTime; //2009.03.06 del 
				                //pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.01.16 2009.03.06 del
                                if (guc_Crater_mode_counter != SEQUENCE_ARC_SPOT) //2009.03.06
                                {
               	                    pss_Voltage_work = gtt_Internal_pack.Data.In.sDownSlopTime;
				                    pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr;
                                } else {
               	                    pss_Voltage_work = gtt_Ditail_work.ss_Arc_spot_time; //2009.03.06 2009.03.16 unsigned->signed
				                    pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr;
                                }
                                break;
                            case PULSE_ITEM_SET_DATA: //パルス項目の設定
                                switch (guc_Pulse_item_counter)
                                {
                                    case 1: //パルス電流設定
               	                           pss_Current_work = gtt_Internal_pack.Data.In.usIP;
                                           break;
                                    case 2: //パルス幅
               	                           pss_Voltage_work = gtt_Internal_pack.Data.In.usPulseDuty;
				                           pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.01.16
                                           break;
                                    case 0: //パルス周波数
               	                           pss_Voltage_work = gtt_Internal_pack.Data.In.usPulseFreq;
                                           if (pss_Voltage_work > 99) //2009.03.02
                                           {
                                               pss_Voltage_work = pss_Voltage_work / 10;
                                           }
				                           pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.01.16
                                           break;
                                }
                                break;
                            case AC_TIG_ITEM_SET_DATA: //交流ＴＩＧ設定項目 2009.01.19
                                switch (guc_Ac_tig_set_counter)
                                {
                                    case 1: //クリーニング幅選択 2009.01.19
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.ucCleaningDuty;
				           pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.02.12
                                           break;
                                    case 0: //交流周波数選択
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.usAcFreq;
				           pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.02.12
                                           break;
                                    default:
                                           break;
                                }
                                break;
                            case MIX_TIG_ITEM_SET_DATA: //ＭＩＸＴＩＧ設定項目 2009.01.20
                                switch (guc_Mix_tig_set_counter)
                                {
                                    case 1: //ＭＩＸ周波数選択 2009.01.19
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.ucMixFreq;
				           pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.02.12
                                           break;
                                    case 0: //直流比率選択
                                           pss_Voltage_work = gtt_Internal_pack.Data.In.ucMixAcRatio;
				           pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.02.12
                                           break;
                                    default:
                                           break;
                                }
                                break;
                            case NO_SET_DATA:
								 // BP4 Phase4 by @Tny 2009.01.15
                                 if (guc_Method_condition_data != NAVI_METHOD) //2009.01.16
                                 {
								     if(guc_Gas_on_off_flag == ON)
                                     {
                                         all_char_lcd1_set_class("ｶﾞｽ ﾃﾝｹﾝﾁｭｳ     " , 0x0000);
                                     } else	{
                                         //if (gtt_Ctrl_flag.No_ch_data == ON) //2009.03.30
                                         //{
                                         //    all_char_lcd1_set_class("ｻｲｾｲﾃﾞｰﾀｶﾞｱﾘﾏｾﾝ " , 0x0000);
                                         //} else {
                                         //    all_char_lcd1_set_class("                " , 0x0000);
                                         //}

                                         //リモコン再生時のLCD表示 2009.03.30
                                         if (gtt_Ctrl_flag.Remo_play_mode == ON)
                                         {
                                             if (gtt_Ctrl_flag.Remo_play_ch_select == ON)
                                             {
                                                 if (gtt_Ctrl_flag.No_ch_data == ON)
                                                 {
                                                     all_char_lcd1_set_class("ｻｲｾｲﾃﾞｰﾀｶﾞｱﾘﾏｾﾝ " , 0x0000);
                                                 } else {
							                         all_char_lcd1_set_class("CHｻｲｾｲﾁｭｳ       " , 0x0000);
                                                 }
                                             } else {
							                         all_char_lcd1_set_class("CHｾﾝﾀｸﾁｭｳ       " , 0x0000);
                                             }
                                          } else {
//-----------------------------------------------------------------------------------------------------------------------------------------------
// <NAVI Enhancements(Phase 1)> 2011.10.26 by @Tny
//
#if true
											if(gtt_Navi.b_Navi_Disp == false){	// ナビ表示フラグ：非表示
												all_char_lcd1_set_class("                " , 0x0000);
											}
#else
                                             all_char_lcd1_set_class("                " , 0x0000);
#endif
//-----------------------------------------------------------------------------------------------------------------------------------------------
                                          }



                                     }
                                 }
				                 pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr; //2009.01.16
                                break;
                    	}
                	} else if (guc_Select_counter == MODE_DETAILS) {	// BP4 Phase6 by @Tny 2009/01/27

                	}
                	gtt_Ctrl_flag.Pre_set = OFF; //2008.01.22
				}
            }

            led11_data = (unsigned char)(pss_Current_work / 100);
            if (led11_data == 0)
            {
                com_led11_data = 0x20;
            } else {
                com_led11_data = led11_data + 0x30;
            }
            led12_data = ((unsigned char)(pss_Current_work - (led11_data * 100)) / 10);
            if (led11_data == 0 && led12_data == 0)
            {
                com_led12_data = 0x20;
            } else {
                com_led12_data = led12_data + 0x30;
            }
            led13_data = (unsigned char)(pss_Current_work - (led11_data * 100) - (led12_data * 10));
            com_led13_data = led13_data + 0x30;

            led21_data = (unsigned char)(pss_Voltage_work / 100);
            if (led21_data == 0)
            {
               if (com_led21_data != '-') com_led21_data = 0x20;
               if((guc_Sequence_mode >= INITIAL_WELD) && (guc_Sequence_mode <= BURN_BACK) && gtt_Ctrl_flag.Pre_set == OFF) //2008.08.04変更
               {
                     com_led21_data = 0x20;
               }
            } else {
               com_led21_data = led21_data + 0x30;
            }
            led22_data = ((unsigned char)(pss_Voltage_work - (led21_data * 100)) / 10);
            if (led21_data == 0 && led22_data == 0)
            {
               com_led22_data = 0x20;
            } else {
               com_led22_data = led22_data + 0x30;
            }
            led23_data = (unsigned char)(pss_Voltage_work - (led21_data * 100) - (led22_data * 10));
            com_led23_data = led23_data + 0x30;
  
            //<><><>小数点の位置決定<><><> 2008.08.28
            if((guc_Sequence_mode >= INITIAL_WELD) && (guc_Sequence_mode <= BURN_BACK))
            {
            	//if (gtt_Ctrl_flag.Pre_set == ON && guc_Adjust_item_counter != 0 && guc_Select_counter != MODE_DETAILS) //VLT 2008.08.22電圧は必ずトップにくるので特別 2008.08.28	// BP4 Phase6 by @Tny 2009/01/27
            	if (gtt_Ctrl_flag.Pre_set == ON && guc_Select_counter != MODE_DETAILS) //2009.02.17
            	{
                    if (gus_Sequence_set_data == PULSE_ITEM_SET_DATA) //2009.01.19 パルス周波数表示時の小数点の位置の変更
                    {
                    //1:パルス電流　2:パルスデューティ 0:パルス周波数
                        if (guc_Pulse_item_counter == PULSE_ITEM_DUTY)
                        {
                            com_led21_data = com_led21_data & (0x7f); 
                            com_led22_data = com_led22_data & (0x7f); 
                            com_led23_data = com_led23_data & (0x7f); 
                            if (com_led22_data == 0x30) //2009.02.12
                            {
                                com_led22_data = 0x20; //空白を表示
                            }
                        }
                        if (guc_Pulse_item_counter == PULSE_ITEM_FREQUENCY)
                        {
                            if (com_led22_data == 0x20) //2009.02.24
                            {
                                com_led22_data = 0x30; //0を表示
                            }
                            //if (gtt_Internal_pack.Data.In.usPulseFreq > 250)
                            if (gtt_Internal_pack.Data.In.usPulseFreq > 99) //2009.03.02
                            {
                                com_led21_data = com_led21_data & (0x7f); 
                                com_led22_data = com_led22_data & (0x7f); 
                            } else {
                                com_led21_data = com_led21_data & (0x7f); 
                                com_led22_data = com_led22_data | (0x80); 
                            }
                        }
                        if (guc_Pulse_item_counter == PULSE_ITEM_CURRENT)
                        {
                            com_led21_data = com_led21_data & (0x7f); 
                            com_led22_data = com_led22_data & (0x7f); 
                            com_led23_data = com_led23_data & (0x7f); 
                        }
                    }

                //if (gus_Sequence_set_data == AC_TIG_ITEM_SET_DATA) //2009.01.19
                    if (gus_Sequence_set_data == AC_TIG_ITEM_SET_DATA || gus_Sequence_set_data == MIX_TIG_ITEM_SET_DATA) //2009.01.20
                    {
                        com_led21_data = com_led21_data & (0x7f); 
                        com_led22_data = com_led22_data & (0x7f);
                        if (gus_Sequence_set_data == MIX_TIG_ITEM_SET_DATA)
                        {
                            switch (guc_Mix_tig_set_counter)
                            {
                               case 1: //ＭＩＸ周波数選択
                                     if (com_led22_data == 0x20) //2009.02.24 2009.03.23
                                     {
                                         com_led22_data = 0x30; //0を表示
                                     }
                                     com_led21_data = com_led21_data & (0x7f); 
                                     com_led22_data = com_led22_data | (0x80); 
                                   break;
                               case 0: //直流比率選択
                                     com_led21_data = com_led21_data & (0x7f); 
                                     com_led22_data = com_led22_data & (0x7f); 
                                   break;
                               default:
                                   break;
                            }
                        }
                    }

                    if (gus_Sequence_set_data == PREFLOW_SET_DATA || gus_Sequence_set_data == AFTERFLOW_SET_DATA || gus_Sequence_set_data == UPSLOP_SET_DATA || gus_Sequence_set_data == DOWNSLOP_SET_DATA) //2009.02.18
                    {
                        if (com_led22_data == 0x20)
                        {
                            com_led22_data = 0x30; //0を表示
                        }
                        com_led22_data = com_led22_data | (0x80);
                    }

                    if (gus_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == NO_SET_DATA || (gus_Sequence_set_data == PULSE_ITEM_SET_DATA && guc_Pulse_item_counter == 1)) //2009.02.18
                    {
                        if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.18
                        {
                            if (com_led22_data == 0x20)
                            {
                                com_led22_data = 0x30; //0を表示
                            }
                            com_led22_data = com_led22_data | (0x80);
                            if (gss_Voltage_work <= 0) //2009.03.24
                            {
                 	            com_led21_data = '-';
                 	            com_led22_data = '-';
                 	            com_led23_data = '-';
                            }
                        } else {
                 	        com_led21_data = '-';
                 	        com_led22_data = '-';
                 	        com_led23_data = '-';
                        }
                    }

            	} else {
                    if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.17
                    {
                        if (com_led22_data == 0x20)
                        {
                            com_led22_data = 0x30; //0を表示
                        }
                 	    com_led22_data = com_led22_data | (0x80);
                        if (gss_Voltage_work <= 0) //2009.03.24
                        {
                 	        com_led21_data = '-';
                 	        com_led22_data = '-';
                 	        com_led23_data = '-';
                        }
                    } else {
                        if (gus_Sequence_set_data == PULSE_ITEM_SET_DATA) //2009.02.17
                        {
                        //1:パルス電流　2:パルスデューティ 0:パルス周波数
                            if (guc_Pulse_item_counter == PULSE_ITEM_DUTY)
                            {
                                com_led21_data = com_led21_data & (0x7f); 
                                com_led22_data = com_led22_data & (0x7f); 
                                com_led23_data = com_led23_data & (0x7f); 
                                if (com_led22_data == 0x30)
                                {
                                   com_led22_data = 0x20; //空白を表示
                                }
                            }
                            if (guc_Pulse_item_counter == PULSE_ITEM_FREQUENCY)
                            {
                                if (com_led22_data == 0x20) //2009.02.24 2009.03.23
                                {
                                    com_led22_data = 0x30; //0を表示
                                }
                                //if (gtt_Internal_pack.Data.In.usPulseFreq > 250)
                                if (gtt_Internal_pack.Data.In.usPulseFreq > 99)
                                {
                                    com_led21_data = com_led21_data & (0x7f); 
                                    com_led22_data = com_led22_data & (0x7f); 
                                } else {
                                    com_led21_data = com_led21_data & (0x7f); 
                                    com_led22_data = com_led22_data | (0x80); 
                                }
                            }
                            if (guc_Pulse_item_counter == PULSE_ITEM_CURRENT)
                            {
                                com_led21_data = com_led21_data & (0x7f); 
                                com_led22_data = com_led22_data & (0x7f); 
                                com_led23_data = com_led23_data & (0x7f); 
                            }
                        }

                        if (gus_Sequence_set_data == AC_TIG_ITEM_SET_DATA || gus_Sequence_set_data == MIX_TIG_ITEM_SET_DATA) //2009.01.20
                        {
                            com_led21_data = com_led21_data & (0x7f); 
                            com_led22_data = com_led22_data & (0x7f);
                            if (gus_Sequence_set_data == MIX_TIG_ITEM_SET_DATA)
                            {
                                switch (guc_Mix_tig_set_counter)
                                {
                                   case 1: //ＭＩＸ周波数選択
                                         if (com_led22_data == 0x20) //2009.02.24 2009.03.23
                                         {
                                             com_led22_data = 0x30; //0を表示
                                         }
                                         com_led21_data = com_led21_data & (0x7f); 
                                         com_led22_data = com_led22_data | (0x80); 
                                       break;
                                   case 0: //直流比率選択
                                         com_led21_data = com_led21_data & (0x7f); 
                                         com_led22_data = com_led22_data & (0x7f); 
                                       break;
                                   default:
                                       break;
                                }
                            }
                        }

                        if (gus_Sequence_set_data == PREFLOW_SET_DATA || gus_Sequence_set_data == AFTERFLOW_SET_DATA || gus_Sequence_set_data == UPSLOP_SET_DATA || gus_Sequence_set_data == DOWNSLOP_SET_DATA) //2009.02.18
                        {
                            if (com_led22_data == 0x20)
                            {
                                com_led22_data = 0x30; //0を表示
                            }
                            com_led22_data = com_led22_data | (0x80);
                        }

                    }
                    
                    if (gus_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == NO_SET_DATA || (gus_Sequence_set_data == PULSE_ITEM_SET_DATA && guc_Pulse_item_counter == 1) || puc_Not_volt_display == true) //2009.02.13
                    {
                        //if (puc_Not_volt_display == false) //2009.02.13
                        if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.18
                        {
                        } else {
                               if (gus_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA || (gus_Sequence_set_data == PULSE_ITEM_SET_DATA && guc_Pulse_item_counter == 1)) //2009.03.16
                               {
                 	           com_led21_data = '-'; //2009.03.16
                 	           com_led22_data = '-'; //2009.03.16
                 	           com_led23_data = '-'; //2009.03.16
                               }
                        }
                    }
                    if (gus_Sequence_set_data == NO_SET_DATA && gss_Select_dital[P_VOLT_DISPLAY] == false) //2009.02.13
                    {
                 	        com_led21_data = '-';
                 	        com_led22_data = '-';
                 	        com_led23_data = '-';
                    }
                }
            } else {
            	if (guc_Adjust_item_counter == 0 && guc_Select_counter != MODE_DETAILS) //VLT 2008.08.22電圧は必ずトップにくるので特別 2008.08.28	// BP4 Phase6 by @Tny 2009/01/27
            	{
                    if (com_led22_data == 0x20)
                    {
                        com_led22_data = 0x30; //0を表示
                    }
                 	com_led22_data = com_led22_data | (0x80);
            	}
#if 0
            	if (guc_Adjust_item_counter != 0 && guc_Select_counter != MODE_DETAILS) //VLT 2008.08.22電圧は必ずトップにくるので特別 2008.08.28	// BP4 Phase6 by @Tny 2009/01/27
            	{
                	switch (gtt_Dital_attribute[gc_Dc_adjust_p_data[guc_Adjust_item_counter]].uc_Point)
                	{
                    	 case 1:
                        	   com_led21_data = com_led21_data | (0x80); 
                        	   com_led22_data = com_led22_data & (0x7f); 
                           	break;
                    	 case 2:
                        	   com_led21_data = com_led21_data & (0x7f); 
                        	   com_led22_data = com_led22_data | (0x80); 
                           	break;
                	}
            	}
#endif
                //if (guc_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA)
                //if (guc_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == NO_SET_DATA)
                //if (guc_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == NO_SET_DATA || (guc_Sequence_set_data == PULSE_ITEM_SET_DATA && guc_Pulse_item_counter == 1) || ((guc_Method_condition_data == STD_AC_METHOD || guc_Method_condition_data == EXP_AC_METHOD) && guc_Ac_tig_set_counter == 0)) //2009.01.16
                //if (guc_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || guc_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA || (guc_Sequence_set_data == NO_SET_DATA && guc_Ac_tig_set_counter == 0) || (guc_Sequence_set_data == PULSE_ITEM_SET_DATA && guc_Pulse_item_counter == 1)) //2009.01.16
                //if (gus_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == NO_SET_DATA || (gus_Sequence_set_data == PULSE_ITEM_SET_DATA && guc_Pulse_item_counter == 1)) //2009.01.19
                //if (gus_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == NO_SET_DATA || (gus_Sequence_set_data == PULSE_ITEM_SET_DATA && guc_Pulse_item_counter == 1) || puc_Not_volt_display == true) //2009.02.13
                if (gus_Sequence_set_data == INIT_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == CRATER_WELD_CURRENT_SET_DATA || gus_Sequence_set_data == NO_SET_DATA || (gus_Sequence_set_data == PULSE_ITEM_SET_DATA && guc_Pulse_item_counter == 1) || ((gus_Sequence_set_data != PREFLOW_SET_DATA && gus_Sequence_set_data != UPSLOP_SET_DATA && gus_Sequence_set_data != DOWNSLOP_SET_DATA && gus_Sequence_set_data != AFTERFLOW_SET_DATA && gus_Sequence_set_data != PULSE_ITEM_SET_DATA && gus_Sequence_set_data != AC_TIG_ITEM_SET_DATA && gus_Sequence_set_data != MIX_TIG_ITEM_SET_DATA) && puc_Not_volt_display == true)) //2009.02.13	// 2019.05.31
                {
                 	com_led21_data = '-';
                 	com_led22_data = '-';
                 	com_led23_data = '-';
                }
                
                //if (guc_Sequence_set_data == PULSE_ITEM_SET_DATA) //2009.01.19 パルス周波数表示時の小数点の位置の変更
                if (gus_Sequence_set_data == PULSE_ITEM_SET_DATA) //2009.01.19 パルス周波数表示時の小数点の位置の変更
                {
                    //1:パルス電流　2:パルスデューティ 0:パルス周波数
                    if (guc_Pulse_item_counter == PULSE_ITEM_DUTY)
                    {
                        com_led21_data = com_led21_data & (0x7f); 
                        com_led22_data = com_led22_data & (0x7f); 
                        com_led23_data = com_led23_data & (0x7f); 
                        if (com_led22_data == 0x30) //2009.02.12
                        {
                            com_led22_data = 0x20; //空白を表示
                        }
                    }
                    if (guc_Pulse_item_counter == PULSE_ITEM_FREQUENCY)
                    {
                        if (com_led22_data == 0x20) //2009.02.24 2009.03.23
                        {
                            com_led22_data = 0x30; //0を表示
                        }
                        //if (gtt_Internal_pack.Data.In.usPulseFreq > 250)
                        if (gtt_Internal_pack.Data.In.usPulseFreq > 99) //2009.03.02
                        {
                            com_led21_data = com_led21_data & (0x7f); 
                            com_led22_data = com_led22_data & (0x7f); 
                        } else {
                            com_led21_data = com_led21_data & (0x7f); 
                            com_led22_data = com_led22_data | (0x80); 
                        }
                    }
                    if (guc_Pulse_item_counter == PULSE_ITEM_CURRENT)
                    {
                        com_led21_data = com_led21_data & (0x7f); 
                        com_led22_data = com_led22_data & (0x7f); 
                        com_led23_data = com_led23_data & (0x7f); 
                    }
                }

                //if (gus_Sequence_set_data == AC_TIG_ITEM_SET_DATA) //2009.01.19
                if (gus_Sequence_set_data == AC_TIG_ITEM_SET_DATA || gus_Sequence_set_data == MIX_TIG_ITEM_SET_DATA) //2009.01.20
                {
                    com_led21_data = com_led21_data & (0x7f); 
                    com_led22_data = com_led22_data & (0x7f);
                    if (gus_Sequence_set_data == MIX_TIG_ITEM_SET_DATA)
                    {
                        switch (guc_Mix_tig_set_counter)
                        {
                               case 1: //ＭＩＸ周波数選択
                                     if (com_led22_data == 0x20) //2009.02.24 2009.03.23
                                     {
                                         com_led22_data = 0x30; //0を表示
                                     }
                                     com_led21_data = com_led21_data & (0x7f); 
                                     com_led22_data = com_led22_data | (0x80); 
                                   break;
                               case 0: //直流比率選択
                                     com_led21_data = com_led21_data & (0x7f); 
                                     com_led22_data = com_led22_data & (0x7f); 
                                   break;
                               default:
                                   break;
                        }
                    }
                }

                    
            }
            //<><><><><><><><><><><><><><>

            InternalPackRemo.Data.From.uc_Com_7led_data[0] = com_led11_data;
            InternalPackRemo.Data.From.uc_Com_7led_data[1] = com_led12_data;
            InternalPackRemo.Data.From.uc_Com_7led_data[2] = com_led13_data;
            InternalPackRemo.Data.From.uc_Com_7led_data[3] = com_led21_data;
            InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led22_data;//2008.08.28元に戻した。
            InternalPackRemo.Data.From.uc_Com_7led_data[5] = com_led23_data;

            //<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>

            //<><><><><><><><><><><><> ＪＯＧダイアル入力時の表示処理 2007.12.09 <><><><><><><><><><><><>
            if (gtt_Ctrl_flag.Set_screen_on_off == ON)
            {
                if (gtt_Ctrl_flag.Service_man == OFF) //技術・サービスマンメニュー分岐 2008.09.02
                {
                    switch (gtt_Ctrl_counter.uc_User_menu_no)//ユーザー入力部
                    {
                            case 0: //特殊パラメータ入力
                                 nume3_set_class(3,gtt_Ctrl_counter.us_User_parameter_no);

                                 if (gtt_Ctrl_counter.Pass_word_ok != 3 && gtt_Ctrl_flag.Pass_word_err == OFF)
                                 {
                                     if (gtt_Special_menu.ss_User_param[gtt_Ctrl_counter.us_User_parameter_no] < 0)
                                     {
                                         char_set_class(4," -",false,false,false);
                                     }
                                     if (gtt_Special_menu.ss_User_param[gtt_Ctrl_counter.us_User_parameter_no] >= 0)
                                     {
                                         char_set_class(4," +",false,false,false);
                                     }
                                     nume5_set_class(gtt_Special_menu.ss_User_param[gtt_Ctrl_counter.us_User_parameter_no]);
                                 }
                                 if (gtt_Ctrl_counter.Pass_word_ok == 3 && gtt_Ctrl_flag.Pass_word_err == OFF) //2008.09.02
                                 {
                                     char_set_class(4,"  ",false,false,false);
                                     char_set_class(5,"PAS",false,false,false);
                                     char_set_class(6," OK",false,false,false);
                                 }
                                 if (gtt_Ctrl_flag.Pass_word_err == ON) //2008.09.02
                                 {
                                     char_set_class(4,"  ",false,false,false);
                                     char_set_class(5,"RET",false,false,false);
                                     char_set_class(6,"RY ",false,false,false);
                                 }
                                 
                                 break;
                            case 1: //パラメータリセット　０リセット
                                 char_set_class(1,"RES",false,false,false);
                                 char_set_class(2,"  ",false,false,false);
                                 char_set_class(3,"   ",false,false,false);
                                 char_set_class(4,"  ",false,false,false);
                                 if (gtt_Ctrl_flag.Set_key == false)
                                 {
                                     if (gtt_Ctrl_flag.User_all_parameter_reset == true)
                                     {
                                         char_set_class(5,"YES",false,false,false);
                                     } else {
                                         char_set_class(5,"NO ",false,false,false);
                                     }
                                 } else {
                                     if (gtt_Ctrl_flag.User_all_parameter_reset == true)
                                     {
                                         char_set_class(5,"CLR",false,false,false);
                                         if (gtt_Ctrl_flag.Clr_time == OFF)
                                         {
                                             gtt_Ctrl_flag.User_all_parameter_reset_exe = ON; //2008.09.04
                                             gtt_Ctrl_flag.Clr_time = ON;
                                             gtt_Ctrl_counter.uc_Clr_time = CLR_TIME;
                                         } else if (gtt_Ctrl_counter.uc_Clr_time <= 0) {
                                             gtt_Ctrl_flag.Clr_time = OFF;
                                             gtt_Ctrl_flag.User_all_parameter_reset = false;
                                             gtt_Ctrl_flag.Set_key = false;
                                         }
                                     } else {
                                         char_set_class(5,"NO ",false,false,false);
                                         gtt_Ctrl_flag.Clr_time = OFF;
                                         gtt_Ctrl_flag.User_all_parameter_reset = false;
                                         gtt_Ctrl_flag.Set_key = false;
                                     }
                                 }
                                 char_set_class(6,"   ",false,false,false);
                                 break;
                            case 2:
                                 char_set_class(1,"I/F",false,false,false);
                                 char_set_class(4,"--",false,false,false);
//--------- Phase22 by @Tny 2008/10/08 --------
#if true
                                if(gb_IIF_Select){ // IIF接続時のみ対応
#endif
//---------------------------------------------
                                 switch (gtt_Ctrl_counter.uc_Iif_no)
                                 {
                                     case 0: //OUTPUT PORT設定
                                          char_set_class(2,"oT",false,false,false);
                                          nume3_set_class(3,gtt_Ctrl_counter.uc_Out_port_no);
                                          if (gtt_Ctrl_flag.Out_function_set_ready == ON)
                                          {
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 1;    //点滅表示の有り無し
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 10;   //点滅時点灯時間
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 10;   //点滅時消灯時間
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;  //点滅繰り返し回数
                                            if (guc_Out_port[0][gtt_Ctrl_counter.uc_Out_port_no] != gtt_Ctrl_counter.uc_Out_function_no)
                                            {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 4;    //表示するブロック番号 2007.12.14 2008.07.28
                                            } else {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            }
                                            char_set_class(5,gc_Output_function_upper[gtt_Ctrl_counter.uc_Out_function_no],false,false,false);
                                            char_set_class(6,gc_Output_function_lower[gtt_Ctrl_counter.uc_Out_function_no],false,false,false);
                                          } else {
                                            ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            char_set_class(5,gc_Output_function_upper[guc_Out_port[0][gtt_Ctrl_counter.uc_Out_port_no]],false,false,false);
                                            char_set_class(6,gc_Output_function_lower[guc_Out_port[0][gtt_Ctrl_counter.uc_Out_port_no]],false,false,false);
                                          }
                                          break;
                                     case 1: //INPUT PORT設定
                                          char_set_class(2,"In",false,false,false);
                                          nume3_set_class(3,gtt_Ctrl_counter.uc_In_port_no);
                                          if (gtt_Ctrl_flag.In_function_set_ready == ON)
                                          {
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 1;    //点滅表示の有り無し
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 10;   //点滅時点灯時間
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 10;   //点滅時消灯時間
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;  //点滅繰り返し回数
                                            if (guc_In_port[0][gtt_Ctrl_counter.uc_In_port_no] != gtt_Ctrl_counter.uc_In_function_no)
                                            {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 4;    //表示するブロック番号 2007.12.14 2008.07.28
                                            } else {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            }
                                            char_set_class(5,gc_Input_function_upper[gtt_Ctrl_counter.uc_In_function_no],false,false,false);
                                            char_set_class(6,gc_Input_function_lower[gtt_Ctrl_counter.uc_In_function_no],false,false,false);
                                          } else {
                                            ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            char_set_class(5,gc_Input_function_upper[guc_In_port[0][gtt_Ctrl_counter.uc_In_port_no]],false,false,false);
                                            char_set_class(6,gc_Input_function_lower[guc_In_port[0][gtt_Ctrl_counter.uc_In_port_no]],false,false,false);
                                          }
                                          break;
                                     case 2: //ANALOG PORT設定
                                          char_set_class(2,"AG",false,false,false);
                                          nume3_set_class(3,gtt_Ctrl_counter.uc_Analog_port_no);
                                          if (gtt_Ctrl_flag.Analog_function_set_ready == ON)
                                          {
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 1;    //点滅表示の有り無し
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 10;   //点滅時点灯時間
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 10;   //点滅時消灯時間
                        	                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;  //点滅繰り返し回数
                                            if (guc_Analog_port[0][gtt_Ctrl_counter.uc_Analog_port_no] != gtt_Ctrl_counter.uc_Analog_function_no)
                                            {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 4;    //表示するブロック番号 2007.12.14 2008.07.28
                                            } else {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            }
                                            char_set_class(5,gc_Analog_function_upper[gtt_Ctrl_counter.uc_Analog_function_no],false,false,false);
                                            char_set_class(6,gc_Analog_function_lower[gtt_Ctrl_counter.uc_Analog_function_no],false,false,false);
                                          } else {
                                            ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            char_set_class(5,gc_Analog_function_upper[guc_Analog_port[0][gtt_Ctrl_counter.uc_Analog_port_no]],false,false,false);
                                            char_set_class(6,gc_Analog_function_lower[guc_Analog_port[0][gtt_Ctrl_counter.uc_Analog_port_no]],false,false,false);
                                          }
                                          break;
                                 }
//--------- Phase22 by @Tny 2008/10/08 --------
#if true
                                }
                                else{
                                    char_set_class(2,"--",false,false,false);
                                    char_set_class(3,"---",false,false,false);
                                    char_set_class(5,"---",false,false,false);
                                    char_set_class(6,"---",false,false,false);
                                }
#endif
//---------------------------------------------
                                 break;
                            case 3:
                                 char_set_class(1,"TIM",false,false,false);
                                 char_set_class(2,"  ",false,false,false);
                                 char_set_class(3,gc_Calender_name[gtt_Ctrl_counter.uc_Calender_no],false,false,false);
                                 char_set_class(5,"   ",false,false,false);
                                 char_set_class(6,"   ",false,false,false);
                        	     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 1;    //点滅表示の有り無し
                        	     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 10;   //点滅時点灯時間
                        	     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 10;   //点滅時消灯時間
                        	     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;  //点滅繰り返し回数
                                 switch (gtt_Ctrl_counter.uc_Calender_no)
                                 {
                                     case 0: //年設定
                                          if (gtt_Ctrl_flag.Calender_set_ready == ON)
                                          {
                                            if (gtt_Calender.uc_Year_data != gtt_Ctrl_counter.uc_Year_set_data)
                                            {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 4;    //表示するブロック番号 2007.12.14 2008.07.28
                                            } else {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            }
                                            nume2_set_class(4,gtt_Ctrl_counter.uc_Year_set_data);
                                          } else {
                                            ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            nume2_set_class(4,gtt_Calender.uc_Year_data);
                                          }
                                          break;
                                     case 1: //月設定
                                          if (gtt_Ctrl_flag.Calender_set_ready == ON)
                                          {
                                            if (gtt_Calender.uc_Month_data != gtt_Ctrl_counter.uc_Month_set_data)
                                            {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 4;    //表示するブロック番号 2007.12.14 2008.07.28
                                            } else {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            }
                                            nume2_set_class(4,gtt_Ctrl_counter.uc_Month_set_data);
                                          } else {
                                            ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            nume2_set_class(4,gtt_Calender.uc_Month_data);
                                          }
                                          break;
                                     case 2: //日設定
                                          if (gtt_Ctrl_flag.Calender_set_ready == ON)
                                          {
                                            if (gtt_Calender.uc_Day_data != gtt_Ctrl_counter.uc_Day_set_data)
                                            {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 4;    //表示するブロック番号 2007.12.14 2008.07.28
                                            } else {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            }
                                            nume2_set_class(4,gtt_Ctrl_counter.uc_Day_set_data);
                                          } else {
                                            ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            nume2_set_class(4,gtt_Calender.uc_Day_data);
                                          }
                                          break;
                                     case 3: //時設定
                                          if (gtt_Ctrl_flag.Calender_set_ready == ON)
                                          {
                                            if (gtt_Calender.uc_Hour_data != gtt_Ctrl_counter.uc_Hour_set_data)
                                            {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 4;    //表示するブロック番号 2007.12.14 2008.07.28
                                            } else {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            }
                                            nume2_set_class(4,gtt_Ctrl_counter.uc_Hour_set_data);
                                          } else {
                                            ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            nume2_set_class(4,gtt_Calender.uc_Hour_data);
                                          }
                                          break;
                                     case 4: //分設定
                                          if (gtt_Ctrl_flag.Calender_set_ready == ON)
                                          {
                                            if (gtt_Calender.uc_Mint_data != gtt_Ctrl_counter.uc_Mint_set_data)
                                            {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 4;    //表示するブロック番号 2007.12.14 2008.07.28
                                            } else {
                                                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            }
                                            nume2_set_class(4,gtt_Ctrl_counter.uc_Mint_set_data);
                                          } else {
                                            ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                            nume2_set_class(4,gtt_Calender.uc_Mint_data);
                                          }
                                          break;
                                 }
                                 break;
                            case 4:
//------ Phase8 by @Tny 2008/09/11 ------
#if true
                                 char_set_class(1,"ECK",false,false,false);
                                 if(gtt_Error_History.Start_record){ // 記録はされている？
                                    signed short  Index;
                                    if(gtt_Error_History.Full_history_rec == false){
#if false
                                        Index = (gtt_Ctrl_counter.uc_Error_history_no - 1);
#else
                                        Index = (gtt_Error_History.History_rec_index - gtt_Ctrl_counter.uc_Error_history_no);
#endif
                                    }
                                    else{
                                        unsigned char   i;
#if false
                                        Index = ((signed short)gtt_Error_History.History_rec_index - 1);
                                        for(i=0;i<gtt_Ctrl_counter.uc_Error_history_no;i++){
                                            if(++Index >= MAX_ERROR_INFOMATION) Index = 0;
                                        }
#else
                                        Index = ((signed short)gtt_Error_History.History_rec_index - 1);
                                        for(i=0;i<((MAX_ERROR_INFOMATION + 1) - gtt_Ctrl_counter.uc_Error_history_no);i++){
                                            if(++Index >= MAX_ERROR_INFOMATION) Index = 0;
                                        }
#endif
                                    }
                                    nume2_set_class(2,gtt_Ctrl_counter.uc_Error_history_no);        // エラー情報ページ
                                    ComuniPackRemo.Data.From.uc_Com_16led_data[5] = 'E';            // エラー番号の識別文字
                                    nume3_set_class_b(3,gtt_Error_History.Info[Index].Error_No);    // エラー番号
                                    if(gtt_Ctrl_counter.b_Error_information){
                                        ComuniPackRemo.Data.From.uc_Com_16led_data[10] = 'H';       // 
                                        ComuniPackRemo.Data.From.uc_Com_16led_data[13] = 'm';       // 
                                        nume2_set_class(4,gtt_Error_History.Info[Index].Hour);      // エラー発生日時（時）
                                        nume3_set_class_b(5,gtt_Error_History.Info[Index].Minute);  // エラー発生日時（分）
                                        nume3_set_class_b(6,gtt_Error_History.Info[Index].Second);  // エラー発生日時（秒）
                                    }
                                    else{
                                        ComuniPackRemo.Data.From.uc_Com_16led_data[10] = '/';       // 
                                        ComuniPackRemo.Data.From.uc_Com_16led_data[13] = '/';       // 
                                        nume2_set_class(4,gtt_Error_History.Info[Index].Year);      // エラー発生日時（年）
                                        nume3_set_class_b(5,gtt_Error_History.Info[Index].Month);   // エラー発生日時（月）
                                        nume3_set_class_b(6,gtt_Error_History.Info[Index].Day);     // エラー発生日時（日）
                                    }
                                 }
                                 else{
                                    char_set_class(2,"--",false,false,false);
                                    char_set_class(3,"---",false,false,false);
                                    char_set_class(4,"--",false,false,false);
                                    char_set_class(5,"---",false,false,false);
                                    char_set_class(6,"---",false,false,false);
                                 }
#endif
//---------------------------------------------------------------------
                                 break;
                            case 5: //2008.08.29 Phase2 2008/09/04 @Tny
#if 0 //2009.02.13
                                 char_set_class(1,"MRY",false,false,false);
                                 nume2_set_class(2,gtt_Ctrl_counter.Memory_copy_area_no);
                                 if (gtt_Ctrl_flag.Memory_copy_vector == true)
                                 {
                                     char_set_class(3,"CTL",false,false,false);
                                     char_set_class(4,"->",false,false,false);
                                     char_set_class(5,"WLD",false,false,false);
                                 } else {
                                     char_set_class(3,"WLD",false,false,false);
                                     char_set_class(4,"->",false,false,false);
                                     char_set_class(5,"CTL",false,false,false);
                                 }
#endif
                                 break;
                            case 6: //突き出し長設定 2008.11.10
#if 0
                                 char_set_class(1,"EXT",false,false,false);
                                 char_set_class(2,"  ",false,false,false);
                                 char_set_class(3,"   ",false,false,false);
                                 char_set_class(4,"  ",false,false,false);
                        	     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 1;    //点滅表示の有り無し
                        	     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 10;   //点滅時点灯時間
                        	     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 10;   //点滅時消灯時間
                        	     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;  //点滅繰り返し回数
                                 if (gtt_Ctrl_flag.Ext_condition_set_ready == ON)
                                 {
                                     if (guc_Ext_condition_counter != gtt_Ctrl_counter.uc_Ext_condition_data)
                                     {
                                         ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 5;    //表示するブロック番号 2007.12.14 2008.07.28
                                     } else {
                                         ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                     }
                                     switch (gtt_Ctrl_counter.uc_Ext_condition_data)
                                     {
                                         case 1:
                                              char_set_class(5,"HND",false,false,false);
                                              char_set_class(6,"   ",false,false,false);
                                              break;
                                         case 2:
                                              char_set_class(5," 10",false,false,false);
                                              char_set_class(6,"mm ",false,false,false);
                                              break;
                                         case 3:
                                              char_set_class(5," 12",false,false,false);
                                              char_set_class(6,"mm ",false,false,false);
                                              break;
                                         case 4:
                                              char_set_class(5," 15",false,false,false);
                                              char_set_class(6,"mm ",false,false,false);
                                              break;
                                         case 5:
                                              char_set_class(5," 20",false,false,false);
                                              char_set_class(6,"mm ",false,false,false);
                                              break;
                                         case 6:
                                              char_set_class(5," 25",false,false,false);
                                              char_set_class(6,"mm ",false,false,false);
                                              break;
                                         case 7:
                                              char_set_class(5," 30",false,false,false);
                                              char_set_class(6,"mm ",false,false,false);
                                              break;
                                         default:
                                              char_set_class(5,"HND",false,false,false);
                                              char_set_class(6,"   ",false,false,false);
                                              break;
                                     }
                                 } else {
                                     if (guc_Remo_table_check_flag == true)
                                     {
                                         ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                         switch (guc_Ext_condition_counter)
                                         {
                                             case 1:
                                                  char_set_class(5,"HND",false,false,false);
                                                  char_set_class(6,"   ",false,false,false);
                                                  break;
                                             case 2:
                                                  char_set_class(5," 10",false,false,false);
                                                  char_set_class(6,"mm ",false,false,false);
                                                  break;
                                             case 3:
                                                  char_set_class(5," 12",false,false,false);
                                                  char_set_class(6,"mm ",false,false,false);
                                                  break;
                                             case 4:
                                                  char_set_class(5," 15",false,false,false);
                                                  char_set_class(6,"mm ",false,false,false);
                                                  break;
                                             case 5:
                                                  char_set_class(5," 20",false,false,false);
                                                  char_set_class(6,"mm ",false,false,false);
                                                  break;
                                             case 6:
                                                  char_set_class(5," 25",false,false,false);
                                                  char_set_class(6,"mm ",false,false,false);
                                                  break;
                                             case 7:
                                                  char_set_class(5," 30",false,false,false);
                                                  char_set_class(6,"mm ",false,false,false);
                                                  break;
                                             default:
                                                  char_set_class(5,"HND",false,false,false);
                                                  char_set_class(6,"   ",false,false,false);
                                                  break;
                                         }
                                     } else {
                                         ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                         char_set_class(5,"ERR",false,false,false);
                                         char_set_class(6,"OR ",false,false,false);
                                     }
                                 }
#endif
                                 break;
                            default:
                                 char_set_class(1,"PRM",false,false,false);
                                 break;
                    }
                } else {
                    switch (gtt_Ctrl_counter.uc_Service_menu_no) //技術・サービスマン入力部
                    {
                            case 0: //サービスマンデータ入力
                                 nume3_set_class(3,gtt_Ctrl_counter.us_Service_data_no);
                                 if (gtt_Special_menu.ss_Service_data[gtt_Ctrl_counter.us_Service_data_no] < 0)
                                 {
                                     char_set_class(4," -",false,false,false);
                                 }
                                 if (gtt_Special_menu.ss_Service_data[gtt_Ctrl_counter.us_Service_data_no] >= 0)
                                 {
                                     char_set_class(4," +",false,false,false);
                                 }
                                 nume5_set_class(gtt_Special_menu.ss_Service_data[gtt_Ctrl_counter.us_Service_data_no]);
                                 break;
                            case 1: //パラメータリセット　０リセット
                                 char_set_class(1,"RES",false,false,false);
                                 char_set_class(2,"--",false,false,false);
                                 nume3_set_class(3,gtt_Ctrl_counter.uc_Service_reset_no);
                                 char_set_class(4,"  ",false,false,false);
                                 if (gtt_Ctrl_flag.Set_key == false)
                                 {
                                     switch (gtt_Ctrl_counter.uc_Service_reset_no)
                                     {
                                          case 0:
                                               if (gtt_Ctrl_flag.Service_reset1 == true)
                                               {
                                                   char_set_class(5,"YES",false,false,false);
                                               } else {
                                                   char_set_class(5,"NO ",false,false,false);
                                               }
                                               break;
                                          case 1:
                                               if (gtt_Ctrl_flag.Service_reset2 == true)
                                               {
                                                   char_set_class(5,"YES",false,false,false);
                                               } else {
                                                   char_set_class(5,"NO ",false,false,false);
                                               }
                                               break;
                                     }
                                 } else {
                                     if (gtt_Ctrl_flag.Service_reset1 == true || gtt_Ctrl_flag.Service_reset2 == true)
                                     {
                                         char_set_class(5,"CLR",false,false,false);
                                         if (gtt_Ctrl_flag.Clr_time == OFF)
                                         {
                                             if (gtt_Ctrl_flag.Service_reset1 == true) //2008.09.04
                                             {
                                                 gtt_Ctrl_flag.Service_reset1_exe = ON;
                                             }
                                             if (gtt_Ctrl_flag.Service_reset2 == true) //2008.09.04
                                             {
                                                 gtt_Ctrl_flag.Service_reset2_exe = ON;
                                             }
                                             gtt_Ctrl_flag.Clr_time = ON;
                                             gtt_Ctrl_counter.uc_Clr_time = CLR_TIME;
                                         } else if (gtt_Ctrl_counter.uc_Clr_time <= 0) {
                                             gtt_Ctrl_flag.Clr_time = OFF;
                                             gtt_Ctrl_flag.Service_reset1 = false;
                                             gtt_Ctrl_flag.Service_reset2 = false;
                                             gtt_Ctrl_flag.Set_key = false;
                                         }
                                     } else {
                                         char_set_class(5,"NO ",false,false,false);
                                         gtt_Ctrl_flag.Clr_time = OFF;
                                         gtt_Ctrl_flag.Service_reset1 = false;
                                         gtt_Ctrl_flag.Service_reset2 = false;
                                         gtt_Ctrl_flag.Set_key = false;
                                     }
                                 }
                                 char_set_class(6,"   ",false,false,false);
                                 break;

                    }

                }
            }

//--------------------------------------------
            if (guc_Select_counter == MODE_DETAILS) //詳細　Ｐ表示 2008.08.07	// BP4 Phase6 by @Tny 2009/01/27
            {
//--------------------------------------------------------------------
//BP4 Phase13 by @Tny 2009.02.23	BP4 Phase14 by @Tny 2009.02.24
				if((gb_ServiceMenu)||(gb_RescueMenu)){
					unsigned short	i;
					for(i=0;i<6;i++){
						InternalPackRemo.Data.From.uc_Com_7led_data[i] = ' ';
					}
					if(gb_ServiceMenu){		// サービスマンメニュー要求フラグ
						if(gsc_Select_dital_counter == 0){
							if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
								gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
								if(gus_MessageTimer <= 0){	// メッセージ表示時間が経過?
									StringInput_Disp(true, "ﾊﾟｽﾜｰﾄﾞ ?", gt_SelectCharacter, 16);	// 文字入力処理（表示部）
								}
								else{
									all_char_lcd1_set_class("ﾊﾟｽﾜｰﾄﾞｶﾞ ﾁｶﾞｲﾏｽ" , 0x0000);
									all_char_lcd2_set_class(" ｻｲﾆｭｳﾘｮｸｼﾃｸﾀﾞｻｲ" , 0x0000);
				    	            if(ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no != 0){
				        	        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 0;       //点滅対象行番号
										ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0;		//	0000 00000 0000 000b
				                		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;       //点滅時点灯時間
				                		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;       //点滅時消灯時間
					                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;     //点滅繰り返し回数
										gb_RemCom_0x36	= true;
									}
								}
							}
						}
						else{
							if(gus_MessageTimer <= 0){	// メッセージ表示時間が経過?
					            InternalPackRemo.Data.From.uc_Com_7led_data[0] = '0';
	            			    com_led12_data = (unsigned char)(gsc_Select_dital_counter / 10 + 0x30);
					            InternalPackRemo.Data.From.uc_Com_7led_data[1] = com_led12_data;
	            			    InternalPackRemo.Data.From.uc_Com_7led_data[2] = (unsigned char)(gsc_Select_dital_counter % 10 + 0x30);
								all_char_lcd1_set_class(guc_ServiceMenu[gsc_Select_dital_counter] , 0x0000);
								if(guc_Menu_Hierarchy == 0){ // 詳細メニュー設定階層フラグが詳細設定項目の選択（＝０）？   【直値指定注意！！】
									all_char_lcd2_set_class("                " , 0x0000);
								}
								else{
									com_led13_dital_data = ' '; //2009.04.03
									//if((gsc_Select_dital_counter != S_GAS_LOW_DETECT)&&(gsc_Select_dital_counter != S_CURRENT_ADJUST)){
									//if((gsc_Select_dital_counter != S_CURRENT_ADJUST)){
									if((gsc_Select_dital_counter != S_CURRENT_ADJUST)&&(gsc_Select_dital_counter != S_ERROR_HIS_CLEAR)){	// BP4 by @Tny 2009.04.08
										if(gtt_Service_attribute[gsc_Select_dital_counter].uc_Point == 0){
											if(gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter] < 0 ){
												//com_led21_dital_data = '-';
												com_led13_dital_data = '-'; //2009.04.03
												pss_Select_dital_data_work = ~gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter];
												pss_Select_dital_data_work++;
											}
											else{
												//com_led21_dital_data = ' ';
												com_led13_dital_data = ' '; //2009.04.03
												pss_Select_dital_data_work = gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter];
											}
											led21_data = (unsigned char)(pss_Select_dital_data_work / 100);
											if(led21_data == 0){
												//if(com_led21_dital_data != '-') com_led21_dital_data = 0x20;
												com_led21_dital_data = 0x20; //2009.04.03
											}
											else{
												com_led21_dital_data = led21_data + 0x30;
											}
											led22_data = (unsigned char)((pss_Select_dital_data_work - led21_data * 100)  / 10);
											if((led21_data == 0) && (led22_data == 0)){
												com_led22_dital_data = 0x20;
											}
											else{
												com_led22_dital_data = led22_data + 0x30;
											}
											led23_data = (unsigned char)(pss_Select_dital_data_work - (led22_data * 10) - (led21_data * 100));
											com_led23_dital_data = led23_data + 0x30;
										} 
										if(gtt_Service_attribute[gsc_Select_dital_counter].uc_Point == 1){
											pss_Select_dital_data_work = gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter];
											led21_data = (unsigned char)(pss_Select_dital_data_work / 100);
											com_led21_dital_data = led21_data + 0x30;
											led22_data = (unsigned char)((pss_Select_dital_data_work - led21_data * 100)  / 10);
											com_led22_dital_data = led22_data + 0x30;
											led23_data = (unsigned char)(pss_Select_dital_data_work - (led22_data * 10) - (led21_data * 100));
											com_led23_dital_data = led23_data + 0x30;
										}
										else if(gtt_Service_attribute[gsc_Select_dital_counter].uc_Point == 2){
											if(gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter] < 0 ){
												//com_led21_dital_data = '-';
												com_led13_dital_data = '-'; //2009.04.03
												pss_Select_dital_data_work = ~gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter];
												pss_Select_dital_data_work++;
											}
											else{
												//com_led21_dital_data = ' ';
												com_led13_dital_data = ' '; //2009.04.03
												pss_Select_dital_data_work = gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter];
											}
						                	led21_data = (unsigned char)(pss_Select_dital_data_work / 100);
											if(led21_data == 0){
												//if(com_led21_dital_data != '-') com_led21_dital_data = 0x20;
												com_led21_dital_data = 0x20; //2009.04.03
											}
											else{
												com_led21_dital_data = led21_data + 0x30;
											}
											led22_data = (unsigned char)((pss_Select_dital_data_work - led21_data * 100)  / 10);
											com_led22_dital_data = led22_data + 0x30;
											led23_data = (unsigned char)(pss_Select_dital_data_work - (led22_data * 10) - (led21_data * 100));
											com_led23_dital_data = led23_data + 0x30;
										}
										InternalPackRemo.Data.From.uc_Com_7led_data[0] = ' '; //2009.04.03
										InternalPackRemo.Data.From.uc_Com_7led_data[1] = ' '; //2009.04.03
										InternalPackRemo.Data.From.uc_Com_7led_data[2] = com_led13_dital_data; //2009.04.03
										InternalPackRemo.Data.From.uc_Com_7led_data[3] = com_led21_dital_data;
										InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led22_dital_data;
										InternalPackRemo.Data.From.uc_Com_7led_data[5] = com_led23_dital_data;
										if(gtt_Service_attribute[gsc_Select_dital_counter].uc_Point == 1){
											InternalPackRemo.Data.From.uc_Com_7led_data[3] = com_led21_dital_data | 0x80; //LED4に小数点追加
										}
										else if(gtt_Service_attribute[gsc_Select_dital_counter].uc_Point == 2){
											InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led22_dital_data | 0x80; //LED5に小数点追加
										}
									}
									if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
										gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
										//if((gsc_Select_dital_counter != S_GAS_LOW_DETECT)&&(gsc_Select_dital_counter != S_CURRENT_ADJUST)){
										//if((gsc_Select_dital_counter != S_CURRENT_ADJUST)){ //2009.04.03
										if((gsc_Select_dital_counter != S_CURRENT_ADJUST)&&(gsc_Select_dital_counter != S_ERROR_HIS_CLEAR)){	// BP4 by @Tny 2009.04.08
							            	all_char_lcd2_set_class(guc_ServiceMenu2[gsc_Select_dital_counter][0] , 0x0000);
											if(gtt_Service_attribute[gsc_Select_dital_counter].uc_Point == 0){
											    if(gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter] < 0 ){
												   ComuniPackRemo.Data.From.uc_Com_lcd_data2[4] = '-';//2009.04.03
                                                } else {
												   ComuniPackRemo.Data.From.uc_Com_lcd_data2[4] = ' ';//2009.04.03
                                                }
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led21_dital_data;
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
											}
											else if(gtt_Service_attribute[gsc_Select_dital_counter].uc_Point == 1){
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[5] = com_led21_dital_data;
											    if(gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter] < 0 ){
												   ComuniPackRemo.Data.From.uc_Com_lcd_data2[4] = '-';//2009.04.03
                                                } else {
												   ComuniPackRemo.Data.From.uc_Com_lcd_data2[4] = ' ';//2009.04.03
                                                }
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = '.';
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
											}
											else if(gtt_Service_attribute[gsc_Select_dital_counter].uc_Point == 2){
											    if(gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter] < 0 ){
												   ComuniPackRemo.Data.From.uc_Com_lcd_data2[4] = '-';//2009.04.03
                                                } else {
												   ComuniPackRemo.Data.From.uc_Com_lcd_data2[4] = ' ';//2009.04.03
                                                }
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[5] = com_led21_dital_data;
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led22_dital_data;
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = '.';
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
											}
										}
										else{
							            	all_char_lcd2_set_class(guc_ServiceMenu2[gsc_Select_dital_counter][gtt_Special_menu.ss_Service_data[gsc_Select_dital_counter]] , 0x0000);
										}
									}
								}
							}
							else{
//----------------------------------------------------------------------------------------------------------------
// BP4 by @Tny 2009.04.08
								if(gsc_Select_dital_counter == S_ERROR_HIS_CLEAR){	// エラー履歴のクリア
									all_char_lcd1_set_class(" ｴﾗｰﾘﾚｷ ﾉ ｸﾘｱ ｦ " , 0x0000);
									all_char_lcd2_set_class("  ｼﾞｯｺｳｼﾏｼﾀ     " , 0x0000);
								}
								else{
									all_char_lcd1_set_class("ﾊﾟｽﾜｰﾄﾞｶﾞ ﾀﾀﾞｼｸ " , 0x0000);
									all_char_lcd2_set_class("    ﾆｭｳﾘｮｸｻﾚﾏｼﾀ " , 0x0000);
								}
//----------------------------------------------------------------------------------------------------------------
							}
			                if(ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no != 0){
			                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 0;       //点滅対象行番号
								ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0;		//	0000 00000 0000 000b
			                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;       //点滅時点灯時間
			                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;       //点滅時消灯時間
			                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;     //点滅繰り返し回数
								gb_RemCom_0x36	= true;
							}
						}
					}
					else if(gb_RescueMenu){	// レスキュー処理要求フラグ
//--------------------------------------------------------------------
//BP4 Phase16 by @Tny 2009.03.11
						if(gb_RamAllClear == false){ // オールクリアは実行されていない？
							if(gsc_Select_dital_counter == 0){
								if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
									gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
									if((gb_JogLock == false)&&(gus_MessageTimer <= 0)){	// メッセージ表示時間が経過? & ＪＯＧ決定キー無効化フラグ：ＪＯＧ決定キーは有効？
										//StringInput_Disp(true, "ﾊﾟｽﾜｰﾄﾞ ?", gt_SelectCharacter, 16);	// 文字入力処理（表示部）
									}
									else{
										if(gb_RescueOpeningDisp == false){	// レスキュー・メニューのオープニング画面の表示ではない？
											all_char_lcd1_set_class("ﾊﾟｽﾜｰﾄﾞｶﾞ ﾁｶﾞｲﾏｽ" , 0x0000);
											all_char_lcd2_set_class(" ｻｲﾆｭｳﾘｮｸｼﾃｸﾀﾞｻｲ" , 0x0000);
										}
										else{
											all_char_lcd1_set_class(" BP4 ﾚｽｷｭｰ ﾒﾆｭｰ " , 0x0000);
											//all_char_lcd2_set_class("                " , 0x0000);
											all_char_lcd2_set_class("       ｵｼﾃ ｶｲｼ  " , 0x0000); //2009.04.06
										}
					    	            if(ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no != 0){
					        	        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 0;       //点滅対象行番号
											ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0;		//	0000 00000 0000 000b
					                		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;       //点滅時点灯時間
					                		ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;       //点滅時消灯時間
						                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;     //点滅繰り返し回数
											gb_RemCom_0x36	= true;
										}
									}
								}
							}
							else{
								if(guc_Menu_Hierarchy == 0){ // 詳細メニュー設定階層フラグが詳細設定項目の選択（＝０）？   【直値指定注意！！】
									if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
										gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
										if(gus_MessageTimer <= 0){	// メッセージ表示時間が経過?
											all_char_lcd1_set_class(guc_RescueMenu[gsc_Select_dital_counter] , 0x0000);
											all_char_lcd2_set_class("                " , 0x0000);
										}
										else{
//-------------------------------------------------------------------------------
// BP4 by @Tny 2009.04.08
											if(gsc_Select_dital_counter == 2){	// エラー履歴のクリア実行メッセージ待ち？
												//all_char_lcd1_set_class(" ｴﾗｰﾘﾚｷ ﾉ ｸﾘｱ ｦ " , 0x0000);
												//all_char_lcd2_set_class("  ｼﾞｯｺｳｼﾏｼﾀ     " , 0x0000);
												if(gtt_Special_menu.ss_Rescue_data[R_REC_LOCK] != 0){
													all_char_lcd1_set_class(" ﾒﾓﾘｷｵｸ ﾛｯｸ ｦ   " , 0x0000);
													all_char_lcd2_set_class("  ｼﾞｯｺｳｼﾏｼﾀ     " , 0x0000);
												}
												else{
													all_char_lcd1_set_class(" ﾒﾓﾘｷｵｸ ﾛｯｸ ｦ   " , 0x0000);
													all_char_lcd2_set_class("  ｶｲｼﾞｮｼﾏｼﾀ     " , 0x0000);
												}
											}
											else{
												//all_char_lcd1_set_class("ﾊﾟｽﾜｰﾄﾞｶﾞ ﾀﾀﾞｼｸ " , 0x0000); 2009.04.06
												//all_char_lcd2_set_class("    ﾆｭｳﾘｮｸｻﾚﾏｼﾀ " , 0x0000); 2009.04.06
												all_char_lcd1_set_class(" BP4 ﾚｽｷｭｰ ﾒﾆｭｰ " , 0x0000);
												all_char_lcd2_set_class("                " , 0x0000);
											}
//-------------------------------------------------------------------------------
							                if(ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no != 0){
							                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 0;       //点滅対象行番号
												ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0;		//	0000 00000 0000 000b
							                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;       //点滅時点灯時間
							                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;       //点滅時消灯時間
							                	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;     //点滅繰り返し回数
												gb_RemCom_0x36	= true;
											}
										}
									}
								}
								else{
									if(gsc_Select_dital_counter == 1){	// エラー履歴
										if(gtt_Error_History.Start_record){ // 記録はされている？
											signed short  Index;

											if(gtt_Error_History.Full_history_rec == false){
												Index = (gtt_Error_History.History_rec_index - gtt_Ctrl_counter.uc_Error_history_no);
											}
											else{
												unsigned char   i;
												Index = ((signed short)gtt_Error_History.History_rec_index - 1);
												for(i=0;i<((MAX_ERROR_INFOMATION + 1) - gtt_Ctrl_counter.uc_Error_history_no);i++){
													if(++Index >= MAX_ERROR_INFOMATION) Index = 0;
												}
											}
											// エラー情報ページ
											InternalPackRemo.Data.From.uc_Com_7led_data[0] = '0';
											com_led12_data = (unsigned char)(gtt_Ctrl_counter.uc_Error_history_no / 10 + 0x30);
											InternalPackRemo.Data.From.uc_Com_7led_data[1] = com_led12_data;
											InternalPackRemo.Data.From.uc_Com_7led_data[2] = (unsigned char)(gtt_Ctrl_counter.uc_Error_history_no % 10 + 0x30);
											// エラー番号
											InternalPackRemo.Data.From.uc_Com_7led_data[3] = 'E';
											com_led12_data = (unsigned char)(gtt_Error_History.Info[Index].Error_No / 10 + 0x30);
											InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led12_data;
											InternalPackRemo.Data.From.uc_Com_7led_data[5] = (unsigned char)(gtt_Error_History.Info[Index].Error_No % 10 + 0x30);
											if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
												gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
												// エラー内容
												all_char_lcd1_set_class((char *)guc_Error_Display[gtt_Error_History.Info[Index].Error_No], 0x0000);
												// エラー発生時刻
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 0]  = 0x27;	// ← 「'」
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 1]  = ('0' + (gtt_Error_History.Info[Index].Year / 10));		// エラー発生日時（年）
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 2]  = ('0' + (gtt_Error_History.Info[Index].Year % 10));
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 3]  = '/';
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 4]  = ('0' + (gtt_Error_History.Info[Index].Month / 10));	// エラー発生日時（月）
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 5]  = ('0' + (gtt_Error_History.Info[Index].Month % 10));
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 6]  = '/';
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 7]  = ('0' + (gtt_Error_History.Info[Index].Day / 10));		// エラー発生日時（日）
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 8]  = ('0' + (gtt_Error_History.Info[Index].Day % 10));
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 9]  = ' ';
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[10]  = ('0' + (gtt_Error_History.Info[Index].Hour / 10));		// エラー発生日時（時）
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[11]  = ('0' + (gtt_Error_History.Info[Index].Hour % 10));
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[12]  = ':';
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[13]  = ('0' + (gtt_Error_History.Info[Index].Minute / 10));	// エラー発生日時（分）
												ComuniPackRemo.Data.From.uc_Com_lcd_data2[14]  = ('0' + (gtt_Error_History.Info[Index].Minute % 10));
//												nume3_set_class_b(6,gtt_Error_History.Info[Index].Second);  // エラー発生日時（秒）
											}
										}
										else{
											if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
												gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
												all_char_lcd1_set_class(" ｴﾗｰ ﾊ          " , 0x0000);
												all_char_lcd2_set_class("  ｷﾛｸ ｻﾚﾃｲﾏｾﾝ   " , 0x0000);
											}
										}
									}
									else{
										if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
											gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
						            		all_char_lcd2_set_class(guc_RescueMenu2[gsc_Select_dital_counter][gtt_Special_menu.ss_Rescue_data[gsc_Select_dital_counter]] , 0x0000);
										}
									}
								}
							}
						}
						else{
							if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
								gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
								all_char_lcd1_set_class(" ｵｰﾙｸﾘｱ ｼﾞｯｺｳ   " , 0x0000);
								all_char_lcd2_set_class("  ｻｲｷﾄﾞｳｼﾃｸﾀﾞｻｲ " , 0x0000);
							}
						}
//--------------------------------------------------------------------
					}
				}
				else{
//--------------------------------------------------------------------
//-----------------------------------------------------------------------------
// BP4 Phase5 by @Tny 2009.01.21	(Debug)
#if false
				if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ
					gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
					StringInput_Disp(false, "ﾓｼﾞﾆｭｳﾘｮｸ", gt_SelectCharacter, 16);	// 文字入力処理（表示部）
					//StringInput_Disp(true, "ﾓｼﾞﾆｭｳﾘｮｸ", gt_SelectCharacter, 16);	// 文字入力処理（表示部）パスワード入力
				}
#else
//				if(gsc_Select_dital_counter != P_WELD_NAME){	// <IIF NEW>
				if((gsc_Select_dital_counter != P_WELD_NAME)&&(gsc_Select_dital_counter != P_IIF_SELECT)){ // << IIF NEW >> 2009.11.26 @Tny
	                all_char_lcd1_set_class(guc_Dital_code[gsc_Select_dital_counter] , gus_Point_code[gsc_Select_dital_counter]); // BP3 Phase2 @Tny 2009.01.13
// BP4 Phase7 by @Tny           InternalPackRemo.Data.From.uc_Com_7led_data[0] = 'P';	// 2009-02-13
	                InternalPackRemo.Data.From.uc_Com_7led_data[0] = '0';	// BP4 Phase7 by @Tny 2009-02-13
	                com_led12_data = (unsigned char)(gsc_Select_dital_counter + 1) / 10;	// BP4 Phase3  @Tny 2009.01.13
	                InternalPackRemo.Data.From.uc_Com_7led_data[1] = com_led12_data;
	                // InternalPackRemo.Data.From.uc_Com_7led_data[2] = (unsigned char)gsc_Select_dital_counter - com_led12_data * 10;
	                InternalPackRemo.Data.From.uc_Com_7led_data[2] = (unsigned char)((gsc_Select_dital_counter + 1) % 10);	// BP4 Phase3  @Tny 2009.01.13
	                char_set_class(7,gc_Dital_unit[gsc_Select_dital_counter],false,false,false); //2008.08.27
					// BP4 Phase4 by @Tny 2009.01.15
					// 詳細メニュー設定階層フラグが詳細設定項目の選択（＝０）ではない？   【直値指定注意！！】
					// 表示保持時間の設定？
					// 現在時刻の設定？
					// アークドライブの設定？
                	// エキスパートモード実験用 2009.02.13
					// ＬＣＤコントラスト値対応 BP4 Phase9 by @Tny 2009.02.16
					// コントローラロック対応（実験用） BP4 Phase9 by @Tny 2009.02.17
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE))){
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING))){ //2009.02.13 エキスパートモード実験用
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING))){ //2009.02.13 エキスパートモード実験用
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK))){ //2009.02.13 エキスパートモード実験用	コントローラロック対応 BP4 Phase9 by @Tny 2009.02.17
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME))){ //2009.02.13 エキスパートモード実験用	コントローラロック対応 BP4 Phase9 by @Tny 2009.02.17	2010.01.08 マスク時間追加
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT))){ //2009.02.13 エキスパートモード実験用	コントローラロック対応 BP4 Phase9 by @Tny 2009.02.17	2010.01.08 マスク時間追加	出力制限機能追加 2010.08.08 by @Tny
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE))){ //2009.02.13 エキスパートモード実験用	コントローラロック対応 BP4 Phase9 by @Tny 2009.02.17	2010.01.08 マスク時間追加	出力制限機能追加 2010.08.08 by @Tny		マイルドパルス設定機能追加 2010.08.10 by @Tny
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_ARC_ASSIST)||(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE))){ //2009.02.13 エキスパートモード実験用	コントローラロック対応 BP4 Phase9 by @Tny 2009.02.17	2010.01.08 マスク時間追加	出力制限機能追加 2010.08.08 by @Tny		マイルドパルス設定機能追加 2010.08.10 by @Tny アークアシスト追加2010.02.26
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_ARC_ASSIST)||(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE)||(gsc_Select_dital_counter == P_SOFT_START_TIME))){ //2011.10.01
                	if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_ARC_ASSIST)||(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE)||(gsc_Select_dital_counter == P_SOFT_START_TIME))){ //2011.10.03
						if(gsc_Select_dital_counter == P_NOW_DATE_TIME){
							if(guc_Menu_Hierarchy == 2){
								unsigned char	Data;
								switch(gss_Select_dital[P_NOW_DATE_TIME]){
									case 0:{Data = gtt_Ctrl_counter.uc_Year_set_data;	break;}
									case 1:{Data = gtt_Ctrl_counter.uc_Month_set_data;	break;}
									case 2:{Data = gtt_Ctrl_counter.uc_Day_set_data;	break;}
									case 3:{Data = gtt_Ctrl_counter.uc_Hour_set_data;	break;}
									case 4:{Data = gtt_Ctrl_counter.uc_Mint_set_data;	break;}
									case 5:{Data = 0;									break;}
								}
				                com_led21_dital_data = ' ';
				                pss_Select_dital_data_work = Data;
				                led21_data = (unsigned char)(pss_Select_dital_data_work / 100);
				                if(led21_data == 0){
				                	com_led21_dital_data = 0x20;
				                }
								else{
				                	com_led21_dital_data = led21_data + 0x30;
				                }
				                led22_data = (unsigned char)((pss_Select_dital_data_work - led21_data * 100)  / 10);
				                if(led21_data == 0 && led22_data == 0){
				                	com_led22_dital_data = 0x20;
				                }
								else{
				                	com_led22_dital_data = led22_data + 0x30;
				                }
				      	        led23_data = (unsigned char)(pss_Select_dital_data_work - (led22_data * 10) - (led21_data * 100));
				                com_led23_dital_data = led23_data + 0x30;
							}
							else{
		                 		com_led21_dital_data	= ' ';
		                 		com_led22_dital_data	= ' ';
		                 		com_led23_dital_data	= ' ';
							}
						}
						else{
			                if (gtt_Dital_attribute[gsc_Select_dital_counter].uc_Point == 0)
			                {
			                	if (gss_Select_dital[gsc_Select_dital_counter] < 0 )
			                	{
			                   		com_led21_dital_data = '-';
			                   		pss_Select_dital_data_work = ~gss_Select_dital[gsc_Select_dital_counter];
			                   		pss_Select_dital_data_work++;
			                	} else {
			                   		com_led21_dital_data = ' ';
			                   		pss_Select_dital_data_work = gss_Select_dital[gsc_Select_dital_counter];
			                	}
			                	led21_data = (unsigned char)(pss_Select_dital_data_work / 100);
			                	if (led21_data == 0)
			                	{
			                        if (com_led21_dital_data != '-') com_led21_dital_data = 0x20;
			                	} else {
			                    	com_led21_dital_data = led21_data + 0x30;
			                	}
			                	led22_data = (unsigned char)((pss_Select_dital_data_work - led21_data * 100)  / 10);
			                	if (led21_data == 0 && led22_data == 0)
			                	{
			                    	com_led22_dital_data = 0x20;
			                	} else {
			                    	com_led22_dital_data = led22_data + 0x30;
			                	}
			      	        	led23_data = (unsigned char)(pss_Select_dital_data_work - (led22_data * 10) - (led21_data * 100));
			                	com_led23_dital_data = led23_data + 0x30;
			                } 
			                if (gtt_Dital_attribute[gsc_Select_dital_counter].uc_Point == 1)
			                {
			                	pss_Select_dital_data_work = gss_Select_dital[gsc_Select_dital_counter];
			                	led21_data = (unsigned char)(pss_Select_dital_data_work / 100);
			                    com_led21_dital_data = led21_data + 0x30;
			                	led22_data = (unsigned char)((pss_Select_dital_data_work - led21_data * 100)  / 10);
			                    com_led22_dital_data = led22_data + 0x30;
			      	        	led23_data = (unsigned char)(pss_Select_dital_data_work - (led22_data * 10) - (led21_data * 100));
			                	com_led23_dital_data = led23_data + 0x30;
			                }
			                if (gtt_Dital_attribute[gsc_Select_dital_counter].uc_Point == 2)
			                {
			                	if (gss_Select_dital[gsc_Select_dital_counter] < 0 )
			                	{
			                   		com_led21_dital_data = '-';
			                   		pss_Select_dital_data_work = ~gss_Select_dital[gsc_Select_dital_counter];
			                   		pss_Select_dital_data_work++;
			                	} else {
			                   		com_led21_dital_data = ' ';
			                   		pss_Select_dital_data_work = gss_Select_dital[gsc_Select_dital_counter];
			                	}
			                	//pss_Select_dital_data_work = gss_Select_dital[gsc_Select_dital_counter];
			                	led21_data = (unsigned char)(pss_Select_dital_data_work / 100);
			                	if (led21_data == 0)
			                	{
			                        if (com_led21_dital_data != '-') com_led21_dital_data = 0x20;
			                	} else {
			                    	com_led21_dital_data = led21_data + 0x30;
			                	}
			                	led22_data = (unsigned char)((pss_Select_dital_data_work - led21_data * 100)  / 10);
			                    com_led22_dital_data = led22_data + 0x30;
			      	        	led23_data = (unsigned char)(pss_Select_dital_data_work - (led22_data * 10) - (led21_data * 100));
			                	com_led23_dital_data = led23_data + 0x30;
			                }
			                //ローパルス電圧、スタート電圧選択時特別表示 2008.10.10
#if 0 //2009.03.16 del
			                if (gsc_Select_dital_counter == P_LOW_PULSE_VOLT)
			                {
			                    if(guc_Okcv_select_counter == 1)
			                    {
			                	   if (gs_Okcv_adjust_wave_data < 0 )
			                	   {
			                   		   com_led21_dital_data = '-';
			                   		   pss_Select_dital_data_work = ~gs_Okcv_adjust_wave_data;
			                   		   pss_Select_dital_data_work++;
			                	   } else {
			                   		   com_led21_dital_data = ' ';
			                   		   pss_Select_dital_data_work = gs_Okcv_adjust_wave_data;
			                	   }
			                	   led21_data = (unsigned char)(pss_Select_dital_data_work / 100);
			                	   if (led21_data == 0)
			                	   {
			                           if (com_led21_dital_data != '-') com_led21_dital_data = 0x20;
			                	   } else {
			                    	   com_led21_dital_data = led21_data + 0x30;
			                	   }
			                	   led22_data = (unsigned char)((pss_Select_dital_data_work - led21_data * 100)  / 10);
			                       com_led22_dital_data = led22_data + 0x30;
			      	        	   led23_data = (unsigned char)(pss_Select_dital_data_work - (led22_data * 10) - (led21_data * 100));
			                	   com_led23_dital_data = led23_data + 0x30;
			                    }
			                }
#endif 
						}
		                InternalPackRemo.Data.From.uc_Com_7led_data[3] = com_led21_dital_data;
		                InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led22_dital_data;
		                InternalPackRemo.Data.From.uc_Com_7led_data[5] = com_led23_dital_data;
		                if (gtt_Dital_attribute[gsc_Select_dital_counter].uc_Point == 1)
		                {
		                    InternalPackRemo.Data.From.uc_Com_7led_data[3] = com_led21_dital_data | 0x80; //LED4に小数点追加
		                }
		                if (gtt_Dital_attribute[gsc_Select_dital_counter].uc_Point == 2)
		                {
		                    InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led22_dital_data | 0x80; //LED5に小数点追加
		                }
					}
					// 交流周波数制限表示設定 2010.01.20 by @Tny
#if false //2011.10.01
                	if((guc_Menu_Hierarchy != 0)&&(gsc_Select_dital_counter == P_AC_FRQ_DISP)){
						if(gss_Select_dital[gsc_Select_dital_counter] == 0){	// 表示無し？
							com_led21_dital_data = ' ';
							com_led22_dital_data = 'n';
							com_led23_dital_data = 'o';
						}
						else{
							com_led21_dital_data = 'y';
							com_led22_dital_data = 'E';
							com_led23_dital_data = 'S';
						}
		                InternalPackRemo.Data.From.uc_Com_7led_data[3] = com_led21_dital_data;
		                InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led22_dital_data;
		                InternalPackRemo.Data.From.uc_Com_7led_data[5] = com_led23_dital_data;
					}
#endif
					if(guc_Menu_Hierarchy != 0){ // 詳細メニュー設定階層フラグが詳細設定項目の選択（＝０）ではない？   【直値指定注意！！】	BP3 Phase2 @Tny 2009.01.13
						if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）BP4 Phase3 by @Tny 2009.01.15
							gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ BP4 Phase3 by @Tny 2009.01.15
							//if(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME){	// 表示保持時間の設定？ 	BP4 Phase4 by @Tny 2009.01.13
							//if((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME) || (gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)){ //2009.02.13エキスパートモード実験用
							//if((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME) || (gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)){ // 2010.01.08 マスク時間追加
							//if((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME) || (gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)){ // 2010.01.08 マスク時間追加	出力制限機能追加 2010.08.08 by @Tny
							//if((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME) || (gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE)){ // 2010.01.08 マスク時間追加	出力制限機能追加 2010.08.08 by @Tny		マイルドパルス設定機能追加 2010.08.10 by @Tny
							//if((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME) || (gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE)){ // 2010.01.08 マスク時間追加	出力制限機能追加 2010.08.08 by @Tny		マイルドパルス設定機能追加 2010.08.10 by @Tny
							if((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME) || (gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE)){ //2011.10.03
		                		all_char_lcd2_set_class(guc_Dital_code2[gsc_Select_dital_counter][0] , gus_Point_code[gsc_Select_dital_counter]); // BP4 Phase3 @Tny 2009.01.13
							}
							else if(gsc_Select_dital_counter == P_NOW_DATE_TIME){	// 現在時刻の設定？		BP4 Phase4 by @Tny 2009.01.13
								if(gss_Select_dital[P_NOW_DATE_TIME] < 3){
		                			all_char_lcd2_set_class(guc_Dital_code2[gsc_Select_dital_counter][0] , gus_Point_code[gsc_Select_dital_counter]); // BP4 Phase3 @Tny 2009.01.13
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 4] = (gtt_Ctrl_counter.uc_Year_set_data / 10) + 0x30;
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 5] = (gtt_Ctrl_counter.uc_Year_set_data % 10) + 0x30;
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 7] = (gtt_Ctrl_counter.uc_Month_set_data / 10) + 0x30;
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 8] = (gtt_Ctrl_counter.uc_Month_set_data % 10) + 0x30;
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[10] = (gtt_Ctrl_counter.uc_Day_set_data / 10) + 0x30;
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[11] = (gtt_Ctrl_counter.uc_Day_set_data % 10) + 0x30;
//--------------------------------------------------------------------
// →:0x7e/←:0x7f	BP4 Phase14 by @Tny 2009.02.24
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[15] = 0x7E;
//--------------------------------------------------------------------
								}
								else{
		                			all_char_lcd2_set_class(guc_Dital_code2[gsc_Select_dital_counter][1] , gus_Point_code[gsc_Select_dital_counter]); // BP4 Phase3 @Tny 2009.01.13
//--------------------------------------------------------------------
// →:0x7e/←:0x7f	BP4 Phase14 by @Tny 2009.02.24
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 0] = 0x7F;
//--------------------------------------------------------------------
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 5] = (gtt_Ctrl_counter.uc_Hour_set_data / 10) + 0x30;
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 6] = (gtt_Ctrl_counter.uc_Hour_set_data % 10) + 0x30;
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 8] = (gtt_Ctrl_counter.uc_Mint_set_data / 10) + 0x30;
									ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 9] = (gtt_Ctrl_counter.uc_Mint_set_data % 10) + 0x30;
								}
								switch(gss_Select_dital[P_NOW_DATE_TIME]){
									case 0:{ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x0c00;break;}//	0000 11000 0000 000b
									case 1:{ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x0180;break;}// 0000 0001 1000 0000b
									case 2:{ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x0030;break;}// 0000 0000 0011 0000b
									case 3:{ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x0600;break;}// 0000 0110 0000 0000b
									case 4:{ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x00c0;break;}// 0000 0000 1100 0000b
									case 5:{ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x000f;break;}// 0000 0000 0000 1111b
								}
	                        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 2;        //点滅対象行番号
	                        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;       //点滅時点灯時間
	                        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;       //点滅時消灯時間
	                        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;      //点滅繰り返し回数
								//REMO_Send_CMD(0x36);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
								REMO_Send_CMD(0x36);
#else
								gb_RemCom_0x36	= true;
#endif
//-----------------------------------------------------------
							}
							else if(gsc_Select_dital_counter == P_ARC_DRIVE){	// アークドライブの設定？	BP4 Phase4 by @Tny 2009.01.15
		                		all_char_lcd2_set_class(guc_Dital_code2[gsc_Select_dital_counter][0] , gus_Point_code[gsc_Select_dital_counter]); // BP4 Phase3 @Tny 2009.01.13
							}
							//-----------------------------------------------------------
							else if(gsc_Select_dital_counter == P_LCD_BRIGHT){	// ＬＣＤコントラスト値の設定？	BP4 Phase9 by @Tny 2009.02.16
		                		all_char_lcd2_set_class(guc_Dital_code2[gsc_Select_dital_counter][0] , gus_Point_code[gsc_Select_dital_counter]);
							}
							//-----------------------------------------------------------
							else if(gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME){	// エキスパートモード　マスク時間 2010.01.08
		                		all_char_lcd2_set_class(guc_Dital_code2[gsc_Select_dital_counter][0] , gus_Point_code[gsc_Select_dital_counter]);
							}
							else if(gsc_Select_dital_counter == P_ARC_ASSIST){	// アークアシストの設定 2010.02.25
		                		all_char_lcd2_set_class(guc_Dital_code2[gsc_Select_dital_counter][0] , gus_Point_code[gsc_Select_dital_counter]);
							}
							else if(gsc_Select_dital_counter == P_SOFT_START_TIME){	// ソフトスタート時間の設定 2011.10.01
		                		all_char_lcd2_set_class(guc_Dital_code2[gsc_Select_dital_counter][0] , gus_Point_code[gsc_Select_dital_counter]);
							}
//-------------------------------
// 「微弱モード」の追加		2011.10.28
//-------------------------------
							else if(gsc_Select_dital_counter == P_HOT_CURR_LEVEL){	// ＨＯＴレベルの設定
		    	            	all_char_lcd2_set_class(guc_Dital_code2_HotLevel[gss_Select_dital[gsc_Select_dital_counter]] , gus_Point_code[gsc_Select_dital_counter]);
							}
//-------------------------------
//
//-------------------------------
							else{
		    	            	all_char_lcd2_set_class(guc_Dital_code2[gsc_Select_dital_counter][gss_Select_dital[gsc_Select_dital_counter]] , gus_Point_code[gsc_Select_dital_counter]); // BP4 Phase3 @Tny 2009.01.13
							}
							if(gsc_Select_dital_counter != P_NOW_DATE_TIME){	// 現在時刻の設定ではない？		BP4 Phase4 by @Tny 2009.01.13
	                        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 0;       //点滅対象行番号
								ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0;		//	0000 00000 0000 000b
	                        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;       //点滅時点灯時間
	                        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;       //点滅時消灯時間
	                        	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;     //点滅繰り返し回数
								//REMO_Send_CMD(0x36);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
								REMO_Send_CMD(0x36);
#else
								gb_RemCom_0x36	= true;
#endif
//-----------------------------------------------------------
							}
						}
					}
					else{
						all_char_lcd2_set_class("                " , 0x0000);
	                    if(ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no != 0){
	                    	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 0;       //点滅対象行番号
							ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0;		//	0000 00000 0000 000b
	                    	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;       //点滅時点灯時間
	                    	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;       //点滅時消灯時間
	                    	ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;     //点滅繰り返し回数
							//REMO_Send_CMD(0x36);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
								REMO_Send_CMD(0x36);
#else
								gb_RemCom_0x36	= true;
#endif
//-----------------------------------------------------------
						}
					}
					// BP4 Phase4 by @Tny 2009.01.15
					// 詳細メニュー設定階層フラグが詳細設定項目の選択（＝０）ではない？   【直値指定注意！！】
					// 表示保持時間の設定？
					// 現在時刻の設定？
					// アークドライブの設定？
					// コントローラロック対応（実験用） BP4 Phase9 by @Tny 2009.02.17
	                //if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE))){
                    //if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING))){ //2009.02.13エキスパートモード実験用
                    //if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_LCD_BRIGHT) || (gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING))){ //2009.02.13エキスパートモード実験用
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK))){ //2009.02.13 エキスパートモード実験用	コントローラロック対応 BP4 Phase9 by @Tny 2009.02.17
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK) || (gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT) )){ //2010.01.08 エキスパートモードマスク時間追加		出力制限機能追加 2010.08.08 by @Tny
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK) || (gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE)||(gsc_Select_dital_counter == P_AC_FRQ_DISP) )){ //2010.01.08 エキスパートモードマスク時間追加		出力制限機能追加 2010.08.08 by @Tny		マイルドパルス設定機能追加 2010.08.10 by @Tny	交流周波数制限表示設定 2010.01.20 by @Tny
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_ARC_ASSIST)||(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK) || (gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE)||(gsc_Select_dital_counter == P_AC_FRQ_DISP) )){ //2010.01.08 エキスパートモードマスク時間追加 出力制限機能追加 2010.08.08 by @Tny		マイルドパルス設定機能追加 2010.08.10 by @Tny	交流周波数制限表示設定 2010.01.20 by @Tny アークアシスト追加2010.02.26
                	//if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_ARC_ASSIST)||(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_A)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK) || (gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE)||(gsc_Select_dital_counter == P_AC_FRQ_DISP)||(gsc_Select_dital_counter == P_SOFT_START_TIME) )){ //2011.10.01
                	if((guc_Menu_Hierarchy != 0)&&((gsc_Select_dital_counter == P_ARC_ASSIST)||(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME)||(gsc_Select_dital_counter == P_NOW_DATE_TIME)||(gsc_Select_dital_counter == P_ARC_DRIVE)||(gsc_Select_dital_counter == P_LCD_BRIGHT)||(gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A)||(gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C)||(gsc_Select_dital_counter == P_VOLTAGE_SAMPLING)||(gsc_Select_dital_counter == P_CONTROLLER_LOCK) || (gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME)||(gsc_Select_dital_counter == P_MAX_OUTPUT)||(gsc_Select_dital_counter == P_MILD_PULSE)||(gsc_Select_dital_counter == P_AC_FRQ_DISP)||(gsc_Select_dital_counter == P_SOFT_START_TIME) )){ //2011.10.03
						//if(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME){	// 表示保持時間の設定？		BP4 Phase4 by @Tny 2009.01.15
						//if(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME || gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME){	// 表示保持時間の設定？ 2010.01.08 エキスパートモードマスク時間追加
						if(gsc_Select_dital_counter == P_DISPLAY_HOLD_TIME || gsc_Select_dital_counter == P_EXTARNAL_MASK_TIME || gsc_Select_dital_counter == P_SOFT_START_TIME){	// 表示保持時間の設定？ 2010.01.08 エキスパートモードマスク時間追加 2011.10.01ソフトスタート時間追加
                            if (com_led21_data == 0x30) //2009.03.16
                            {
                                com_led21_data = 0x20; //空白を表示
                            }
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[5] = com_led21_dital_data;
							//ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = '.';
							//ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led22_dital_data; //2009.03.016
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = '.';                  //2009.03.16
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
						}
						else if(gsc_Select_dital_counter == P_ARC_DRIVE){		// アークドライブの設定？	BP4 Phase4 by @Tny 2009.01.15
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led21_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
						}
//------------------------------------------------------------------
						else if(gsc_Select_dital_counter == P_LCD_BRIGHT){		// ＬＣＤコントラスト値の設定？	BP4 Phase9 by @Tny 2009.02.16
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 9] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[10] = com_led23_dital_data;
						}
//------------------------------------------------------------------
	                    else if (gsc_Select_dital_counter == P_EXECUTE_VOLTAGE_C) { //2009.02.13エキスパートモード実験用 動作電圧設定
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led21_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
	                    }
	                    else if (gsc_Select_dital_counter == P_EXTARNAL_LEVEL_A) { //2009.02.13エキスパートモード実験用 外部特性設定
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led21_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
	                    }
	                    else if (gsc_Select_dital_counter == P_EXTARNAL_LEVEL_C) { //2009.02.13エキスパートモード実験用 外部特性設定
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led21_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
	                    }
	                    else if (gsc_Select_dital_counter == P_VOLTAGE_SAMPLING) { //2009.02.13エキスパートモード実験用 測定電圧サンプリング設定
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led21_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
	                    }
	                    else if (gsc_Select_dital_counter == P_MAX_OUTPUT) { // 2010.01.08 出力制限機能追加 2010.08.08 by @Tny
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led21_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
	                    }
	                    else if (gsc_Select_dital_counter == P_MILD_PULSE) { // 2010.01.20 マイルドパルス設定機能追加 2010.08.20 by @Tny
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led21_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
	                    }
						else if(gsc_Select_dital_counter == P_ARC_DRIVE){		// アークドライブの設定？	BP4 Phase4 by @Tny 2009.01.15
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = com_led21_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = com_led22_dital_data;
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
						}
						else if(gsc_Select_dital_counter == P_ARC_ASSIST){		// アークアシストの設定 2010.02.25
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[6] = ' ';
                            if (gss_Select_dital[gsc_Select_dital_counter] < 0)
                            {
							    ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = '-';
                            } else if (gss_Select_dital[gsc_Select_dital_counter] > 0){
							    ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = '+';
                            } else if (gss_Select_dital[gsc_Select_dital_counter] == 0){
							    ComuniPackRemo.Data.From.uc_Com_lcd_data2[7] = ' ';
                            }
							ComuniPackRemo.Data.From.uc_Com_lcd_data2[8] = com_led23_dital_data;
						}
						else if(gsc_Select_dital_counter == P_NOW_DATE_TIME){
							if(guc_Menu_Hierarchy == 2){
								switch(gss_Select_dital[P_NOW_DATE_TIME]){
									case 0:{ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 4] = '*';
											ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 5] = '*';
											break;}
									case 1:{ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 7] = '*';
											ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 8] = '*';
											break;}
									case 2:{ComuniPackRemo.Data.From.uc_Com_lcd_data2[10] = '*';
											ComuniPackRemo.Data.From.uc_Com_lcd_data2[11] = '*';
											break;}
									case 3:{ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 5] = '*';
											ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 6] = '*';
											break;}
									case 4:{ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 8] = '*';
											ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 9] = '*';
											break;}
								}
							}
						}
					}
					else{
		                InternalPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
		                InternalPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
		                InternalPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
					}
				}
//--------------------------------
// < IIF NEW > 2009.11.18 @Tny
				else if(gsc_Select_dital_counter == P_IIF_SELECT){	// ＩＩＦ設定モード？
					if(guc_Menu_Hierarchy == 0){
						all_char_lcd1_set_class(guc_Dital_code[gsc_Select_dital_counter] , gus_Point_code[gsc_Select_dital_counter]);
						all_char_lcd2_set_class("                " , 0x0000);
					}
					InternalPackRemo.Data.From.uc_Com_7led_data[0] = '0';
					com_led12_data = (unsigned char)(gsc_Select_dital_counter + 1) / 10;
					InternalPackRemo.Data.From.uc_Com_7led_data[1] = com_led12_data;
					InternalPackRemo.Data.From.uc_Com_7led_data[2] = (unsigned char)((gsc_Select_dital_counter + 1) % 10);
					char_set_class(7,gc_Dital_unit[gsc_Select_dital_counter],false,false,false);
	                InternalPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
	                InternalPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
	                InternalPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
					if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
						gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
						all_char_lcd1_set_class(guc_Dital_Iif_Select_1st[gss_Select_dital[P_IIF_SELECT]][(guc_Menu_Hierarchy - 1)] , 0);
						all_char_lcd2_set_class(guc_Dital_Iif_Select_2nd[gss_Select_dital[P_IIF_SELECT]][(guc_Menu_Hierarchy - 1)] , 0);
						ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 0;		//点滅対象行番号
						ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0;		//	0000 00000 0000 000b
						ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;		//点滅時点灯時間
						ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;		//点滅時消灯時間
						ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;		//点滅繰り返し回数
						gb_RemCom_0x36	= true;
						switch(guc_Menu_Hierarchy){ // ＩＩＦ詳細メニュー設定階層フラグ
							case 1:{
									//xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[5], guc_Dital_Iif_Select_Disp[gss_Select_dital[P_IIF_SELECT]], 11); //2019.03.15 ihara del
									break;}
							case 2:{
									switch(gss_Select_dital[P_IIF_SELECT]){
										case 0:{ // デジタル出力設定
												if(gus_Iif_Set_Menu <= 8){	// ８ポート
													ComuniPackRemo.Data.From.uc_Com_lcd_data2[13] = (gtt_Ctrl_counter.uc_Out_port_no + 0x30);
												}
												else{
													//xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[12], "ﾓﾄﾞﾙ", 4); //2019.03.15 ihara del
												}
												break;}
										case 1:{ // デジタル入力設定
												if(gus_Iif_Set_Menu <= 9){	// ９ポート	// 	<<<EXTERNAL IIF NEW>>>	１０ビット対応	2011.10.07 by @Tny
													ComuniPackRemo.Data.From.uc_Com_lcd_data2[13] = (gtt_Ctrl_counter.uc_In_port_no + 0x30);
													ComuniPackRemo.Data.From.uc_Com_lcd_data2[14] = ' ';
												}
#if false	// <EXTERNAL IIF NEW(Phase 2)>	2011.10.12 by @Tny
												else if(gus_Iif_Set_Menu <= 10){	// １０ポート	// 	<<<EXTERNAL IIF NEW>>>	１０ビット対応	2011.10.07 by @Tny
													ComuniPackRemo.Data.From.uc_Com_lcd_data2[13] = ((gtt_Ctrl_counter.uc_In_port_no / 10) + 0x30);
													ComuniPackRemo.Data.From.uc_Com_lcd_data2[14] = ((gtt_Ctrl_counter.uc_In_port_no % 10) + 0x30);
												}
#endif
												else{
													//xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[12], "ﾓﾄﾞﾙ", 4); //2019.03.15 ihara del
												}
												break;}
										case 2:{ // アナログ入力設定
												if(gus_Iif_Set_Menu <= 3){	// ３ポート
													ComuniPackRemo.Data.From.uc_Com_lcd_data2[13] = (gtt_Ctrl_counter.uc_Analog_port_no + 0x30);
												}
												else{
													//xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[12], "ﾓﾄﾞﾙ", 4); //2019.03.15 ihara del
												}
												break;}
										case 3:{ // 設定確定確認
												if(gb_Iif_ChangeSetting){
													//xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[6], guc_YES_NO_Disp[gus_Iif_Set_Menu], 3); //2019.03.15 ihara del
												}
												else{
													//xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[4], "ﾎﾟｰﾄﾍﾝｺｳﾅｼ", 10); //2019.03.15 ihara del
												}
												break;}
										case 4:{ // アナログ入力ポートのシフト量校正処理
												break;}
									}
									break;}
							case 3:{
									switch(gss_Select_dital[P_IIF_SELECT]){
										case 0:{ // デジタル出力設定
													xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[5], guc_Dital_Iif_OT_Select[gus_Iif_Set_Dital], 6);
													if(guc_Out_port[0][gtt_Ctrl_counter.uc_Out_port_no] != gus_Iif_Set_Dital){
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x07e0;	// 0000 0111 1110 0000b
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 2;		//点滅対象行番号
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;		//点滅時点灯時間
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;		//点滅時消灯時間
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;		//点滅繰り返し回数
														gb_RemCom_0x36	= true;
													}
												break;}
										case 1:{ // デジタル入力設定
													xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[5], guc_Dital_Iif_IN_Select[gus_Iif_Set_Dital], 6);
													if(guc_In_port[0][gtt_Ctrl_counter.uc_In_port_no] != gus_Iif_Set_Dital){
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x07e0;	// 0000 0111 1110 0000b
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 2;		//点滅対象行番号
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;		//点滅時点灯時間
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;		//点滅時消灯時間
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;		//点滅繰り返し回数
														gb_RemCom_0x36	= true;
													}
												break;}
										case 2:{ // アナログ入力設定
													xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[5], guc_Dital_Iif_AG_Select[gus_Iif_Set_Dital], 6);
													if(guc_Analog_port[0][gtt_Ctrl_counter.uc_Analog_port_no] != gus_Iif_Set_Dital){
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x07e0;	// 0000 0111 1110 0000b
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 2;		//点滅対象行番号
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;		//点滅時点灯時間
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;		//点滅時消灯時間
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;		//点滅繰り返し回数
														gb_RemCom_0x36	= true;
													}
												break;}
										case 3:{ // 設定確定確認
												break;}
										case 4:{ // アナログ入力ポートのシフト量校正処理
													if(gb_Iif_AnalogCalibration){ // 校正処理判定：ＮＧ
														xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[8], guc_OK_NG_Disp[1], 2);
													}
													else{
														xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[8], guc_OK_NG_Disp[0], 2);
													}
												break;}
									}
									break;}
							case 4:{
									switch(gss_Select_dital[P_IIF_SELECT]){
										case 0:{ // デジタル出力設定
												break;}
										case 1:{ // デジタル入力設定
													xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[3], guc_A_B_Disp[gus_Iif_PortContact], 1);
													if(guc_In_port[1][gtt_Ctrl_counter.uc_In_port_no] != gus_Iif_PortContact){
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0x1ff8;	// 0001 1111 1111 1000b
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 2;		//点滅対象行番号
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;		//点滅時点灯時間
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;		//点滅時消灯時間
														ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;		//点滅繰り返し回数
														gb_RemCom_0x36	= true;
													}
												break;}
										case 2:{ // アナログ入力設定
												break;}
										case 3:{ // 設定確定確認
												break;}
										case 4:{ // アナログ入力ポートのシフト量校正処理
												break;}
									}
									break;}
						}
					}
				}
// < IIF NEW > 2009.11.18 @Tny
//--------------------------------
				else{
					char Data[20],i;
					switch(guc_Menu_Hierarchy){
						case 0:
				                all_char_lcd1_set_class(guc_Dital_code[gsc_Select_dital_counter] , gus_Point_code[gsc_Select_dital_counter]);
// BP4 Phase7 by @Tny           InternalPackRemo.Data.From.uc_Com_7led_data[0] = 'P';	// 2009-02-13
				                InternalPackRemo.Data.From.uc_Com_7led_data[0] = '0';	// BP4 Phase7 by @Tny 2009-02-13
				                com_led12_data = (unsigned char)(gsc_Select_dital_counter + 1) / 10;
				                InternalPackRemo.Data.From.uc_Com_7led_data[1] = com_led12_data;
				                InternalPackRemo.Data.From.uc_Com_7led_data[2] = (unsigned char)((gsc_Select_dital_counter + 1) % 10);
				                char_set_class(7,gc_Dital_unit[gsc_Select_dital_counter],false,false,false);
					            InternalPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
		    			        InternalPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
					            InternalPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
								break;
						case 1:
								for(i=0;i<16;i++){
									Data[i] = ' ';
								}
//								all_char_lcd1_set_class("CH-00: ｼﾞｮｳｹﾝﾒｲ " , 0x0000);
//                  	        ComuniPackRemo.Data.From.uc_Com_lcd_data1[3] = (gss_Select_dital[gsc_Select_dital_counter] / 10 + 0x30);
//                        	    ComuniPackRemo.Data.From.uc_Com_lcd_data1[4] = (gss_Select_dital[gsc_Select_dital_counter] % 10 + 0x30);
								strcpy((char *)Data, "CH-  : ｼﾞｮｳｹﾝﾒｲ ");	// 入力文字の表示
    	                	    Data[3] = (gss_Select_dital[gsc_Select_dital_counter] / 10 + 0x30);
        	                	Data[4] = (gss_Select_dital[gsc_Select_dital_counter] % 10 + 0x30);
								all_char_lcd1_set_class(Data, 0x0000);

						case 2:
// BP4 Phase7 by @Tny           InternalPackRemo.Data.From.uc_Com_7led_data[0] = 'P';	// 2009-02-13
				                InternalPackRemo.Data.From.uc_Com_7led_data[0] = '0';	// BP4 Phase7 by @Tny 2009-02-13
				                com_led12_data = (unsigned char)(gsc_Select_dital_counter + 1) / 10;
				                InternalPackRemo.Data.From.uc_Com_7led_data[1] = com_led12_data;
				                InternalPackRemo.Data.From.uc_Com_7led_data[2] = (unsigned char)((gsc_Select_dital_counter + 1) % 10);
				                char_set_class(7,gc_Dital_unit[gsc_Select_dital_counter],false,false,false);
					            InternalPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
		    			        InternalPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
					            InternalPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
#if false
	                            InternalPackRemo.Data.From.uc_Com_7led_data[0] = 'C';
    	                        InternalPackRemo.Data.From.uc_Com_7led_data[1] = 'H';
        	                    InternalPackRemo.Data.From.uc_Com_7led_data[2] = '-';
            	                InternalPackRemo.Data.From.uc_Com_7led_data[3] = '0';
                	            com_led12_data = gss_Select_dital[gsc_Select_dital_counter] / 10;
                    	        InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led12_data;
                        	    InternalPackRemo.Data.From.uc_Com_7led_data[5] = gss_Select_dital[gsc_Select_dital_counter] - com_led12_data * 10;
#endif
								break;
					}
					if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）
						gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
						switch(guc_Menu_Hierarchy){
							case 0:{
									if(gb_RecWeldCond)	all_char_lcd2_set_class("                " , 0x0000);
									else				all_char_lcd2_set_class("  ｷｵｸｼﾞｮｳｹﾝﾅｼ   " , 0x0000);
									break;}
							case 1:{
									if(guc_StringInput == 1){
										all_char_lcd2_set_class("                " , 0x0000);
								 		strcpy((char *)ComuniPackRemo.Data.From.uc_Com_lcd_data2, (const char *)gt_SelectCharacter);	// 入力文字の表示
										if(gus_InputCharIndex < 16){
											ComuniPackRemo.Data.From.uc_Com_lcd_data2[gus_InputCharIndex]	= ' ';	// 入力文字位置にカーソル文字を表示
										}
									}
									else if(guc_StringInput == 2){
										StringInput_Disp(false, "ﾓｼﾞﾆｭｳﾘｮｸ", gt_SelectCharacter, 16);	// 文字入力処理（表示部）
									}
									break;}
							case 2:{
									StringInput_Disp(false, "ﾓｼﾞﾆｭｳﾘｮｸ", gt_SelectCharacter, 16);	// 文字入力処理（表示部）
									break;}
						}
					}
				}
#endif
//-----------------------------------------------------------------------------
//--------------------------------------------------------------------
//BP4 Phase13 by @Tny 2009.02.23
				}
//--------------------------------------------------------------------
            }
//--------------------------------------------
//--------------------------------------------
// BP4 Phase9 by @Tny 2009.02.17
			else{
				if(ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no != 0){ // ＬＣＤの文字点滅処理中？
					ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Line_no		     = 0;       //点滅対象行番号
					ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.us_Blink_on_off_flag = 0;		//	0000 00000 0000 000b
					ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_on_time     = 5;       //点滅時点灯時間
					ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_off_time    = 5;       //点滅時消灯時間
					ComuniPackRemo.Data.From.t_Lcd_cntrol_data1.uc_Blink_times       = 100;     //点滅繰り返し回数
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x36);
#else
					gb_RemCom_0x36	= true;
#endif
//-----------------------------------------------------------
//-----------------------------------------------------------
				}
			}

            //リモコン再生時のLED表示 2009.03.30
            //if (gtt_Ctrl_flag.Remo_play_mode == ON && gtt_Ctrl_flag.Remo_play_ch_select == OFF) //2009.03.30
            if (gtt_Ctrl_flag.Remo_play_mode == ON && gtt_Ctrl_flag.Remo_play_ch_select == OFF && gtt_End_welding_display.us_Display_time <= 0) //2009.03.31
            {
                            InternalPackRemo.Data.From.uc_Com_7led_data[0] = 'C';
                            InternalPackRemo.Data.From.uc_Com_7led_data[1] = 'H';
                            InternalPackRemo.Data.From.uc_Com_7led_data[2] = '-';
                            InternalPackRemo.Data.From.uc_Com_7led_data[3] = '0';
                            com_led12_data = guc_Remo_play_ch / 10;
                            InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led12_data;
                            InternalPackRemo.Data.From.uc_Com_7led_data[5] = guc_Remo_play_ch - com_led12_data * 10;
                            
            }



            if (guc_Select_counter == MODE_PLAY || guc_Select_counter == MODE_RECORD)	// BP4 Phase6 by @Tny 2009/01/27
            {
//-----------------------------------------------------------------------------
// BP4 Phase5 by @Tny 2009.01.22
				if(gb_2Line_FirstDisplay == false){	// 初回二行目表示フラグはＯＦＦ（まだ二行目を表示していない？）＝ＬＣＤ表示が必要？
					gb_2Line_FirstDisplay = true;		// 初回二行目表示フラグをＯＮ
            		if(guc_Select_counter == MODE_PLAY){
                        if(guc_Ch_no != 0){
							char Data[20],i;
							for(i=0;i<16;i++){
								Data[i] = ' ';
							}
							strcpy((char *)Data, "CH-  : ｼﾞｮｳｹﾝﾒｲ ");	// 入力文字の表示
                    	    Data[3] = (guc_Ch_no / 10 + 0x30);
                        	Data[4] = (guc_Ch_no % 10 + 0x30);
							all_char_lcd1_set_class(Data, 0x0000);
							for(i=0;i<16;i++){
								Data[i] = ' ';
							}
							strcpy((char *)Data, (const char *)gt_SelectCharacter);							// 入力文字の表示
							if(gus_InputCharIndex < 16){
								Data[gus_InputCharIndex]	= ' ';											// 入力文字位置にカーソル文字を表示
							}
							strcpy((char *)ComuniPackRemo.Data.From.uc_Com_lcd_data2, (const char *)Data);	// 入力文字の表示
						}
						else{
							all_char_lcd1_set_class("ｼﾞｮｸﾞﾏﾜｼﾃ ﾊﾞﾝｺﾞｳ" , 0x0000);
// BP4 Phase7 by @Tny 2009-02-13	all_char_lcd2_set_class("ｼﾞｮｸﾞ ｵｼﾃ ｻｲｾｲ  " , 0x0000);
							all_char_lcd2_set_class(" ｵｼﾃ ｻｲｾｲ       " , 0x0000);
						}
					}
					else{
//-------------------------------------------------
// BP4 Phase7 by @Tny 2009-02-13
                		if(gtt_Ctrl_flag.Rec_display == OFF){
							all_char_lcd1_set_class("ｼﾞｮｸﾞﾏﾜｼﾃ ﾊﾞﾝｺﾞｳ" , 0x0000);
							all_char_lcd2_set_class(" ｵｼﾃ ｼｮﾘ ｾﾝﾀｸ   " , 0x0000);
						}
						else{
							all_char_lcd1_set_class("ｼﾞｮｸﾞﾏﾜｼﾃ ｾﾝﾀｸ  " , 0x0000);
	                    	if(gtt_Ctrl_flag.Yes == ON)			all_char_lcd2_set_class(" ｵｼﾃ ｷｵｸ        " , 0x0000);
							else if(gtt_Ctrl_flag.Del == ON)	all_char_lcd2_set_class(" ｵｼﾃ ｻｸｼﾞｮ      " , 0x0000);
							else								all_char_lcd2_set_class(" ｵｼﾃ ﾓﾄﾞﾙ       " , 0x0000);
						}
					}
				}
//-------------------------------------------------


//----- Phase21 by @Tny 2008/10/03 -----
#if true
            if((guc_Sequence_mode == IDLING) || ((guc_Sequence_mode > IDLING) && (guc_Sequence_mode < BURN_BACK) && (gus_Pre_display_timer > 0))){
#endif
//--------------------------------------------
                if (gtt_Ctrl_flag.Rec_display == OFF)
                {
                    if (gtt_Ctrl_flag.Revers_time == OFF)
                    {
                        gtt_Ctrl_flag.Revers_time = ON;
                        gtt_Ctrl_counter.Revers_time = REVERS_TIME;
                    } else if (gtt_Ctrl_counter.Revers_time <= 0) {
                        if (gtt_Ctrl_flag.Ch_app == ON)
                        {
                            gtt_Ctrl_flag.Ch_app = OFF;
                        } else {
                            gtt_Ctrl_flag.Ch_app = ON;
                        }
                        gtt_Ctrl_flag.Revers_time = OFF;
                    }
                    if (gtt_Ctrl_flag.Ch_app == ON)
                    {
                        if (guc_Ch_no != 0) //2008.09.04
                        {
                            InternalPackRemo.Data.From.uc_Com_7led_data[0] = 'C';
                            InternalPackRemo.Data.From.uc_Com_7led_data[1] = 'H';
                            InternalPackRemo.Data.From.uc_Com_7led_data[2] = '-';
                            InternalPackRemo.Data.From.uc_Com_7led_data[3] = '0';
                            com_led12_data = guc_Ch_no / 10;
                            InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led12_data;
                            InternalPackRemo.Data.From.uc_Com_7led_data[5] = guc_Ch_no - com_led12_data * 10;
                        } else {
                            InternalPackRemo.Data.From.uc_Com_7led_data[0] = '-';
                            InternalPackRemo.Data.From.uc_Com_7led_data[1] = '-';
                            InternalPackRemo.Data.From.uc_Com_7led_data[2] = '-';
                            InternalPackRemo.Data.From.uc_Com_7led_data[3] = 'o';
                            InternalPackRemo.Data.From.uc_Com_7led_data[4] = 'F';
                            InternalPackRemo.Data.From.uc_Com_7led_data[5] = 'F';
                        }
                     }
            		if (gtt_Ctrl_flag.Ch_app == OFF) //溶接表示 2008.08.07
            		{
                    	switch (guc_Select_current_sel_counter) //2008.02.26変更
                    	{
                      		case 0://初期 
                    			pss_Current_work = gtt_Internal_pack.Data.In.usWeldingInitCurr;
                    			pss_Voltage_work = gtt_Internal_pack.Data.In.usWeldingInitVolt;
                        		break;
                      		case 1://本電流 
                    			pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCurr;
                    			pss_Voltage_work = gtt_Internal_pack.Data.In.usWeldingVolt;
                        		break;
                      		case 2://クレータ 
                    			pss_Current_work = gtt_Internal_pack.Data.In.usWeldingCratCurr;
                    			pss_Voltage_work = gtt_Internal_pack.Data.In.usWeldingCratVolt;
                        		break;
                    	}
                           led11_data = (unsigned char)(pss_Current_work / 100);
                           if (led11_data == 0)
                           {
                               com_led11_data = 0x20;
                           } else {
                               com_led11_data = led11_data + 0x30;
                           }
                           led12_data = ((unsigned char)(pss_Current_work - (led11_data * 100)) / 10);
                           if (led11_data == 0 && led12_data == 0)
                           {
                               com_led12_data = 0x20;
                           } else {
                               com_led12_data = led12_data + 0x30;
                           }
                           led13_data = (unsigned char)(pss_Current_work - (led11_data * 100) - (led12_data * 10));
                           com_led13_data = led13_data + 0x30;

//-------------------------------------------------
// BP4 Phase7 by @Tny 2009-02-13
#if false
                           led21_data = (unsigned char)(pss_Voltage_work / 100);
                           if (led21_data == 0)
                           {
                               com_led21_data = 0x20;
                           } else {
                               com_led21_data = led21_data + 0x30;
                           }
                           led22_data = ((unsigned char)(pss_Voltage_work - (led21_data * 100)) / 10);
                           if (led21_data == 0 && led22_data == 0)
                           {
                               com_led22_data = 0x20;
                           } else {
                               com_led22_data = led22_data + 0x30;
                           }
                           led23_data = (unsigned char)(pss_Voltage_work - (led21_data * 100) - (led22_data * 10));
                           com_led23_data = led23_data + 0x30;
#endif
//-------------------------------------------------

                           InternalPackRemo.Data.From.uc_Com_7led_data[0] = com_led11_data;
                           InternalPackRemo.Data.From.uc_Com_7led_data[1] = com_led12_data;
                           InternalPackRemo.Data.From.uc_Com_7led_data[2] = com_led13_data;
//-------------------------------------------------
// BP4 Phase7 by @Tny 2009-02-13
#if true
							InternalPackRemo.Data.From.uc_Com_7led_data[3] = '-';
							InternalPackRemo.Data.From.uc_Com_7led_data[4] = '-';
							InternalPackRemo.Data.From.uc_Com_7led_data[5] = '-';
#else
                           InternalPackRemo.Data.From.uc_Com_7led_data[3] = com_led21_data;
                           InternalPackRemo.Data.From.uc_Com_7led_data[4] = com_led22_data | (0x80);
                           InternalPackRemo.Data.From.uc_Com_7led_data[5] = com_led23_data;
#endif
//-------------------------------------------------
                    }
                } else {
                    if (gtt_Ctrl_flag.Yes == ON)
                    {
                        InternalPackRemo.Data.From.uc_Com_7led_data[3] = 'y';
                        InternalPackRemo.Data.From.uc_Com_7led_data[4] = 'E';
                        InternalPackRemo.Data.From.uc_Com_7led_data[5] = 'S';
                    } else {
                        InternalPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
                        InternalPackRemo.Data.From.uc_Com_7led_data[4] = 'n';
                        InternalPackRemo.Data.From.uc_Com_7led_data[5] = 'o';
                    }
                    if (gtt_Ctrl_flag.Del == ON) //2008.09.09
                    {
                        InternalPackRemo.Data.From.uc_Com_7led_data[3] = 'd';
                        InternalPackRemo.Data.From.uc_Com_7led_data[4] = 'E';
                        InternalPackRemo.Data.From.uc_Com_7led_data[5] = 'L';
                    }
//----- Phase25 by @Tny 2008/10/22 -----
#if true
                    InternalPackRemo.Data.From.uc_Com_7led_data[0] = 'r'; //2009.03.17
                    InternalPackRemo.Data.From.uc_Com_7led_data[1] = 'E'; //2009.03.17
                    InternalPackRemo.Data.From.uc_Com_7led_data[2] = 'C'; //2009.03.17
#endif
//--------------------------------------------
                }
//----- Phase21 by @Tny 2008/10/03 -----
#if true
             }
#endif
//--------------------------------------------
             }

             if (guc_No_act_flag == ON) //2008.11.25
             {
                 InternalPackRemo.Data.From.uc_Com_7led_data[0] = 'n';
                 InternalPackRemo.Data.From.uc_Com_7led_data[1] = 'o';
                 InternalPackRemo.Data.From.uc_Com_7led_data[2] = ' ';
                 InternalPackRemo.Data.From.uc_Com_7led_data[3] = 'A';
                 InternalPackRemo.Data.From.uc_Com_7led_data[4] = 'c';
                 InternalPackRemo.Data.From.uc_Com_7led_data[5] = 't';
             }


//--------------------------------------------------------------------
//BP4 Phase15 by @Tny 2009.02.25
			if((gb_ServiceMenu == false)&&(gb_RescueMenu == false)){
//--------------------------------------------------------------------
            //***** BP4ナビＪＯＧ入力部 2009.01.15 ******
            if (guc_Method_condition_counter == 4)
            {
//---------------------------------------
// BP4 Phase11 by @Tny 2009.02.19
	//-----------------------------------------------------------------------------------------------------------------------------------------------
	// <NAVI Enhancements(Phase 2)> 2011.10.27
	#if true
				if((gtt_Ctrl_flag.RemoteController == false)&&(gb_IIF_Select == false)){	// リモコン、およびＩＩＦは接続されていない？
	#else
				if(gtt_Ctrl_flag.RemoteController == false){
	#endif
	//-----------------------------------------------------------------------------------------------------------------------------------------------
//---------------------------------------
                all_char_lcd1_set_class("ｼﾞｮｳｹﾝｾﾝﾀｸ      " , 0x0000);
                switch (gtt_Navi.uc_Key_counter)
                {
                        case 0: //材質
                             {
                               char *puc_Char1;
                               char puc_Char_result[17]; //2010.04.08 16->17
                               puc_Char1  = "ｻﾞｲｼﾂ?  ";
                               strcpy(puc_Char_result , puc_Char1);
                               strcat(puc_Char_result , gc_Navi_material_char[guc_Navi_material_code[gtt_Navi.sc_Jog_counter]]);
                               all_char_lcd2_set_class(puc_Char_result, 0x0000);
                             }
                               break;
                        case 1: //板厚
                             {
                                char *puc_Char1;
                                char puc_Char_result[17]; //2010.04.08 16->17
                                puc_Char1  = "ｲﾀｱﾂ?   ";
                                strcpy(puc_Char_result , puc_Char1);
                                strcat(puc_Char_result , gc_Navi_thickness_char[guc_Navi_thickness_code[gtt_Navi.sc_Jog_counter]]);
                                all_char_lcd2_set_class(puc_Char_result, 0x0000);
                             }
                                break;
                        case 2: //継ぎ手
                             {
                                char *puc_Char1;
                                char puc_Char_result[17]; //2010.04.08 16->17
                                puc_Char1  = "ﾂｷﾞﾃ?   ";
                                strcpy(puc_Char_result , puc_Char1);
                                strcat(puc_Char_result , gc_Navi_joint_char[guc_Navi_joint_code[gtt_Navi.sc_Jog_counter]]);
                                all_char_lcd2_set_class(puc_Char_result, 0x0000);
                             }
                                break;
                        case 3: //溶接姿勢
                             {
                                char *puc_Char1;
                                char puc_Char_result[17]; //2010.04.08 16->17
                                puc_Char1  = "ｼｾｲ?    ";
                                strcpy(puc_Char_result , puc_Char1);
                                strcat(puc_Char_result , gc_Navi_direction_char[guc_Navi_direction_code[gtt_Navi.sc_Jog_counter]]);
                                all_char_lcd2_set_class(puc_Char_result, 0x0000);
                             }
                                break;
                        case 4: //パルス
                             {
                                char *puc_Char1;
                                char puc_Char_result[17]; //2010.04.08 16->17
                                puc_Char1  = "ﾊﾟﾙｽ?    ";
                                strcpy(puc_Char_result , puc_Char1);
                                strcat(puc_Char_result , gc_Navi_pulse_char[guc_Navi_pulse_code[gtt_Navi.sc_Jog_counter]]);
                                all_char_lcd2_set_class(puc_Char_result, 0x0000);
                             }
                                break;
                 }
//---------------------------------------
// BP4 Phase11 by @Tny 2009.02.19
				}
				else{
	//-----------------------------------------------------------------------------------------------------------------------------------------------
	// <NAVI Enhancements(Phase 2)> 2011.10.27
	#if true
					if(gtt_Ctrl_flag.RemoteController){	// リモコが接続されている？
						all_char_lcd1_set_class(" ﾘﾓｺﾝ ｾﾂｿﾞｸﾁｭｳ  " , 0x0000);
						all_char_lcd2_set_class("   ﾘﾖｳﾃﾞｷﾏｾﾝ    " , 0x0000);
					}
					else if(gb_IIF_Select){				// ＩＩＦが接続されている？
						all_char_lcd1_set_class("ｶﾞｲﾌﾞｷｷﾕﾆｯﾄ ﾄﾉ  " , 0x0000);
						all_char_lcd2_set_class(" ﾍｲﾖｳ ﾊ ﾃﾞｷﾏｾﾝ  " , 0x0000);
					}
	#else
					all_char_lcd1_set_class(" ﾘﾓｺﾝ ｾﾂｿﾞｸﾁｭｳ  " , 0x0000);
					all_char_lcd2_set_class("   ﾘﾖｳﾃﾞｷﾏｾﾝ    " , 0x0000);
	#endif
	//-----------------------------------------------------------------------------------------------------------------------------------------------
				}
//---------------------------------------
            }
//--------------------------------------------------------------------
//BP4 Phase15 by @Tny 2009.02.25
			}
//--------------------------------------------------------------------





            //2008.08.28 場所変更
	        if (guc_Jog_rewrite_check_flag ==  2)    // 0:書き換え無し 1:書き換えのため受信済み 2:内部変数に受信内容を転送済み 微調項目２書き換え確認フラグ 2007.2.5追加
    	    {
                //if (guc_Sequence_mode != IDLING) //2009.02.09
                //{
                //    gtt_Ctrl_flag.Current_set_out2 = OFF;
                //}

                guc_Jog_rewrite_check_flag    = 0;    // 0:書き換え無し 1:書き換えのため受信済み 2:内部変数に受信内容を転送済み 微調項目２書き換え確認フラグ 2007.2.5追加
                //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
				REMO_Send_CMD(0x23);
#else
				gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
            }
            //<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>

            //<><><><><><><><><><><><><><><> ＳＷ入力時の表示処理 2007.12.09 <><><><><><><><><><><><><><>
        	if (guc_Sw_rewrite_check_flag == 2)
        	{

//----- Phase17 by @Tny 2008/09/24 -----
#if true
                if(gtt_Ctrl_flag.Set_screen_on_off == ON){
                    //ComuniPackRemo.Data.From.t_Led.Data.Voltage_okcv  = true;
                }
                else{
                    //ComuniPackRemo.Data.From.t_Led.Data.Voltage_okcv  = false;
                }
#endif
//---------------------------------------------------------------------

            	if (gtt_Ctrl_flag.Set_screen_on_off == ON)
                {
                  ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2008.11.10
                                                                                           //溶接条件が確定していない状態で、このモードになった時一旦点滅を消すため
                  if (gtt_Ctrl_flag.Service_man == OFF) //技術・サービスマンメニュー分岐 2008.09.02
                  {

                    switch (gtt_Ctrl_counter.uc_User_menu_no) //ユーザー入力部
                    {
                            case 0://特殊パラメータ入力
                                 char_set_class(1,"PRM",false,false,false);
                                 char_set_class(2,"--" ,false,false,false);
                                 nume3_set_class(3,gtt_Ctrl_counter.us_User_parameter_no);
                                 if (gtt_Special_menu.ss_User_param[gtt_Ctrl_counter.us_User_parameter_no] < 0)
                                 {
                                     char_set_class(4," -",false,false,false);
                                 }
                                 if (gtt_Special_menu.ss_User_param[gtt_Ctrl_counter.us_User_parameter_no] >= 0)
                                 {
                                     char_set_class(4," +",false,false,false);
                                 }
                                 nume5_set_class(gtt_Special_menu.ss_User_param[gtt_Ctrl_counter.us_User_parameter_no]);
                                 break;
                            case 1: //特殊パラメータリセット
                                 char_set_class(1,"RES",false,false,false);
                                 char_set_class(2,"  ",false,false,false);
                                 char_set_class(3,"   ",false,false,false);
                                 char_set_class(4,"  ",false,false,false);
                                 char_set_class(5,"NO ",false,false,false);
                                 char_set_class(6,"   ",false,false,false);
                                 break;
                            case 2:
                                 char_set_class(1,"I/F",false,false,false);
                                 char_set_class(4,"--",false,false,false);
//--------- Phase22 by @Tny 2008/10/08 --------
#if true
                                if(gb_IIF_Select){ // IIF接続時のみ対応
#endif
//---------------------------------------------
                                 switch (gtt_Ctrl_counter.uc_Iif_no)
                                 {
                                     case 0: //OUTPUT PORT設定
                                          if (gtt_Ctrl_flag.Out_function_set_ready == OFF)
                                          {
                                              char_set_class(2,"oT",false,false,false);
                                              nume3_set_class(3,gtt_Ctrl_counter.uc_Out_port_no);
                                              char_set_class(5,gc_Output_function_upper[guc_Out_port[0][gtt_Ctrl_counter.uc_Out_port_no]],false,false,false);
                                              char_set_class(6,gc_Output_function_lower[guc_Out_port[0][gtt_Ctrl_counter.uc_Out_port_no]],false,false,false);
                                              ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                          }
                        	              //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
											REMO_Send_CMD(0x23);
#else
											gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
                                          break;
                                     case 1: //INPUT PORT設定
                                          if (gtt_Ctrl_flag.In_function_set_ready == OFF)
                                          {
                                              char_set_class(2,"In",false,false,false);
                                              nume3_set_class(3,gtt_Ctrl_counter.uc_In_port_no);
                                              char_set_class(5,gc_Input_function_upper[guc_In_port[0][gtt_Ctrl_counter.uc_In_port_no]],false,false,false);
                                              char_set_class(6,gc_Input_function_lower[guc_In_port[0][gtt_Ctrl_counter.uc_In_port_no]],false,false,false);
                                              ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                          }
                        	              //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
											REMO_Send_CMD(0x23);
#else
											gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
                                          break;
                                     case 2: //ANALOG PORT設定
                                          if (gtt_Ctrl_flag.Analog_function_set_ready == OFF)
                                          {
                                              char_set_class(2,"AG",false,false,false);
                                              nume3_set_class(3,gtt_Ctrl_counter.uc_Analog_port_no);
                                              char_set_class(5,gc_Analog_function_upper[guc_Analog_port[0][gtt_Ctrl_counter.uc_Analog_port_no]],false,false,false);
                                              char_set_class(6,gc_Analog_function_lower[guc_Analog_port[0][gtt_Ctrl_counter.uc_Analog_port_no]],false,false,false);
                                              ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                          }
                        	              //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
											REMO_Send_CMD(0x23);
#else
											gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
                                          break;
                                 }
//--------- Phase22 by @Tny 2008/10/08 --------
#if true
                                }
                                else{
                                    char_set_class(2,"--",false,false,false);
                                    char_set_class(3,"---",false,false,false);
                                    char_set_class(5,"---",false,false,false);
                                    char_set_class(6,"---",false,false,false);
                                }
#endif
//---------------------------------------------
                                 break;
                            case 3:
                                 if (gtt_Ctrl_flag.Calender_set_ready == OFF)
                                 {
                                     char_set_class(1,"TIM",false,false,false);
                                     char_set_class(2,"  ",false,false,false);
                                     char_set_class(3,gc_Calender_name[gtt_Ctrl_counter.uc_Calender_no],false,false,false);
                                     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;    //表示するブロック番号 2007.12.14 2008.07.28
                                     switch (gtt_Ctrl_counter.uc_Calender_no)
                                     {
                                         case 0: //年設定
                                              nume2_set_class(4,gtt_Calender.uc_Year_data);
                                              break;
                                         case 1: //月設定
                                              nume2_set_class(4,gtt_Calender.uc_Month_data);
                                              break;
                                         case 2: //日設定
                                              nume2_set_class(4,gtt_Calender.uc_Day_data);
                                              break;
                                         case 3: //時設定
                                              nume2_set_class(4,gtt_Calender.uc_Hour_data);
                                              break;
                                         case 4: //分設定
                                              nume2_set_class(4,gtt_Calender.uc_Mint_data);
                                          break;
                                     }
                        	         //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
											REMO_Send_CMD(0x23);
#else
											gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
                                 }
                                 break;
                            case 4:
                                 char_set_class(1,"ECK",false,false,false);
                                 break;
                            case 5:
                                 char_set_class(1,"MRY",false,false,false);
                                 break;
                            case 6: //2008.11.10
                                 char_set_class(1,"EXT",false,false,false);
                                 break;
                            default:
                                 char_set_class(1,"PRM",false,false,false);
                                 break;
                    }
                  } else { //技術・サービスマンメニュー
#if 0
                    switch (gtt_Ctrl_counter.uc_Service_menu_no) //技術・サービスマン入力部
                    {
                            case 0://サービスマンデータ入力
                                 char_set_class(1,"SRV",false,false,false);
                                 char_set_class(2,"--" ,false,false,false);
                                 nume3_set_class(3,gtt_Ctrl_counter.us_Service_data_no);
                                 if (gtt_Special_menu.ss_Service_data[gtt_Ctrl_counter.us_Service_data_no] < 0)
                                 {
                                     char_set_class(4," -",false,false,false);
                                 }
                                 if (gtt_Special_menu.ss_Service_data[gtt_Ctrl_counter.us_Service_data_no] >= 0)
                                 {
                                     char_set_class(4," +",false,false,false);
                                 }
                                 nume5_set_class(gtt_Special_menu.ss_Service_data[gtt_Ctrl_counter.us_Service_data_no]);
                                 break;
                            case 1: //リセット
                                 char_set_class(1,"RES",false,false,false);
                                 char_set_class(2,"--",false,false,false);
                                 nume3_set_class(3,gtt_Ctrl_counter.uc_Service_reset_no);
                                 char_set_class(4,"  ",false,false,false);
                                 char_set_class(5,"NO ",false,false,false);
                                 char_set_class(6,"   ",false,false,false);
                                 break;
                    }
#endif
                  }
//-------- Phase32 by @Tny 2008.11.26 --------
#if true
					if(guc_Gas_on_off_flag == ON){
						ComuniPackRemo.Data.From.t_Led.Data.Gas   = true;
					}
					else{
						ComuniPackRemo.Data.From.t_Led.Data.Gas   = false;
					}
#endif
//--------------------------------------------
                } else {
					if (guc_Select_counter != MODE_DETAILS) //2008.11.20	// BP4 Phase6 by @Tny 2009/01/27
					{
                        //**********************
        
                    	//REMO_Send_CMD(0x20);
                    	//REMO_Send_CMD(0x34);
                    	//REMO_Send_CMD(0x35);
                        //***************************************************
        
                        //*****選択内容がテーブルに存在しない場合とする場合の処理*****
                        //存在しない場合
                    	if (guc_Remo_table_check_flag == false) //2007.12.06
                    	{
                        	ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 1;    //点滅表示の有り無し
                        	ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 10;        //点滅時点灯時間
                        	ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 10;       //点滅時消灯時間
                        	ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;          //点滅繰り返し回数
                        	switch (guc_Last_select_sw)
                        	{
                                case 1:
                                     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 1;             //表示するブロック番号
                                     break;
                                case 2:
                                     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 2;             //表示するブロック番号
                                     break;
                                case 3:
                                     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 3;             //表示するブロック番号
                                     break;
                                case 4:
                                     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 4;             //表示するブロック番号 2007.12.14
                                     break;
                                case 5:
                                     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 5;             //表示するブロック番号 2007.12.14 2008.07.28
                                     break;
                                case 6:
                                     ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 6;             //表示するブロック番号 2007.12.14 2008.07.28
                                     break;
                        	}
                        	//REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
											REMO_Send_CMD(0x23);
#else
											gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
                    	} else {
                        //存在する場合
                        	ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no          = 0;             //表示するブロック番号
                        	//REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
											REMO_Send_CMD(0x23);
#else
											gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
                    	}
                        //************************************************************
                    } //2008.11.20
        
                    //***** 溶接法の表示 2009.01.10 *****
                    ComuniPackRemo.Data.From.t_Led.Data.Standard_dc_tig_select   = false; //標準　直流ＴＩＧ
                        ComuniPackRemo.Data.From.t_Led.Data.Standard_ac_tig_select   = false; //標準　交流ＴＩＧ
                        ComuniPackRemo.Data.From.t_Led.Data.Standard_mix_tig_select  = false; //標準　ＭＩＸＴＩＧ
                        ComuniPackRemo.Data.From.t_Led.Data.Standard_dc_hand_select  = false; //標準　直流手溶接
                        ComuniPackRemo.Data.From.t_Led.Data.Navi_select              = false; //ナビゲーション
                        ComuniPackRemo.Data.From.t_Led.Data.Expert_dc_tig_select     = false; //エキスパート　直流ＴＩＧ
                        ComuniPackRemo.Data.From.t_Led.Data.Expert_ac_tig_select     = false; //エキスパート　交流ＴＩＧ
                        switch (guc_Method_condition_counter)
                        {
                                case 0: //標準　直流ＴＩＧ
                                        ComuniPackRemo.Data.From.t_Led.Data.Standard_dc_tig_select   = true; //標準　直流ＴＩＧ
                                        break;
                                case 1: //標準　交流ＴＩＧ
                                        ComuniPackRemo.Data.From.t_Led.Data.Standard_ac_tig_select   = true; //標準　交流ＴＩＧ
                                        break;
                                case 2: //標準　ＭＩＸＴＩＧ
                                        ComuniPackRemo.Data.From.t_Led.Data.Standard_mix_tig_select  = true; //標準　ＭＩＸＴＩＧ
                                        break;
                                case 3: //標準　直流手溶接
                                        ComuniPackRemo.Data.From.t_Led.Data.Standard_dc_hand_select  = true; //標準　直流手溶接
                                        break;
                                case 4: //ナビゲーションモード
                                        ComuniPackRemo.Data.From.t_Led.Data.Navi_select              = true; //ナビゲーション
//--------------------------------------------------------------------
//BP4 Phase15 by @Tny 2009.02.25
										if((gb_ServiceMenu == false)&&(gb_RescueMenu == false)){
//--------------------------------------------------------------------
	//-----------------------------------------------------------------------------------------------------------------------------------------------
	// <NAVI Enhancements(Phase 2)> 2011.10.27
										if((gtt_Ctrl_flag.RemoteController == false)&&(gb_IIF_Select == false)){	// リモコン、およびＩＩＦは接続されていない？
	//-----------------------------------------------------------------------------------------------------------------------------------------------
                                        all_char_lcd1_set_class("ｼﾞｮｳｹﾝｾﾝﾀｸ      " , 0x0000);
                                        switch (gtt_Navi.uc_Key_counter)
                                        {
                                              case 0: //材質
                                                     {
                                                        char *puc_Char1;
                                                        char puc_Char_result[17]; //2010.04.08 16->17
                                                        puc_Char1  = "ｻﾞｲｼﾂ?  ";
                                                        strcpy(puc_Char_result , puc_Char1);
                                                        strcat(puc_Char_result , gc_Navi_material_char[guc_Navi_material_code[0]]);
                                                        all_char_lcd2_set_class(puc_Char_result, 0x0000);
                                                     }
                                                     break;
                                              case 1: //板厚
                                                     {
                                                        char *puc_Char1;
                                                        char puc_Char_result[17]; //2010.04.08 16->17
                                                        puc_Char1  = "ｲﾀｱﾂ?   ";
                                                        strcpy(puc_Char_result , puc_Char1);
                                                        strcat(puc_Char_result , gc_Navi_thickness_char[guc_Navi_thickness_code[0]]);
                                                        all_char_lcd2_set_class(puc_Char_result, 0x0000);
                                                     }
                                                     break;
                                              case 2: //継ぎ手
                                                     {
                                                        char *puc_Char1;
                                                        char puc_Char_result[17]; //2010.04.08 16->17
                                                        puc_Char1  = "ﾂｷﾞﾃ?   ";
                                                        strcpy(puc_Char_result , puc_Char1);
                                                        strcat(puc_Char_result , gc_Navi_joint_char[guc_Navi_joint_code[0]]);
                                                        all_char_lcd2_set_class(puc_Char_result, 0x0000);
                                                     }
                                                     break;
                                              case 3: //溶接姿勢
                                                     {
                                                        char *puc_Char1;
                                                        char puc_Char_result[17]; //2010.04.08 16->17
                                                        puc_Char1  = "ﾂｼｾｲ?   ";
                                                        strcpy(puc_Char_result , puc_Char1);
                                                        strcat(puc_Char_result , gc_Navi_direction_char[guc_Navi_direction_code[0]]);
                                                        all_char_lcd2_set_class(puc_Char_result, 0x0000);
                                                     }
                                                     break;
                                              case 4: //パルス
                                                     {
                                                        char *puc_Char1;
                                                        char puc_Char_result[17]; //2010.04.08 16->17
                                                        puc_Char1  = "ﾊﾟﾙｽ?   ";
                                                        strcpy(puc_Char_result , puc_Char1);
                                                        strcat(puc_Char_result , gc_Navi_pulse_char[guc_Navi_pulse_code[0]]);
                                                        all_char_lcd2_set_class(puc_Char_result, 0x0000);
                                                     }
                                                     break;
                                              case 5: //利用不可表示 2010.01.21
                                                     {
                                                        all_char_lcd2_set_class("   ﾘﾖｳﾃﾞｷﾏｾﾝ    ", 0x0000);
                                                     }
                                                     break;
                                        }
	//-----------------------------------------------------------------------------------------------------------------------------------------------
	// <NAVI Enhancements(Phase 2)> 2011.10.27
										}
	//-----------------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------
//BP4 Phase15 by @Tny 2009.02.25
										}
//--------------------------------------------------------------------
		                        gus_RTC_cDebug_1 = 0; //2009.02.12 溶接ナビモード抜けたらすぐに時計を表示するため
                                        break;
                                case 5: //エキスパート　直流ＴＩＧ
                                        ComuniPackRemo.Data.From.t_Led.Data.Expert_dc_tig_select     = true; //エキスパート　直流ＴＩＧ
                                        break;
                                case 6: //エキスパート　交流ＴＩＧ
                                        ComuniPackRemo.Data.From.t_Led.Data.Expert_ac_tig_select     = true; //エキスパート　交流ＴＩＧ
                                        break;
                                default:
                                        break;
                        }
                        //***********************************
           
                        //***** クレータの表示 2009.01.10 *****
                        ComuniPackRemo.Data.From.t_Led.Data.Crater_non_select        = false; //クレータ無し選択
                        ComuniPackRemo.Data.From.t_Led.Data.Crater_select            = false; //クレータ有り選択
                        ComuniPackRemo.Data.From.t_Led.Data.Repeat_select            = false; //反復選択
                        ComuniPackRemo.Data.From.t_Led.Data.Spot_select              = false; //スポット選択
                        if (guc_Method_condition_data != STD_HAND_METHOD) //2009.03.06
                        {
                            switch (guc_Crater_mode_counter)
                            {
                                case 0: //クレータ無し選択
                                        ComuniPackRemo.Data.From.t_Led.Data.Crater_non_select        = true; //クレータ無し選択
                                        break;
                                case 1: //クレータ有り選択
                                        ComuniPackRemo.Data.From.t_Led.Data.Crater_select            = true; //クレータ有り選択
                                        break;
                                case 2: //反復選択
                                        ComuniPackRemo.Data.From.t_Led.Data.Repeat_select            = true; //反復選択
                                        break;
                                case 3: //スポット選択
                                        ComuniPackRemo.Data.From.t_Led.Data.Spot_select              = true; //スポット選択
                                        break;
                                default:
                                        break;
                            }
                        }
                        //***********************************
                        
                        //***** パルスの表示 2009.01.10 *****
                        ComuniPackRemo.Data.From.t_Led.Data.Pulse_non_select         = false; //パルス選択（パルス無）
                        ComuniPackRemo.Data.From.t_Led.Data.Pulse_select             = false; //パルス選択（パルス有）
                        //if (guc_Method_condition_data != STD_HAND_METHOD) //2009.03.06
                        //if (guc_Method_condition_data != STD_HAND_METHOD && guc_Method_condition_data != STD_MIX_METHOD) //2009.03.13
                        if (guc_Method_condition_data == STD_DC_METHOD || guc_Method_condition_data == STD_AC_METHOD) //2009.04.03
                        {
                            switch (guc_Pulse_mode_counter)
                            {
                                case 0: //パルス選択（パルス無）
                                        ComuniPackRemo.Data.From.t_Led.Data.Pulse_non_select         = true; //パルス選択（パルス無）
                                        break;
                                case 1: //パルス選択（パルス有）
                                        ComuniPackRemo.Data.From.t_Led.Data.Pulse_select             = true; //パルス選択（パルス有）
                                        break;
                                default:
                                        break;
                            }
                        }
                        //***********************************

                        //***** 交流波形設定の表示 2009.01.10 *****
                        ComuniPackRemo.Data.From.t_Led.Data.Ac_std_select            = false; //ＡＣ標準波形選択
                        ComuniPackRemo.Data.From.t_Led.Data.Ac_hard_select           = false; //ＡＣハード波形選択
                        ComuniPackRemo.Data.From.t_Led.Data.Ac_soft_select           = false; //ＡＣソフト波形選択
                        //if (guc_Method_condition_data == STD_AC_METHOD || guc_Method_condition_data == EXP_AC_METHOD)
                        if (guc_Method_condition_data == STD_AC_METHOD) //2009.04.06
                        {
                            switch (guc_Ac_wave_counter)
                            {
                                case 0: //ＡＣ標準波形選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Ac_std_select             = true; //ＡＣ標準波形選択
                                       break;
                                case 1: //ＡＣハード波形選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Ac_hard_select            = true; //ＡＣハード波形選択
                                       break;
                                case 2:
                                       ComuniPackRemo.Data.From.t_Led.Data.Ac_soft_select            = true; //ＡＣソフト波形選択
                                       break;
                                default:
                                        break;
                            }
                        }
                        //***********************************


                        //***** シーケンス設定部の表示 2009.01.10*****
                        ComuniPackRemo.Data.From.t_Led.Data.Pre_flow_select          = false; //プリフロー選択
                        ComuniPackRemo.Data.From.t_Led.Data.Init_weld_current_select = false; //初期電流選択
                        ComuniPackRemo.Data.From.t_Led.Data.Up_slop_select           = false; //アップスロープ選択
                        ComuniPackRemo.Data.From.t_Led.Data.Pulse_current_select     = false; //パルス電流選択
                        ComuniPackRemo.Data.From.t_Led.Data.Pulse_duty               = false; //パルス幅選択
                        ComuniPackRemo.Data.From.t_Led.Data.Pulse_frequency          = false; //パルス周波数選択
                        ComuniPackRemo.Data.From.t_Led.Data.Main_weld_current_select = false; //溶接電流選択
                        ComuniPackRemo.Data.From.t_Led.Data.Down_slop_spot_select    = false; //ダウンスロープ＆スポット時間選択
                        ComuniPackRemo.Data.From.t_Led.Data.Crater_current_select    = false; //クレータ電流選択
                        ComuniPackRemo.Data.From.t_Led.Data.After_flow_select        = false; //アフターフロー選択
                        ComuniPackRemo.Data.From.t_Led.Data.Cleaning_width_select    = false; //交流ＴＩＧ設定　クリーニング幅選択 2009.01.19
                        ComuniPackRemo.Data.From.t_Led.Data.Ac_frequency_select      = false; //交流ＴＩＧ設定　周波数選択 2009.01.19
                        ComuniPackRemo.Data.From.t_Led.Data.Mix_frequency            = false; //ＭＩＸ周波数 2009.01.20
                        ComuniPackRemo.Data.From.t_Led.Data.Dc_duty                  = false; //直流比率 2009.01.20

                        if (guc_Method_condition_data != STD_HAND_METHOD) //2009.03.06
                        {
                           //クレータ設定
                           switch (guc_Crater_mode_counter)
                           {
                                case 0: //無
                                       ComuniPackRemo.Data.From.t_Led.Data.Pre_flow_select           = true; //プリフロー選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Main_weld_current_select = true; //溶接電流選択
                                       ComuniPackRemo.Data.From.t_Led.Data.After_flow_select         = true; //アフターフロー選択
                                        break;
                                case 1: //有
                                case 2: //反復
                                       ComuniPackRemo.Data.From.t_Led.Data.Pre_flow_select           = true; //プリフロー選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Init_weld_current_select  = true; //初期電流選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Up_slop_select            = true; //アップスロープ選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Main_weld_current_select  = true; //溶接電流選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Down_slop_spot_select     = true; //ダウンスロープ＆スポット時間選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Crater_current_select     = true; //クレータ電流選択
                                       ComuniPackRemo.Data.From.t_Led.Data.After_flow_select         = true; //アフターフロー選択
                                       break;
                                case 3: //スポット
                                       ComuniPackRemo.Data.From.t_Led.Data.Pre_flow_select           = true; //プリフロー選択 2009.03.18
                                       ComuniPackRemo.Data.From.t_Led.Data.Main_weld_current_select  = true; //溶接電流選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Down_slop_spot_select     = true; //ダウンスロープ＆スポット時間選択
                                       ComuniPackRemo.Data.From.t_Led.Data.After_flow_select         = true; //アフターフロー選択 2009.03.18
                                       break;
                                default:
                                       break;
                           }
                           //パルス設定
                           switch (guc_Pulse_mode_counter)
                           {
                                case 0: //無
                                       break;
                                case 1: //有
#if 0 //2009.01.16
                                       switch(guc_Pulse_item_counter)
                                       {
                                              case 0: //パルス電流設定
                                                      ComuniPackRemo.Data.From.t_Led.Data.Pulse_current_select = true;
                                                      break;
                                              case 1: //パルス幅設定
                                                      ComuniPackRemo.Data.From.t_Led.Data.Pulse_duty           = true;
                                                      break;
                                              case 2: //パルス周波数
                                                      ComuniPackRemo.Data.From.t_Led.Data.Pulse_frequency      = true;
                                                      break;
                                       }
#endif
                                                      ComuniPackRemo.Data.From.t_Led.Data.Pulse_current_select = true; //2009.01.16
                                                      ComuniPackRemo.Data.From.t_Led.Data.Pulse_duty           = true; //2009.01.16
                                                      ComuniPackRemo.Data.From.t_Led.Data.Pulse_frequency      = true; //2009.01.16
                                       break;
                                default:
                                       break;
                           }
                        } else { //2009.03.06
                                       ComuniPackRemo.Data.From.t_Led.Data.Main_weld_current_select = true; //溶接電流選択
                        }

                        //交流ＴＩＧ設定 2009.01.19
                        //if (guc_Method_condition_data == STD_AC_METHOD || guc_Method_condition_data == EXP_AC_METHOD)
                        if (guc_Method_condition_data == STD_AC_METHOD || guc_Method_condition_data == EXP_AC_METHOD || guc_Method_condition_data == STD_MIX_METHOD) //2009.01.20
                        {
                            ComuniPackRemo.Data.From.t_Led.Data.Cleaning_width_select = true;
                            ComuniPackRemo.Data.From.t_Led.Data.Ac_frequency_select   = true;
                        }

                        if (guc_Method_condition_data == STD_MIX_METHOD) //2009.01.20
                        {
                            ComuniPackRemo.Data.From.t_Led.Data.Mix_frequency         = true; //ＭＩＸ周波数
                            ComuniPackRemo.Data.From.t_Led.Data.Dc_duty               = true; //直流比率
                        }


                        //***********************************

                        //***** モード設定部の表示 2009.01.10*****
                        ComuniPackRemo.Data.From.t_Led.Data.Weld_mode_select         = false; //溶接モード選択
                        ComuniPackRemo.Data.From.t_Led.Data.Ply_mode_select          = false; //再生モード選択
                        ComuniPackRemo.Data.From.t_Led.Data.Rec_mode_select          = false; //記憶モード選択
                        ComuniPackRemo.Data.From.t_Led.Data.Ditail_mode_select       = false; //詳細モード選択
                        switch (guc_Select_counter)	// BP4 Phase6 by @Tny 2009/01/27
                        {
                                case MODE_WELDING: //溶接モード選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Weld_mode_select         = true; //溶接モード選択
                                       break;
                                case MODE_PLAY: //再生モード選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Ply_mode_select          = true; //再生モード選択
                                       break;
                                case MODE_RECORD: //記憶モード選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Rec_mode_select          = true; //記憶モード選択
                                       break;
                                case MODE_DETAILS:
                                       ComuniPackRemo.Data.From.t_Led.Data.Ditail_mode_select       = true; //詳細モード選択
                                       break;
                                default:
                                       break;
                        }
                        //***********************************


                        //***** 点滅表示 2009.01.13 *****
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pre_flow_select            = false; //プリフロー選択
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Init_weld_current_select   = false; //初期電流選択
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Up_slop_select             = false; //アップスロープ選択
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_current_select       = false; //パルス電流選択
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Main_weld_current_select   = false; //溶接電流選択
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Down_slop_spot_select      = false; //ダウンスロープ＆スポット時間選択
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Crater_current_select      = false; //クレータ電流選択
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.After_flow_select          = false; //アフターフロー選択
                        ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency       = false; //周波数
                        ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty            = false; //幅
                        ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second          = false; //秒
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_current_select = false;
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_duty           = false;
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_frequency      = false;
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Cleaning_width_select     = false; //クリーニング幅選択 2009.01.19
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Ac_frequency_select  = false; //2009.01.19
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Mix_frequency        = false; //ＭＩＸ周波数選択 2009.01.20
                        ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Dc_duty              = false; //直流比率 2009.01.20
                        if((guc_Jog_set_key == false)&&(guc_Select_counter == MODE_WELDING))	// BP4 Phase7 by @Tny 2009/02/13
                        {
                          //switch (guc_Sequence_set_data)
                          switch (gus_Sequence_set_data) //2009.01.19
                          {
                                case PREFLOW_SET_DATA:
                                       ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pre_flow_select            = true; //プリフロー選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second                         = true; //秒
                                       all_char_lcd1_set_class("ﾌﾟﾘﾌﾛｰｼﾞｶﾝｾｯﾃｲ  " , 0x0000);
                                       break;
                                case INIT_WELD_CURRENT_SET_DATA:
                                       ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Init_weld_current_select   = true; //初期電流選択
                                       all_char_lcd1_set_class("ｼｮｷﾃﾞﾝﾘｭｳｾｯﾃｲ   " , 0x0000);
                                       break;
                                case UPSLOP_SET_DATA:
                                       ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Up_slop_select             = true; //アップスロープ選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second                         = true; //秒
                                       all_char_lcd1_set_class("ｱｯﾌﾟｽﾛｰﾌﾟｾｯﾃｲ   " , 0x0000);
                                       break;
                                case MAIN_WELD_CURRENT_SET_DATA:
                                       ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Main_weld_current_select   = true; //溶接電流選択
                                       all_char_lcd1_set_class("ﾖｳｾﾂﾃﾞﾝﾘｭｳｾｯﾃｲ  " , 0x0000);

                                       if (guc_Pulse_mode_counter == 1) //2011.10.03
                                       {
                                           if (gss_Select_dital[P_DETAIL_DISPLAY] == true)
                                           {
                                               //all_char_lcd1_set_class(" IP:100A>IB:100A" , 0x0000);
                                               //all_char_lcd2_set_class(" PW: 50% PF:100H" , 0x0000);
                                               pulse_set_class(1);
                                           }
                                       }


                                       break;
                                case DOWNSLOP_SET_DATA:
                                       ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Down_slop_spot_select      = true; //ダウンスロープ＆スポット時間選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second                         = true; //秒
                                       if (guc_Crater_mode_counter != SEQUENCE_ARC_SPOT) //2009.03.06
                                       {
                                           all_char_lcd1_set_class("ﾀﾞｳﾝｽﾛｰﾌﾟｾｯﾃｲ   " , 0x0000);
                                       } else {
                                           all_char_lcd1_set_class("ｽﾎﾟｯﾄｼﾞｶﾝｾｯﾃｲ   " , 0x0000); //2009.03.06
                                       }
                                       break;
                                case CRATER_WELD_CURRENT_SET_DATA:
                                       ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Crater_current_select      = true; //クレータ電流選択
                                       all_char_lcd1_set_class("ｸﾚｰﾀﾃﾞﾝﾘｭｳｾｯﾃｲ  " , 0x0000);
                                       break;
                                case AFTERFLOW_SET_DATA:
                                       ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.After_flow_select          = true; //アフターフロー選択
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second                         = true; //秒
                                       all_char_lcd1_set_class("ｱﾌﾀｰﾌﾛｰｼﾞｶﾝｾｯﾃｲ " , 0x0000);
                                       break;
                                case PULSE_ITEM_SET_DATA:
#if 0
                                       switch(guc_Pulse_item_counter)
                                       {
                                              case 1: //パルス電流設定
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_current_select = true;
                                                      all_char_lcd1_set_class("ﾊﾟﾙｽﾃﾞﾝﾘｭｳｾｯﾃｲ  " , 0x0000);
                                                      break;
                                              case 2: //パルス幅設定
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_duty           = true;
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty                     = true; //幅
                                                      all_char_lcd1_set_class("ﾊﾟﾙｽﾊﾊﾞｾｯﾃｲ     " , 0x0000);
                                                      break;
                                              case 0: //パルス周波数
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_frequency      = true;
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency                = true; //周波数
                                                      all_char_lcd1_set_class("ﾊﾟﾙｽｼｭｳﾊｽｳｾｯﾃｲ  " , 0x0000);
                                                      break;
                                       }
#endif
                                       if (gss_Select_dital[P_DETAIL_DISPLAY] == true)  //2011.10.03
                                       {
                                         switch(guc_Pulse_item_counter)
                                         {
                                              case 1: //パルス電流設定
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_current_select = true;
                                                      //all_char_lcd1_set_class(">IP:100A IB:100A" , 0x0000);
                                                      //all_char_lcd2_set_class(" PW: 50% PF:100H" , 0x0000);
                                                      pulse_set_class(0);
                                                      break;
                                              case 2: //パルス幅設定
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_duty           = true;
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty                     = true; //幅
                                                      //all_char_lcd1_set_class(" IP:100A IB:100A" , 0x0000);
                                                      //all_char_lcd2_set_class(">PW: 50% PF:100H" , 0x0000);
                                                      pulse_set_class(2);
                                                      break;
                                              case 0: //パルス周波数
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_frequency      = true;
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency                = true; //周波数
                                                      //all_char_lcd1_set_class(" IP:100A IB:100A" , 0x0000);
                                                      //all_char_lcd2_set_class(" PW: 50%>PF:100H" , 0x0000);
                                                      pulse_set_class(3);
                                                      break;
                                         }
                                       } else {
                                         switch(guc_Pulse_item_counter)
                                         {
                                              case 1: //パルス電流設定
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_current_select = true;
                                                      all_char_lcd1_set_class("ﾊﾟﾙｽﾃﾞﾝﾘｭｳｾｯﾃｲ  " , 0x0000);
                                                      break;
                                              case 2: //パルス幅設定
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_duty           = true;
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty                     = true; //幅
                                                      all_char_lcd1_set_class("ﾊﾟﾙｽﾊﾊﾞｾｯﾃｲ     " , 0x0000);
                                                      break;
                                              case 0: //パルス周波数
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Pulse_frequency      = true;
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency                = true; //周波数
                                                      all_char_lcd1_set_class("ﾊﾟﾙｽｼｭｳﾊｽｳｾｯﾃｲ  " , 0x0000);
                                                      break;
                                         }
                                       }
                                       break;
                                case AC_TIG_ITEM_SET_DATA: //2009.01.19
                                       switch(guc_Ac_tig_set_counter)
                                       {
                                              case 1: //クリーニング幅選択
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Cleaning_width_select     = true; //クリーニング幅選択
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                                      all_char_lcd1_set_class("ｸﾘｰﾆﾝｸﾞﾊﾊﾞｾｯﾃｲ  " , 0x0000);
                                                      if (guc_Ac_wave_counter == 1) //2009.04.01
                                                      {
                                                        all_char_lcd2_set_class("ﾋｮｳｼﾞｭﾝ:   20%  " , 0x0000); //2009.04.01
                                                      } else {
                                                        all_char_lcd2_set_class("ﾋｮｳｼﾞｭﾝ:   30%  " , 0x0000); //2009.02.19
                                                      }
                                                      break;
                                              case 0: //交流周波数選択
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Ac_frequency_select  = true;
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                                      all_char_lcd1_set_class("ACｼｭｳﾊｽｳｾｯﾃｲ    " , 0x0000);
                                                      //all_char_lcd2_set_class("ﾋｮｳｼﾞｭﾝ:   70Hz " , 0x0000); //2009.02.19 2010.01.20 del

                                                      //<><><> 交流周波数制限値の表示 2010.01.20 <><><>
                                                      if (gss_Select_dital[P_AC_FRQ_DISP] == 0) //無
                                                      {
                                                          all_char_lcd2_set_class("ﾋｮｳｼﾞｭﾝ:   70Hz " , 0x0000);
                                                      } else {                                  //有
                                                          ac_freq_set_class();
                                                      }
                                                      //<><><><><><><><><><><><><><><><><><><><><><><>
                                                      break;
                                              default:
                                                     break;
                                        }
                                        break;
                                case MIX_TIG_ITEM_SET_DATA: //2009.01.20
                                       switch(guc_Mix_tig_set_counter)
                                       {
                                              case 1: //ＭＩＸ周波数選択
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Mix_frequency     = true; //クリーニング幅選択
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                                      all_char_lcd1_set_class("MIXｼｭｳﾊｽｳｾｯﾃｲ   " , 0x0000);
                                                      all_char_lcd2_set_class("ﾋｮｳｼﾞｭﾝ:  1.0Hz " , 0x0000); //2009.02.19
                                                      break;
                                              case 0: //直流比率選択
                                                      ComuniPackRemo.Data.From.t_Led_cntrol_data3.Data.Dc_duty  = true;
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                                      all_char_lcd1_set_class("ﾁｮｸﾘｭｳﾋﾘﾂｾｯﾃｲ   " , 0x0000);
                                                      all_char_lcd2_set_class("ﾋｮｳｼﾞｭﾝ:   30%  " , 0x0000); //2009.02.19
                                                      break;
                                              default:
                                                     break;
                                        }
                                       break;
                                case NO_SET_DATA: //2009.01.19
#if 0
                                       if (guc_Method_condition_data == STD_AC_METHOD || guc_Method_condition_data == EXP_AC_METHOD)
                                       {
                                           switch (guc_Ac_tig_set_counter)
                                           {
                                                case 1: //クリーニング幅選択
                                                        ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                                        all_char_lcd1_set_class("ｸﾘｰﾆﾝｸﾞﾊﾊﾞｾｯﾃｲ  " , 0x0000);
                                                        break;
                                                case 2: //交流周波数選択
                                                        ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                                        all_char_lcd1_set_class("ACｼｭｳﾊｽｳｾｯﾃｲ    " , 0x0000);
                                                        break;
                                                default:
                                                        break;
                                           }
                                       }
#endif
                                       break;
                                default:
                                       all_char_lcd1_set_class("ｱﾌﾀｰﾌﾛｰｼﾞｶﾝｾｯﾃｲ " , 0x0000);
                                       break;
                          }
                        } 
                        //***********************************



                    	if (guc_Gas_on_off_flag == ON) //2007.12.07
                    	{
                        	ComuniPackRemo.Data.From.t_Led.Data.Gas   = true;
                    	} else {
                        	ComuniPackRemo.Data.From.t_Led.Data.Gas   = false;
                    	}
        




                        //選択ＳＷ 2007.12.11
                        //ComuniPackRemo.Data.From.t_Led.Data.Select_weld   = false;
                        //ComuniPackRemo.Data.From.t_Led.Data.Select_dital  = false;
                        //ComuniPackRemo.Data.From.t_Led.Data.Select_record = false;
                        //ComuniPackRemo.Data.From.t_Led.Data.Select_play   = false;
                        //ComuniPackRemo.Data.From.uc_Com_7led_data[6] = 0x02;// 電圧値の小数点
                        switch (guc_Select_counter)	// BP4 Phase6 by @Tny 2009/01/27
                        {
                                    //2008.07.28 ブロックを５→７
                             case MODE_WELDING:
                                  //**** 2008.08.28変更 ****
                                  //ComuniPackRemo.Data.From.t_Led.Data.Select_weld   = true;
                                  if (guc_Adjust_item_counter == 0)
                                  {
                                      char_set_class(7,"V ",false,false,false);
                                  } else {
                                      switch (guc_Pulse_mode_data) //2008.09.16
                                      {
                                           case 0x03: //DC
                                                 char_set_class(7,gc_Dital_unit[gc_Dc_adjust_p_data[guc_Adjust_item_counter]],false,false,false);
                                                 break;
                                           case 0x05: //DCP
                                                 char_set_class(7,gc_Dital_unit[gc_Dp_adjust_p_data[guc_Adjust_item_counter]],false,false,false);
                                                 break;
                                           case 0x83: //AC 2008.09.12
                                                 char_set_class(7,gc_Dital_unit[gc_Ac_adjust_p_data[guc_Adjust_item_counter]],false,false,false);
                                                 break;
                                           case 0x85: //ACP 2008.09.12
                                                 char_set_class(7,gc_Dital_unit[gc_Ap_adjust_p_data[guc_Adjust_item_counter]],false,false,false);
                                                 break;
                                      }
                                  }
                                  //************************
                                  break;
                             case MODE_DETAILS:
                                  //ComuniPackRemo.Data.From.t_Led.Data.Select_dital  = true;
// BP4 Phase3 by @Tny 2009.01.15  gsc_Select_dital_counter = 0;
                                  ComuniPackRemo.Data.From.uc_Com_7led_data[6] = 0x00;// 電圧値の小数点
                                  char_set_class(7,"--",false,false,false);
                                  break;
                             case MODE_PLAY:
                                  //ComuniPackRemo.Data.From.t_Led.Data.Select_record = true;
                                  char_set_class(7,"V ",false,false,false);
                                  break;
                             case MODE_RECORD:
                                  //ComuniPackRemo.Data.From.t_Led.Data.Select_play   = true;
                                  char_set_class(7,"V ",false,false,false);
                                  break;
                         }
        
        
                        //各種設定＋電圧表示＋波形制御　2008.02.25
                        //クレータ無＋クレータ有＋初期／クレータ有　2008.08.21
                   		//ComuniPackRemo.Data.From.t_Led.Data.Non_crater       = false;
                   		//ComuniPackRemo.Data.From.t_Led.Data.Crater           = false;
                   		//ComuniPackRemo.Data.From.t_Led.Data.Initial_crater     = false;
                        switch (guc_Crater_mode_counter)
                        {
                             case 0://クレータ無
                        		//ComuniPackRemo.Data.From.t_Led.Data.Non_crater     = true;
                                break;
                            case 1://クレータ有
                   				//ComuniPackRemo.Data.From.t_Led.Data.Crater         = true;
                                break;
                            case 2://初期・クレータ有
                   				//ComuniPackRemo.Data.From.t_Led.Data.Initial_crater = true;
                                break;
                        }
        
                        //初期＋本電流＋クレータ　2008.02.26
                   		//ComuniPackRemo.Data.From.t_Led.Data.Initial_wled_current   = false;
                   		//ComuniPackRemo.Data.From.t_Led.Data.Main_weld_current      = false;
                   		//ComuniPackRemo.Data.From.t_Led.Data.Crater_wled_current    = false;
        
                        switch (guc_Select_current_sel_counter)
                        {
                            case 0://初期
                   		        //ComuniPackRemo.Data.From.t_Led.Data.Initial_wled_current   = true;
                                break;
                            case 1://本電流
                   		        //ComuniPackRemo.Data.From.t_Led.Data.Main_weld_current      = true;
                                break;
                            case 2://クレータ
                   		        //ComuniPackRemo.Data.From.t_Led.Data.Crater_wled_current    = true;
                                break;
                        }
                }
                    	//REMO_Send_CMD(0x22);
                        //if (guc_Sequence_mode != IDLING) //2009.02.09
                        //{
                        //    gtt_Ctrl_flag.Current_set_out2 = OFF;
                        //}
                        


                    	//REMO_Send_CMD(0x38); //2009.01.09
                    	//REMO_Send_CMD(0x39); //2009.01.13
                        
                    	guc_Sw_rewrite_check_flag = 0;
        	}


            //<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
            //if (guc_Sequence_mode == IDLING && gtt_Ctrl_flag.Current_set_out1 == OFF) //2009.01.28
            //if (guc_Sequence_mode == IDLING) //2009.02.09
            if (guc_Sequence_mode == IDLING || guc_Sequence_mode == HF_CTRL || guc_Sequence_mode == AFTER_FLOW) //2009.02.12
            {
                gtt_Ctrl_flag.Current_set_out1 = ON; 
                gtt_Ctrl_flag.Current_set_out2 = OFF; 
                ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false;
                ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = true;
                ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = false;
                //ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                //ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                //ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                
                //REMO_Send_CMD(0x38); //2009.01.09
                          switch (gus_Sequence_set_data) //2009.01.19
                          {
                                case PREFLOW_SET_DATA:
                                case UPSLOP_SET_DATA:
                                case DOWNSLOP_SET_DATA:
                                case AFTERFLOW_SET_DATA:
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = true; //秒
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                       break;
                                case INIT_WELD_CURRENT_SET_DATA:
                                case MAIN_WELD_CURRENT_SET_DATA:
                                case CRATER_WELD_CURRENT_SET_DATA:
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                       ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                       break;
                                case PULSE_ITEM_SET_DATA:
                                       switch(guc_Pulse_item_counter)
                                       {
                                              case 1: //パルス電流設定
                                                      break;
                                              case 2: //パルス幅設定
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                                      break;
                                              case 0: //パルス周波数
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                                      break;
                                       }
                                       break;
                                case AC_TIG_ITEM_SET_DATA: //2009.01.19
                                       switch(guc_Ac_tig_set_counter)
                                       {
                                              case 1: //クリーニング幅選択
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                                      break;
                                              case 0: //交流周波数選択
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                                      break;
                                              default:
                                                     break;
                                        }
                                        break;
                                case MIX_TIG_ITEM_SET_DATA: //2009.01.20
                                       switch(guc_Mix_tig_set_counter)
                                       {
                                              case 1: //ＭＩＸ周波数選択
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                                      break;
                                              case 0: //直流比率選択
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                                      break;
                                              default:
                                                     break;
                                        }
                                       break;
                                case NO_SET_DATA: //2009.01.19
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒 2009.02.13
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅 2009.02.13
                                                      ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数 2009.02.13
                                       break;
                                default:
                                       break;
                          }


                          //***** 出力結果出力中はＬＥＤ消す 2009.03.16 *****
                          if (gtt_End_welding_display.bProc1 == true)
                          {
                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false;
                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = false;
                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = false;
                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒 2009.02.13
                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅 2009.02.13
                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数 2009.02.13
                          }
                          //*************************************************



            }
            //if (guc_Sequence_mode != IDLING && gtt_Ctrl_flag.Current_set_out2 == OFF) //2009.01.28
            //if (guc_Sequence_mode != IDLING) //2009.02.09
            if((guc_Sequence_mode >= INITIAL_WELD) && (guc_Sequence_mode <= BURN_BACK)) //2009.02.12変更
            {
                gtt_Ctrl_flag.Current_set_out1 = OFF; 
                gtt_Ctrl_flag.Current_set_out2 = ON; 
                
#if 0
                if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                {
                    ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage = true;
                } else {
                    ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage = false;
                }
#endif
                if (gtt_Ctrl_flag.Pre_set == ON)
                {
                    ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage = false;
                    switch (gus_Sequence_set_data) //2009.01.19
                    {
                        case PREFLOW_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = true; //秒
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                               break;
                        case INIT_WELD_CURRENT_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false;
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = true;
                               if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                               {
                                   ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = true;
                               }
                               break;
                        case UPSLOP_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = true; //秒
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                               break;
                        case MAIN_WELD_CURRENT_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false;
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = true;
                               if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                               {
                                   ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = true;
                               }
                               break;
                        case DOWNSLOP_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = true; //秒
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                               break;
                        case CRATER_WELD_CURRENT_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false;
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = true;
                               if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                               {
                                   ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = true;
                               }
                               break;
                        case AFTERFLOW_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = true; //秒
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                               break;
                        case PULSE_ITEM_SET_DATA:
                               switch(guc_Pulse_item_counter)
                               {
                                      case 1: //パルス電流設定
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false;
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = true;
                                              if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                                              {
                                                  ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = true;
                                              }
                                              break;
                                      case 2: //パルス幅設定
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                              break;
                                      case 0: //パルス周波数
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                              break;
                               }
                               break;
                        case AC_TIG_ITEM_SET_DATA: //2009.01.19
                               switch(guc_Ac_tig_set_counter)
                               {
                                      case 1: //クリーニング幅選択
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                              break;
                                      case 0: //交流周波数選択
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                              break;
                                      default:
                                            break;
                               }
                               break;
                        case MIX_TIG_ITEM_SET_DATA: //2009.01.20
                               switch(guc_Mix_tig_set_counter)
                               {
                                      case 1: //ＭＩＸ周波数選択
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                              break;
                                      case 0: //直流比率選択
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                              break;
                                      default:
                                             break;
                               }
                               break;
                        case NO_SET_DATA: //2009.01.19
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒 2009.02.13
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅 2009.02.13
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数 2009.02.13
                               break;
                        default:
                               break;
                    }
                } else {
                    ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = true;
                    ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = false;
                    if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                    {
                        ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage = true;
                        ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                        ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                        ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                    } else {
                        switch (gus_Sequence_set_data) //2009.02.17
                        {
                            case PREFLOW_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = true; //秒
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                               break;
                            case INIT_WELD_CURRENT_SET_DATA:
                               //ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false; 2009.02.18 del
                               //ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = true;  2009.02.18 del
                               if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                               {
                                   ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = true;
                               }
                               break;
                            case UPSLOP_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = true; //秒
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                               break;
                            case MAIN_WELD_CURRENT_SET_DATA:
                               //ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false; 2009.02.18 del
                               //ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = true;  2009.02.18 del
                               if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                               {
                                   ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = true;
                               }
                               break;
                            case DOWNSLOP_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = true; //秒
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                               break;
                            case CRATER_WELD_CURRENT_SET_DATA:
                               //ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false; 2009.02.18 del
                               //ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = true;  2009.02.18 del
                               if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                               {
                                   ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = true;
                               }
                               break;
                            case AFTERFLOW_SET_DATA:
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = true; //秒
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                               ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                               break;
                            case PULSE_ITEM_SET_DATA:
                               switch(guc_Pulse_item_counter)
                               {
                                      case 1: //パルス電流設定
                                              //ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_out      = false; 2009.02.18 del
                                              //ComuniPackRemo.Data.From.t_Led.Data.Seg_led1_current_set      = true;  2009.02.18 del
                                              if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.02.09
                                              {
                                                  ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage          = true;
                                              }
                                              break;
                                      case 2: //パルス幅設定
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                              break;
                                      case 0: //パルス周波数
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                              break;
                               }
                               break;
                            case AC_TIG_ITEM_SET_DATA: //2009.01.19
                               switch(guc_Ac_tig_set_counter)
                               {
                                      case 1: //クリーニング幅選択
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                              break;
                                      case 0: //交流周波数選択
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                              break;
                                      default:
                                            break;
                               }
                               break;
                            case MIX_TIG_ITEM_SET_DATA: //2009.01.20
                               switch(guc_Mix_tig_set_counter)
                               {
                                      case 1: //ＭＩＸ周波数選択
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = true; //周波数
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅
                                              break;
                                      case 0: //直流比率選択
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = true; //幅
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数
                                              break;
                                      default:
                                             break;
                               }
                               break;
                            case NO_SET_DATA: //2009.01.19
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage = false;
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒 2009.02.13
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅 2009.02.13
                                              ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数 2009.02.13
                               break;
                            default:
                               break;
                        }
                        //ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_voltage = false;
                        //ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_second           = false; //秒 2009.02.13
                        //ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_duty             = false; //幅  2009.02.13
                        //ComuniPackRemo.Data.From.t_Led.Data.Seg_led2_frequency        = false; //周波数 2009.02.13
                    }
                }
                //REMO_Send_CMD(0x38); //2009.01.09
            }


        }


        //温度異常時のＬＥＤ点灯処理 2009.03.13
        if (guc_Error_code == ABNORMAL_TEMP_ERR) 
        {
            ComuniPackRemo.Data.From.t_Led.Data.Temp_abnormal = true;
        } else {
            ComuniPackRemo.Data.From.t_Led.Data.Temp_abnormal = false;
        }
      

        //<><><> 交流周波数制限値の表示 2010.01.20 <><><>
        if (gus_Sequence_set_data ==  AC_TIG_ITEM_SET_DATA && guc_Ac_tig_set_counter == 0 && gtt_Ctrl_flag.Ac_freq_jog == ON)
        {
            gtt_Ctrl_flag.Ac_freq_jog = OFF;
            if (gss_Select_dital[P_AC_FRQ_DISP] == 1)
            {
                ac_freq_set_class();
            }
        }
        //<><><><><><><><><><><><><><><><><><><><><><><>


        //<><><><><> パルス詳細表示 2011.10.03 <><><><><>
        if (guc_Pulse_mode_counter == 1 && gtt_Ctrl_flag.Pl_pram_jog == ON)
        {
            gtt_Ctrl_flag.Pl_pram_jog = OFF;
            if (gss_Select_dital[P_DETAIL_DISPLAY] == true)
            {
                if (gus_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA)
                {
                    pulse_set_class(1);
                }
                if (gus_Sequence_set_data == PULSE_ITEM_SET_DATA)
                {
                    switch(guc_Pulse_item_counter)
                    {
                           case 1: //パルス電流設定
                                pulse_set_class(0);
                                break;
                           case 2: //パルス幅設定
                                pulse_set_class(2);
                                break;
                           case 0: //パルス周波数
                                pulse_set_class(3);
                                break;
                    }
                }
            }
        }
        //<><><><><><><><><><><><><><><><><><><><><><><><><><>


        
//----------------------------
// BP4 Phase12 by @Tny 2009.02.19
	if((guc_Select_counter == MODE_WELDING) && ((gus_Sequence_set_data == AC_TIG_ITEM_SET_DATA) || (gus_Sequence_set_data == MIX_TIG_ITEM_SET_DATA))){
		gb_Volt7SegBlink = false;
		if(gus_Sequence_set_data == AC_TIG_ITEM_SET_DATA){
			//if((guc_Ac_tig_set_counter == 1) && (gtt_Internal_pack.Data.In.ucCleaningDuty == 30)){
			if((guc_Ac_tig_set_counter == 1) && (gtt_Internal_pack.Data.In.ucCleaningDuty == 30) && (guc_Ac_wave_counter != 1)){ //2009.04.01
				gb_Volt7SegBlink = true;
			}
			if((guc_Ac_tig_set_counter == 1) && (gtt_Internal_pack.Data.In.ucCleaningDuty == 20) && (guc_Ac_wave_counter == 1)){ //2009.04.01
				gb_Volt7SegBlink = true;
			}
			if((guc_Ac_tig_set_counter == 0) && (gtt_Internal_pack.Data.In.usAcFreq == 70)){
				gb_Volt7SegBlink = true;
			}
		}
		else if(gus_Sequence_set_data == MIX_TIG_ITEM_SET_DATA){
			if((guc_Mix_tig_set_counter == 1) && (gtt_Internal_pack.Data.In.ucMixFreq == 10)){
				gb_Volt7SegBlink = true;
			}
			if((guc_Mix_tig_set_counter == 0) && (gtt_Internal_pack.Data.In.ucMixAcRatio == 30)){
				gb_Volt7SegBlink = true;
			}
		}
		if(gb_Volt7SegBlink){
			if(bBlink_Check == false){
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no			 = 10;
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 1;	//点滅表示の有り無し
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 10;	//点滅時点灯時間
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 10;	//点滅時消灯時間
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;	//点滅繰り返し回数
                //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
											REMO_Send_CMD(0x23);
#else
											gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
				bBlink_Check = true;
			}
		}
		else{
			if(bBlink_Check == true){
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no			 = 0;
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 0;	//点滅表示の有り無し
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 10;	//点滅時点灯時間
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 10;	//点滅時消灯時間
				ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;	//点滅繰り返し回数
                //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
											REMO_Send_CMD(0x23);
#else
											gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
				bBlink_Check = false;
			}
		}
	}
	else{
		//if(bBlink_Check == true){
		if(bBlink_Check == true && gtt_End_welding_display.bProc1  == false){ //2009.03.16
			ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no			 = 0;
			ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 0;	//点滅表示の有り無し
			ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 10;	//点滅時点灯時間
			ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 10;	//点滅時消灯時間
			ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 100;	//点滅繰り返し回数
            //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
											REMO_Send_CMD(0x23);
#else
											gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
			bBlink_Check = false;
		}
	}
//----------------------------





#if false //@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@	Debug!! 2011.10.07 by @Tny
if(gb_External_IIF){

#if 1
	short	i;
	for(i=1;i<=IIF_INPUT_GP_IN3;i++){
		if(guc_In_port[3][i] == ON){
			xmemcpy(&ComuniPackRemo.Data.From.uc_Com_lcd_data2[5], guc_Dital_Iif_IN_Select[i], 6);
			break;
		}
	}


#else
	short i;

    for(i = 0 ; i < 10 ; i++){
		if(((InternalPackIif.Data.To.us_Iif_input_data >> i) & 0x0001) == 0x0001){
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[i+2] = '1';
		}
		else{
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[i+2] = '0';
		}
	}
#endif

}
#endif //@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@






// Phase2(Debug) 2008/09/02 @Tny
//
if(guc_Fram_Phase <= 0){    // FRAM転送中は表示コマンドを送らない

        // 2007.12.14　転送周期を１００ｍＳ→２００ｍＳに変更（負担軽減のため）2007.12.19　２００ｍＳ→１００ｍＳに変更（ＰＣ通信とバッティングしＰＣが正常通信できないため）
        if(Timer._200m != gtt_Ctrl_counter.Backup_100m && ComuniPackRemo.Data.bRS422Connection && gus_Initial_timer == 0)	// 500m秒経過した？
        {
           

//--------------------------------------------------------------------
//BP4 Phase13 by @Tny 2009.02.23
	if((gb_ServiceMenu)||(gb_RescueMenu)){
	}
	else{

     //<><><><> 2011.10.03 <><><><>
     if ((gus_Sequence_set_data == PULSE_ITEM_SET_DATA) || ((gus_Sequence_set_data == MAIN_WELD_CURRENT_SET_DATA)&&(guc_Pulse_mode_counter == 1)))
     {
         if (gss_Select_dital[P_DETAIL_DISPLAY] == true)
         {
             gtt_Ctrl_flag.Detail_display = ON;
         } else {
             gtt_Ctrl_flag.Detail_display = OFF;
         }
     } else {
         gtt_Ctrl_flag.Detail_display = OFF;
     }

     //<><><><><><><><><><><><><><><>


//--------------------------------------------------------------------
//--------- BP4 Phase2&Phase4 by @Tny 2009/01/15 ------------
#if true // ＲＴＣ動作
	//if(guc_Select_counter == MODE_WELDING && guc_Method_condition_counter != 4){	// 溶接待機なら表示	BP4 Phase3 by @Tny 2009.01.13	// BP4 Phase6 by @Tny 2009/01/27
	//if(guc_Select_counter == MODE_WELDING && guc_Method_condition_counter != 4 && (gus_Sequence_set_data != AC_TIG_ITEM_SET_DATA && gus_Sequence_set_data != MIX_TIG_ITEM_SET_DATA)){	// 溶接待機なら表示	BP4 Phase3 by @Tny 2009.01.13	// BP4 Phase6 by @Tny 2009/01/27 2009.02.19
	if(guc_Select_counter == MODE_WELDING && guc_Method_condition_counter != 4 && (gus_Sequence_set_data != AC_TIG_ITEM_SET_DATA && gus_Sequence_set_data != MIX_TIG_ITEM_SET_DATA) && (gtt_Ctrl_flag.Detail_display == OFF)){	// 2011.10.03

//-----------------------------------------------------------------------------------------------------------------------------------------------
// <NAVI Enhancements(Phase 1)> 2011.10.26 by @Tny
//
	//-----------------------------------------------------------------------------------------------------------------------------------------------
	// <NAVI Enhancements(Phase 2)> 2011.10.27 by @Tny
	//
		//-----------------------------------------------------------------------------------------------------------------------------------------------
		// <NAVI Enhancements(Phase 3)> 2011.11.28
		//
#if true
		if(guc_Sequence_mode != IDLING){	// 何かしらの動作を行った
			if(gtt_Navi.b_Navi_Disp){	// ナビ表示フラグ：表示
				uchar   i;
				for(i=0;i<16;i++){
					ComuniPackRemo.Data.From.uc_Com_lcd_data1[i]  = ' ';
					ComuniPackRemo.Data.From.uc_Com_lcd_data2[i]  = ' ';
				}
				gtt_Navi.b_Navi_Disp	= false;	// ナビ表示フラグ：非表示
			}
		}
#else
		if((guc_Sequence_mode >= INITIAL_WELD) && (guc_Sequence_mode <= CRATER_WELD)){ //溶接期間中？
			gtt_Navi.b_Navi_Disp	= false;	// ナビ表示フラグ：非表示
		}
#endif
	//-----------------------------------------------------------------------------------------------------------------------------------------------
		if(gtt_Navi.b_Navi_Disp){	// ナビ表示フラグ：表示
			//１行目データ
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[0]  = 'ｶ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[1]  = 'ﾞ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[2]  = 'ｽ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[3]  = ':';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[4]  = gc_Navi_gas_char[gtt_Navi.us_Gas_Navi][0];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[5]  = gc_Navi_gas_char[gtt_Navi.us_Gas_Navi][1];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[6]  = 'L';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[7]  = ' ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[8]  = 'ﾌ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[9]  = 'ｨ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[10] = 'ﾗ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[11] = 'ｰ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[12] = ':';
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[13] = gc_Navi_filler_char[gtt_Navi.us_Filler_navi][0];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[14] = gc_Navi_filler_char[gtt_Navi.us_Filler_navi][1];
			ComuniPackRemo.Data.From.uc_Com_lcd_data1[15] = gc_Navi_filler_char[gtt_Navi.us_Filler_navi][2];
			//２行目
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[0]  = 'ﾃ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[1]  = 'ﾞ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[2]  = 'ﾝ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[3]  = 'ｷ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[4]  = 'ｮ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[5]  = 'ｸ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[6]  = ':';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[7]  = gc_Navi_electroad_char[gtt_Navi.us_Electroad_navi][0];
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[8]  = gc_Navi_electroad_char[gtt_Navi.us_Electroad_navi][1];
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[9]  = gc_Navi_electroad_char[gtt_Navi.us_Electroad_navi][2];
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[10] = '(';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[11] = gc_Navi_el_rd_angle_char[gtt_Navi.us_El_rd_angle_navi][0];
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[12] = gc_Navi_el_rd_angle_char[gtt_Navi.us_El_rd_angle_navi][1];
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[13] = 'ﾟ';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[14] = ')';
			ComuniPackRemo.Data.From.uc_Com_lcd_data2[15] = ' ';
		}
		else{
//-----------------------------------------------------------------------------------------------------------------------------------------------
		if(gus_RTC_cDebug_1 <= 0){
			uchar   i,Data[10];

			for(i=0;i<16;i++){
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[i]  = ' ';
			}
		    gus_RTC_cDebug_1 = 50000;    // 5sec
			if(gss_Select_dital[P_DATE_TIME_DISPLAY] == 0){
	        	// 設定時刻の読み込み（リアルタイムデータ１）
		        I2C_RTC(RTC_READ, Data, RTC_DATA_1, RTC_DATA_1_LENGTH);
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 7]  = 0x27;	// ← 「'」
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 8]  = ('0' + ((Data[0] & 0xf0) >> 4));
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[ 9]  = ('0' + (Data[0] & 0x0f));
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[10]  = '/';
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[11]  = ('0' + ((Data[1] & 0x10) >> 4));
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[12]  = ('0' + (Data[1] & 0x0f));
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[13]  = '/';
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[14]  = ('0' + ((Data[2] & 0x30) >> 4));
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[15]  = ('0' + (Data[2] & 0x0f));
			}
			else if(gss_Select_dital[P_DATE_TIME_DISPLAY] == 1){
	        	// 設定時刻の読み込み（リアルタイムデータ１）
		        I2C_RTC(RTC_READ, Data, RTC_DATA_1, RTC_DATA_1_LENGTH);
				if(((Data[4] & 0x30) >> 4) > 0){
	        		ComuniPackRemo.Data.From.uc_Com_lcd_data2[10]  = ('0' + ((Data[4] & 0x30) >> 4));
				}
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[11]  = ('0' + (Data[4] & 0x0f));
	        	if(gb_RTC_Sec_Colon){
					ComuniPackRemo.Data.From.uc_Com_lcd_data2[12]  = ':';
					gb_RTC_Sec_Colon = false;	// 次回は非表示
				}
				else{
					gb_RTC_Sec_Colon = true;	// 次回は表示
				}
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[13]  = ('0' + ((Data[5] & 0x70) >> 4));
	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[14]  = ('0' + (Data[5] & 0x0f));
//	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[13]  = ':';
//	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[14]  = ('0' + ((Data[6] & 0x70) >> 4));
//	        	ComuniPackRemo.Data.From.uc_Com_lcd_data2[15]  = ('0' + (Data[6] & 0x0f));
		        gus_RTC_cDebug_1 = 10000;    // 1sec
			}
		}
//---------------------------------------
// リモコン接続状態の表示	BP4 Phase11 by @Tny 2009.02.19
		if(guc_Select_counter == MODE_WELDING){
			if(gtt_Ctrl_flag.RemoteController){
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[0]	= '[';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[1]	= 'ﾘ';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[2]	= 'ﾓ';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[3]	= 'ｺ';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[4]	= 'ﾝ';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[5]	= ']';
			}
			else{
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[0]	= ' ';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[1]	= ' ';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[2]	= ' ';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[3]	= ' ';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[4]	= ' ';
				ComuniPackRemo.Data.From.uc_Com_lcd_data2[5]	= ' ';
			}
		}
//---------------------------------------
//-----------------------------------------------------------------------------------------------------------------------------------------------
// <NAVI Enhancements(Phase 1)> 2011.10.26 by @Tny
//
		}
//-----------------------------------------------------------------------------------------------------------------------------------------------

	}
	//--------------------------------------------------------
	// BP4 Phase9 by @Tny 2009.02.17
	else{
		gus_RTC_cDebug_1 = 0;    // 次回即時ＲＴＣ値設定
	}
	//--------------------------------------------------------
#endif
//--------------------------------------------
//--------------------------------------------------------------------
//BP4 Phase13 by @Tny 2009.02.23
	}
//--------------------------------------------------------------------

//----- Phase4 by @Tny 2008/09/08 -----
#if false	// <EXTERNAL IIF NEW(Phase 2)>	2011.10.12 by @Tny

        if(gb_IIF_Select){  // IIF接続を確認
            if(gb_Iif_comuni_failed){
                if(gus_Iff_Detect_disp_timer > 0){   // IIF検出表示タイマー
//--------- Phase20by @Tny 2008/10/01 --------
#if false
                    short   i;
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 0]  = 'I';  // Phase16 by @Tny 2008/09/22
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 1]  = '/';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 2]  = 'F';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 3]  = ' ';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 4]  = 'L';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 5]  = 'I';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 6]  = 'N';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 7]  = 'K';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 8]  = ' ';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[ 9]  = 'F';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[10]  = 'A';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[11]  = 'I';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[12]  = 'L';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[13]  = 'E';
                    ComuniPackRemo.Data.From.uc_Com_16led_data[14]  = ('D'|0x80);
                    ComuniPackRemo.Data.From.uc_Com_16led_data[15]  = ' ';
                    //REMO_Send_CMD(0x20);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x20);
#else
					gb_RemCom_0x20	= true;
#endif
#endif
//--------------------------------------------
                }
//                else{
//                    gb_Iif_comuni_failed                            = false;
//                }
            }
            else{
                if(gus_Iff_Detect_disp_timer > 1000){   // IIF検出表示タイマー
                }
                else{
                    if(gus_Iff_Detect_disp_timer > 0){
                        short   i;
                        for(i=0;i<18;i++){
                            ComuniPackRemo.Data.From.uc_Com_16led_data[i] = BackUp16LedData[i];
                            gus_Iff_Detect_disp_timer = 0;
                        }
                        //REMO_Send_CMD(0x20);
                        //REMO_Send_CMD(0x34); //2009.01.13
                        //REMO_Send_CMD(0x35); //2009.01.13
                    	//REMO_Send_CMD(0x38); //2009.02.09
                    	//REMO_Send_CMD(0x39); //2009.02.09
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
                        REMO_Send_CMD(0x34); //2009.01.13
                        REMO_Send_CMD(0x35); //2009.01.13
#else
						gb_RemCom_0x34	= true;
						gb_RemCom_0x35	= true;
#endif
//-----------------------------------------------------------
                    }
                }
            }
        }

#endif
//--------------------------------------------
//----- Phase11 by @Tny 2008/09/16 -----
#if false	// BP4 Phase13 by @Tny 2009.02.23
    if((guc_Sequence_mode > IDLING) && (guc_Sequence_mode < BURN_BACK)){
        unsigned short  Val1;
        ubool            bZero;

        switch(gss_Select_dital[P_SUB_MONITOR]){
            case 1:{
                    guc_Sub_16Led_display[ 0]   = 'M';
                    guc_Sub_16Led_display[ 1]   = 'O';
                    guc_Sub_16Led_display[ 2]   = 'T';
                    guc_Sub_16Led_display[ 3]   = 'O';
                    guc_Sub_16Led_display[ 4]   = 'R';
                    // モータ電流
                    Val1 = gtt_Internal_pack.Data.Out.ucMotorCurr2; // X.X A
                    if((Val1 / 100) > 0)    guc_Sub_16Led_display[ 5] = (Val1 / 100);
                    else                    guc_Sub_16Led_display[ 5] = ' ';
                    Val1 = (Val1 % 100);
                    if((Val1 / 10) > 0)     guc_Sub_16Led_display[ 6] = ((Val1 / 10) | 0x80);
                    else                    guc_Sub_16Led_display[ 6] = (0 | 0x80);
                    if((Val1 % 10) > 0)     guc_Sub_16Led_display[ 7] = (Val1 % 10);
                    else                    guc_Sub_16Led_display[ 7] = 0;
                    guc_Sub_16Led_display[ 8]   = 'A';
                    guc_Sub_16Led_display[ 9]   = ' ';
                    // モータ回転数
                    Val1 = gtt_Internal_pack.Data.Out.usMotorRPM2;  // X rpm
//--------- Phase33 by @Tny 2008/11/28 --------
#if true
                    if((Val1 / 1000) > 0){
                        guc_Sub_16Led_display[9] = (Val1 / 1000);
                        bZero   = true;
                    }
                    else{
                        guc_Sub_16Led_display[9] = ' ';
                        bZero   = false;
                    }
                    Val1 = (Val1 % 1000);
                    if((Val1 / 100) > 0){
                        guc_Sub_16Led_display[10] = (Val1 / 100);
                        bZero   = true;
                    }
                    else{
                        if(bZero) guc_Sub_16Led_display[10] = 0;
                        else      guc_Sub_16Led_display[10] = ' ';
                        bZero   = false;
                    }
#endif
//--------------------------------------------
                    Val1 = (Val1 % 100);
//--------- Phase25 by @Tny 2008/10/22 --------
#if true
                    guc_Sub_16Led_display[11] = ((Val1 / 10) | 0x80);
#else
                    if((Val1 / 10) > 0){
                        guc_Sub_16Led_display[11] = (Val1 / 10);
                    }
                    else{
                        if(bZero) guc_Sub_16Led_display[11] = 0;
                        else      guc_Sub_16Led_display[11] = ' ';
                    }
#endif
//--------------------------------------------
                    if((Val1 % 10) > 0)     guc_Sub_16Led_display[12] = (Val1 % 10);
                    else                    guc_Sub_16Led_display[12] = 0;
                    guc_Sub_16Led_display[13]   = 'R';
                    guc_Sub_16Led_display[14]   = 'P';
                    guc_Sub_16Led_display[15]   = 'M';
                    break;}
            case 2:{
                    // 短絡数
                    guc_Sub_16Led_display[ 0]   = 'I';
                    guc_Sub_16Led_display[ 1]   = 'M';
                    guc_Sub_16Led_display[ 2]   = 'P';
                    guc_Sub_16Led_display[ 3]   = 'R';
                    guc_Sub_16Led_display[ 4]   = 'U';
                    guc_Sub_16Led_display[ 5]   = 'D';
                    guc_Sub_16Led_display[ 6]   = 'E';
                    guc_Sub_16Led_display[ 7]   = 'N';
                    guc_Sub_16Led_display[ 8]   = 'C';
                    guc_Sub_16Led_display[ 9]   = 'E';
                    Val1 = gtt_Internal_pack.Data.Out.ucImprudence; // X
                    if((Val1 / 100) > 0){
                        guc_Sub_16Led_display[10] = (Val1 / 100);
                        bZero   = true;
                    }
                    else{
                        guc_Sub_16Led_display[10] = ' ';
                        bZero   = false;
                    }
                    Val1 = (Val1 % 100);
                    if((Val1 / 10) > 0){
                        guc_Sub_16Led_display[11] = (Val1 / 10);
                    }
                    else{
                        if(bZero) guc_Sub_16Led_display[11] = 0;
                        else      guc_Sub_16Led_display[11] = ' ';
                    }
                    if((Val1 % 10) > 0)     guc_Sub_16Led_display[12] = (Val1 % 10);
                    else                    guc_Sub_16Led_display[12] = 0;
                    guc_Sub_16Led_display[13]   = ' ';
                    guc_Sub_16Led_display[14]   = ' ';
                    guc_Sub_16Led_display[15]   = ' ';
                    break;}
        }
    }
#endif
//--------------------------------------------


//----- Phase12 by @Tny 2008/09/17 -----
#if true
    { // 溶接終了後表示処理
        //if(guc_Sequence_mode == MAIN_WELD){ //溶接期間中のモニタ値（電流／電圧など）を記憶
        //if(guc_Sequence_mode == INITIAL_WELD || guc_Sequence_mode == MAIN_WELD || guc_Sequence_mode == CRATER_WELD){ //溶接期間中のモニタ値（電流／電圧など）を記憶 //2009.03.16
        if(guc_Sequence_mode >= INITIAL_WELD && guc_Sequence_mode <= CRATER_WELD){ //溶接期間中のモニタ値（電流／電圧など）を記憶 //2009.03.26
//        if(guc_Sequence_mode >= SLOW_DOWN){ //溶接期間中のモニタ値（電流／電圧など）を記憶  @@@@@@@@ デバッグ用
            gtt_End_welding_display.us_MainWeldingCurr  = gss_Current_work;
            gtt_End_welding_display.us_MainWeldingVolt  = gss_Voltage_work;
//----- Phase19 by @Tny 2008/09/26 -----
#if true
            gtt_End_welding_display.us_MainMotorCurr  = gtt_Internal_pack.Data.Out.ucMotorCurr2; // X.X A
            gtt_End_welding_display.us_MainMotorRPM   = gtt_Internal_pack.Data.Out.usMotorRPM2;  // X rpm
            gtt_End_welding_display.us_MainImprudence = gtt_Internal_pack.Data.Out.ucImprudence; // X
#endif
//--------------------------------------------
            if (gub_System_err == OFF) //2008.10.30
            {
                gtt_End_welding_display.bProc1              = true;
                gtt_End_welding_display.bProc2              = true;
            } else {
                gtt_End_welding_display.bProc1              = false;
                gtt_End_welding_display.bProc2              = false;
            }
        }
        else if((guc_Sequence_mode == IDLING) || (guc_Sequence_mode == AFTER_FLOW) || (guc_Sequence_mode == IDLING2)){
            //if(gss_Select_dital[P_WELD_ENDING] > 0){
            //if((gss_Select_dital[P_WELD_ENDING] > 0) && (gub_System_err == OFF)){ //2008.10.30
            if((gss_Select_dital[P_DISPLAY_HOLD_TIME] > 0) && (gub_System_err == OFF)){ //2009.03.16
                if(gtt_End_welding_display.bProc2){
                    unsigned short  Val;
                    ubool            bZero;
//----- Phase19 by @Tny 2008/09/26 -----
#if true
                    switch(gss_Select_dital[P_SUB_MONITOR]){
                        case 1:{
                                guc_Sub_16Led_display[ 0]   = 'M';
                                guc_Sub_16Led_display[ 1]   = 'O';
                                guc_Sub_16Led_display[ 2]   = 'T';
                                guc_Sub_16Led_display[ 3]   = 'O';
                                guc_Sub_16Led_display[ 4]   = 'R';
                                // モータ電流
                                Val = gtt_End_welding_display.us_MainMotorCurr; // X.X A
                                if((Val / 100) > 0)     guc_Sub_16Led_display[ 5] = (Val / 100);
                                else                    guc_Sub_16Led_display[ 5] = ' ';
                                Val = (Val % 100);
                                if((Val / 10) > 0)      guc_Sub_16Led_display[ 6] = ((Val / 10) | 0x80);
                                else                    guc_Sub_16Led_display[ 6] = (0 | 0x80);
                                if((Val % 10) > 0)      guc_Sub_16Led_display[ 7] = (Val % 10);
                                else                    guc_Sub_16Led_display[ 7] = 0;
                                guc_Sub_16Led_display[ 8]   = 'A';
                                guc_Sub_16Led_display[ 9]   = ' ';
                                // モータ回転数
                                Val = gtt_End_welding_display.us_MainMotorRPM;  // X rpm
//--------- Phase33 by @Tny 2008/11/28 --------
#if true
			                    if((Val / 1000) > 0){
			                        guc_Sub_16Led_display[9] = (Val / 1000);
			                        bZero   = true;
			                    }
			                    else{
			                        guc_Sub_16Led_display[9] = ' ';
			                        bZero   = false;
			                    }
			                    Val = (Val % 1000);
			                    if((Val / 100) > 0){
			                        guc_Sub_16Led_display[10] = (Val / 100);
			                        bZero   = true;
			                    }
			                    else{
			                        if(bZero) guc_Sub_16Led_display[10] = 0;
			                        else      guc_Sub_16Led_display[10] = ' ';
			                        bZero   = false;
			                    }
#endif
//--------------------------------------------
                                Val = (Val % 100);
//--------- Phase25 by @Tny 2008/10/22 --------
#if true
                                guc_Sub_16Led_display[11] = ((Val / 10) | 0x80);
#else
                                if((Val / 10) > 0){
                                    guc_Sub_16Led_display[11] = (Val / 10);
                                }
                                else{
                                    if(bZero) guc_Sub_16Led_display[11] = 0;
                                    else      guc_Sub_16Led_display[11] = ' ';
                                }
#endif
//--------------------------------------------
                                if((Val % 10) > 0)      guc_Sub_16Led_display[12] = (Val % 10);
                                else                    guc_Sub_16Led_display[12] = 0;
                                guc_Sub_16Led_display[13]   = 'R';
                                guc_Sub_16Led_display[14]   = 'P';
                                guc_Sub_16Led_display[15]   = 'M';
                                break;}
                        case 2:{
                                // 短絡数
                                guc_Sub_16Led_display[ 0]   = 'I';
                                guc_Sub_16Led_display[ 1]   = 'M';
                                guc_Sub_16Led_display[ 2]   = 'P';
                                guc_Sub_16Led_display[ 3]   = 'R';
                                guc_Sub_16Led_display[ 4]   = 'U';
                                guc_Sub_16Led_display[ 5]   = 'D';
                                guc_Sub_16Led_display[ 6]   = 'E';
                                guc_Sub_16Led_display[ 7]   = 'N';
                                guc_Sub_16Led_display[ 8]   = 'C';
                                guc_Sub_16Led_display[ 9]   = 'E';
                                Val = gtt_End_welding_display.us_MainImprudence; // X
                                if((Val / 100) > 0){
                                    guc_Sub_16Led_display[10] = (Val / 100);
                                    bZero   = true;
                                }
                                else{
                                    guc_Sub_16Led_display[10] = ' ';
                                    bZero   = false;
                                }
                                Val = (Val % 100);
                                if((Val / 10) > 0){
                                    guc_Sub_16Led_display[11] = (Val / 10);
                                }
                                else{
                                    if(bZero) guc_Sub_16Led_display[11] = 0;
                                    else      guc_Sub_16Led_display[11] = ' ';
                                }
                                if((Val % 10) > 0)      guc_Sub_16Led_display[12] = (Val % 10);
                                else                    guc_Sub_16Led_display[12] = 0;
                                guc_Sub_16Led_display[13]   = ' ';
                                guc_Sub_16Led_display[14]   = ' ';
                                guc_Sub_16Led_display[15]   = ' ';
                                break;}
                    }
#endif
//--------------------------------------------
                    // 本溶接電流の算出
                    Val = gtt_End_welding_display.us_MainWeldingCurr;
                    
                    if((Val / 100) > 0){
                        ComuniPackRemo.Data.From.uc_Com_7led_data[0] = (Val / 100);
                        bZero   = true;
                    }
                    else{
                        ComuniPackRemo.Data.From.uc_Com_7led_data[0] = ' ';
                        bZero   = false;
                    }
                    Val = (Val % 100);
                    if((Val / 10) > 0){
                        ComuniPackRemo.Data.From.uc_Com_7led_data[1] = (Val / 10);
                    }
                    else{
                        if(bZero) ComuniPackRemo.Data.From.uc_Com_7led_data[1] = 0;
                        else      ComuniPackRemo.Data.From.uc_Com_7led_data[1] = ' ';
                    }
                    ComuniPackRemo.Data.From.uc_Com_7led_data[2] = (Val % 10);
                    // 本溶接電圧の算出
                    if (gss_Select_dital[P_VOLT_DISPLAY] == true) //2009.03.16
                    {
                        Val = gtt_End_welding_display.us_MainWeldingVolt;
                        if((Val / 100) > 0){
                            ComuniPackRemo.Data.From.uc_Com_7led_data[3] = (Val / 100);
                            bZero   = true;
                        }
                        else{
                            ComuniPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
                            bZero   = false;
                        }
                        Val = (Val % 100);
                        ComuniPackRemo.Data.From.uc_Com_7led_data[4] = ((Val / 10) | 0x80);
                        ComuniPackRemo.Data.From.uc_Com_7led_data[5] = (Val % 10);
                    }
                    // ７セグ表示制御の設定

                    ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no = 0x80;  // ７セグ 2009.03.16
                    
                    ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_off_flag = 1;       // 点滅表示の有り無し
                    ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_on_time     = 5;       // 点滅時点灯時間
                    ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_off_time    = 5;       // 点滅時消灯時間
                    ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Blink_times       = 50;     // 点滅繰り返し回数
//----- Phase19 by @Tny 2008/09/26 -----
#if false    // 表示するブロック番号（複数指定方式） 2009.03.16 del
                    switch(gss_Select_dital[P_SUB_MONITOR]){
                        case 0:{ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no = 0x80;break;}  // ７セグ
                        case 1:{ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no = 0x94;break;}  // ７セグ＋第３、５ブロック
                        case 2:{ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no = 0x90;break;}  // ７セグ＋第５ブロック
                    }
#endif
//--------------------------------------------
                    //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
					REMO_Send_CMD(0x23);
#else
					gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
                    gtt_End_welding_display.us_Display_time = (gss_Select_dital[P_DISPLAY_HOLD_TIME] * 10); // 溶接終了後表示時間 2009.03.16
                    //gtt_End_welding_display.us_Display_time = gtt_Ditail_work.us_Display_time; // 溶接終了後表示時間 2008.10.14 2009.03.16 del
                    //<><><> 溶接終了電流表示キャンセル関連 2009.03.31 <><><>
                    gtt_Ctrl_flag.End_welding_display_cansel = OFF;
                    if (gtt_End_welding_display.us_MainWeldingCurr == 0) gtt_Ctrl_flag.End_welding_display_cansel = ON; //2009.04.13
                    //<><><><><><><><><><><><><><><><><><><><><><><><><><><><>
                    gtt_End_welding_display.bProc2  = false;
                    //LED4 = ON;
                }
                else if(gtt_End_welding_display.bProc1){
                    if(gtt_End_welding_display.us_Display_time <= 0){
                        ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no = 0;    //表示するブロック番号
                        //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
						REMO_Send_CMD(0x23);
#else
						gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
                        gtt_End_welding_display.bProc1  = false;

                        //***** 2009.03.13 前の溶接測定値をクリアする*****
                        gss_Current_result_work = 0;
                        gss_Voltage_result_work = 0;
                        gsl_Current_result_work2 = 0; //2009.04.11
                        gsl_Voltage_result_work2 = 0; //2009.04.11
                        gtt_Ctrl_counter.Avr_result = 0;
                        gss_Weld_end_current = gss_Current_work = 0;
                        gss_Weld_end_voltage = gss_Voltage_work = 0;
                        gtt_Ctrl_flag.Weld_end_disp = OFF;
                        gss_Base_current_work = 0; //2009.03.24
                        gss_Base_voltage_work = 0; //2009.03.24
                        //**********************
                        //LED4 = OFF;
                    }
                    else{   // Phase15 by @Tny 2008/09/19
                        //REMO_Send_CMD(0x21);

                        //<><><> 溶接終了電流表示キャンセル 2009.03.31 <><><>
                        if (gtt_Ctrl_flag.End_welding_display_cansel == ON)
                        {
                            gtt_End_welding_display.us_Display_time = 0; //溶接電流表示点滅を強制終了 2009.03.31
                            gtt_Ctrl_flag.End_welding_display_cansel = OFF;
                        }
                        //<><><><><><><><><><><><><><><><><><><><><><><><><><>
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
						REMO_Send_CMD(0x21);
#else
						gb_RemCom_0x21	= true;
#endif
//-----------------------------------------------------------
                    }
                }
            }
            else{
                gtt_End_welding_display.bProc1  = false;
                gtt_End_welding_display.bProc2  = false;
                        //***** 2009.04.11 前の溶接測定値をクリアする*****
                        gss_Current_result_work = 0;
                        gss_Voltage_result_work = 0;
                        gsl_Current_result_work2 = 0; //2009.04.11
                        gsl_Voltage_result_work2 = 0; //2009.04.11
                        gtt_Ctrl_counter.Avr_result = 0;
                        gss_Weld_end_current = gss_Current_work = 0;
                        gss_Weld_end_voltage = gss_Voltage_work = 0;
                        gtt_Ctrl_flag.Weld_end_disp = OFF;
                        gss_Base_current_work = 0;
                        gss_Base_voltage_work = 0;
                        //**********************
            }
        }
    }
    if(((gtt_End_welding_display.bProc1)&&(gtt_End_welding_display.bProc2)) || ((gtt_End_welding_display.bProc1 == false)&&(gtt_End_welding_display.bProc2 == false))){
        ComuniPackRemo.Data.From.uc_Com_7led_data[0] = InternalPackRemo.Data.From.uc_Com_7led_data[0];
        ComuniPackRemo.Data.From.uc_Com_7led_data[1] = InternalPackRemo.Data.From.uc_Com_7led_data[1];
        ComuniPackRemo.Data.From.uc_Com_7led_data[2] = InternalPackRemo.Data.From.uc_Com_7led_data[2];
        ComuniPackRemo.Data.From.uc_Com_7led_data[3] = InternalPackRemo.Data.From.uc_Com_7led_data[3];
        ComuniPackRemo.Data.From.uc_Com_7led_data[4] = InternalPackRemo.Data.From.uc_Com_7led_data[4];
        ComuniPackRemo.Data.From.uc_Com_7led_data[5] = InternalPackRemo.Data.From.uc_Com_7led_data[5];
    }
    
#endif

    //ロボット接続時表示 2008.10.06
    if (guc_Robot_connect_flag == true)
    {
                  ComuniPackRemo.Data.From.uc_Com_7led_data[0] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[1] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[2] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
                  ComuniPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
                  
                  InternalPackRemo.Data.From.uc_Com_7led_data[0] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[1] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[2] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[3] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[4] = ' ';
                  InternalPackRemo.Data.From.uc_Com_7led_data[5] = ' ';
                  
             
                  
     }

//--------------------------------------------
//----- Phase13 by @Tny 2008/09/18 -----
#if true
            if(guc_Error_return_LED_control_A > 0){
                //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
				REMO_Send_CMD(0x23);
#else
				gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
            }
            else if(gb_Error_Display_Sending){   // エラー情報の送信要求がある？
//                gb_Error_blink  = true;     // エラー点滅制御要求フラグ	Phase27 by @Tny 2008.10.31 2008.11.17移植
                ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no = 0;       // 表示するブロック番号：全制御停止
                //REMO_Send_CMD(0x23);
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
				REMO_Send_CMD(0x23);
#else
				gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
            }
//-----------------------------------------------------------
//BP4 Phase9 by @Tny 2009.02.16
#if true
			// ＬＣＤコントラスト値データの送信判定
			//else if(ComuniPackRemo.Data.From.uc_Lcd_Bright != guc_Lcd_Bright){
			else if(ComuniPackRemo.Data.From.uc_Lcd_Bright != guc_Lcd_Bright + 3){ //2009.03.21
				//ComuniPackRemo.Data.From.uc_Lcd_Bright = guc_Lcd_Bright;
				ComuniPackRemo.Data.From.uc_Lcd_Bright = guc_Lcd_Bright + 3; //2009.03.21
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if false
				REMO_Send_CMD(0x37);
#else
				gb_RemCom_0x37	= true;
#endif
//-----------------------------------------------------------
			}
#endif
//-----------------------------------------------------------
            else{
//BP4 Phase10 by @Tny 2009.02.18
#if false
                REMO_Send_CMD(0x32); //2008.01.22
    	        REMO_Send_CMD(0x21);
                //REMO_Send_CMD(0x20); //2007.12.11
                REMO_Send_CMD(0x34); //2009.01.13
                REMO_Send_CMD(0x35); //2009.01.13
                REMO_Send_CMD(0x38); //2009.02.09
                REMO_Send_CMD(0x39); //2009.02.09
#else
				gb_RemCom_0x32	= true;
				gb_RemCom_0x21	= true;
				gb_RemCom_0x34	= true;
				gb_RemCom_0x35	= true;
				gb_RemCom_0x38	= true;
				gb_RemCom_0x39	= true;
#endif

//----- Phase25 by @Tny 2008/10/22 -----
#if true
                if((gub_System_err == OFF) && (gb_15SEG_LED_Error_Disp_Hold == false)){   // エラー発生していない？ かつ、エラー表示データ送信中ではない？
                    if(ComuniPackRemo.Data.From.t_Led_cntrol_data1.uc_Block_no == 0){   // 表示するブロック番号：全制御停止
                        //REMO_Send_CMD(0x23);    // リカバリ送信
//BP4 Phase10 by @Tny 2009.02.18
#if false
                        REMO_Send_CMD(0x23);    // リカバリ送信
#else
						gb_RemCom_0x23	= true;
#endif
//-----------------------------------------------------------
                    }
                }
#endif
//--------------------------------------------
//------ Phase31 by @Tny 2008.11.25 -----------------------------------
#if true
	            if((gub_System_err == OFF)&&(gtt_End_welding_display.bProc1 == false)&&(gtt_End_welding_display.bProc2 == false)){   // エラー発生していない？ かつ、溶接終了表示中ではない？
                	//REMO_Send_CMD(0x33); //2008.11.28実験のため削除
//BP4 Phase10 by @Tny 2009.02.18
#if false
                        REMO_Send_CMD(0x33);    // リカバリ送信
#else
						gb_RemCom_0x33	= true;
#endif
//-----------------------------------------------------------
				}
#endif
//---------------------------------------------------------------------
            }
#endif
//--------------------------------------------
// 2019.09.02
//----------------------
#ifdef __NEWCOM_PROTOCOL
            REMO_Send_CMD(0xA0);	//@@@@@@@@@@@@
            REMO_Send_CMD(0xA1);	//@@@@@@@@@@@@
            REMO_Send_CMD(0xA2);	//@@@@@@@@@@@@
            REMO_Send_CMD(0xB0);	//@@@@@@@@@@@@
            REMO_Send_CMD(0xC0);	//@@@@@@@@@@@@
#else
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if true
			if(gb_RemCom_0x20){
                REMO_Send_CMD(0x20);
				gb_RemCom_0x20	= false;
			}
			if(gb_RemCom_0x21){
                REMO_Send_CMD(0x21);
				gb_RemCom_0x21	= false;
			}
			if(gb_RemCom_0x22){
                REMO_Send_CMD(0x22);
				gb_RemCom_0x22	= false;
			}
			if(gb_RemCom_0x23){
                REMO_Send_CMD(0x23);
				gb_RemCom_0x23	= false;
			}
			if(gb_RemCom_0x32){
                REMO_Send_CMD(0x32);
				gb_RemCom_0x32	= false;
			}
			if(gb_RemCom_0x33){ // 2019.09.02
                REMO_Send_CMD(0x33);
				gb_RemCom_0x33	= false;
			}
			if(gb_RemCom_0x36){
                REMO_Send_CMD(0x36);
				gb_RemCom_0x36	= false;
			}
			if(gb_RemCom_0x37){
                REMO_Send_CMD(0x37);
				gb_RemCom_0x37	= false;
			}
			if(gb_RemCom_0x38){
                REMO_Send_CMD(0x38);
				gb_RemCom_0x38	= false;
			}
			if(gb_RemCom_0x39){
                REMO_Send_CMD(0x39);
				gb_RemCom_0x39	= false;
			}
			if(gb_RemCom_0x35){
                REMO_Send_CMD(0x35);
				gb_RemCom_0x35	= false;
			}
			if(gb_RemCom_0x34){		// 【注意】コントローラ側からのＡ／Ｄ取り込みコマンド送信タイミングのため、０ｘ３４コマンドを最後にすること!
                REMO_Send_CMD(0x34);
				gb_RemCom_0x34	= false;
			}
#endif
//-----------------------------------------------------------
#endif
//----------------------

           gtt_Ctrl_counter.Backup_100m = Timer._200m;
        }
//-----------------------------------------------------------
//BP4 Phase10 by @Tny 2009.02.18
#if true
        else if((Timer._100m != gtt_Ctrl_counter.Backup_100m) && (ComuniPackRemo.Data.bRS422Connection) && (gus_Initial_timer > 0)){
// 2019.09.02
//----------------------
#ifdef __NEWCOM_PROTOCOL
#else
//-----------------------------------------------------------
			if(gb_RemCom_0x20){
                REMO_Send_CMD(0x20);
				gb_RemCom_0x20	= false;
			}
			if(gb_RemCom_0x21){
                REMO_Send_CMD(0x21);
				gb_RemCom_0x21	= false;
			}
#endif
//----------------------
           gtt_Ctrl_counter.Backup_100m = Timer._100m;
		}
#endif
//-----------------------------------------------------------


}

    }


        //*************************************************************************************


        //****************************** ＰＣ（ＳＧシリーズ）送信部 ***************************
        if ( Timer._200m != gtt_Ctrl_counter.Backup_200m)
        {
            //if (guc_Sequence_mode == MAIN_WELD)
           //if ((guc_Sequence_mode >= SLOW_DOWN)) //test
           if ((guc_Sequence_mode >= HF_CTRL)) //test 2009.01.31
           {
                gtt_Internal_pack.Data.Out.BackUp.usWeldTimerIndividual++;
                ComuniPack.Data.From.BackUp.usWeldTimerIndividual = gtt_Internal_pack.Data.Out.BackUp.usWeldTimerIndividual / 5;
                gtt_Ctrl_counter.Total_weld_time++;
                if (gtt_Ctrl_counter.Total_weld_time >= 5)
                {
                   gtt_Internal_pack.Data.Out.BackUp.usWeldTimer = gtt_Internal_pack.Data.Out.BackUp.usWeldTimer + gtt_Ctrl_counter.Total_weld_time / 5;
                   ComuniPack.Data.From.BackUp.usWeldTimer = gtt_Internal_pack.Data.Out.BackUp.usWeldTimer;
                   gui_Total_weld_time_bkup = gtt_Internal_pack.Data.Out.BackUp.usWeldTimer;
                   gtt_Ctrl_counter.Total_weld_time = 0;
 
                   gtt_Internal_pack.Data.Out.BackUp.usWireFeed = gtt_Internal_pack.Data.Out.BackUp.usWireFeed + gtt_Internal_pack.Data.Out.usMotorRPM2;
                   ComuniPack.Data.From.BackUp.usWireFeed = gtt_Internal_pack.Data.Out.BackUp.usWireFeed;
                   gul_Total_wire_feed_bkup = gtt_Internal_pack.Data.Out.BackUp.usWireFeed;
                   
                }
           } else {
                ComuniPack.Data.From.BackUp.usWeldTimerIndividual = 0;
                gtt_Internal_pack.Data.Out.BackUp.usWeldTimerIndividual = 0;
                gtt_Ctrl_counter.Total_weld_time = 0;
           }


	/* 電流データを送信バッファにセットする */
           if (gtt_Internal_pack.Data.bRS232Connection)
           {
               //<><><><><> ＰＣ通信開始時初期化 <><><><><>
               if (gtt_Ctrl_flag.Rs232_init == ON)
               {
                   ComuniPack.Data.From.BackUp.usWeldTimer = gtt_Internal_pack.Data.Out.BackUp.usWeldTimer;
                   ComuniPack.Data.From.BackUp.usWeldTimes = gtt_Internal_pack.Data.Out.BackUp.usWeldTimes;
                   ComuniPack.Data.From.BackUp.usWireFeed = gtt_Internal_pack.Data.Out.BackUp.usWireFeed;
                   gtt_Ctrl_flag.Rs232_init = OFF;
                   //PC_Send_C3();
                   //PC_Send_C5();
               }
               //<><><><><><><><><><><><><><><><><><><><><>

               //<><><><><> 総合溶接時間リセット <><><><><>
               if (gtt_Ctrl_flag.Total_weld_time_reset == ON)
               {
                   gtt_Internal_pack.Data.Out.BackUp.usWeldTimer = 0;
                   ComuniPack.Data.From.BackUp.usWeldTimer = gtt_Internal_pack.Data.Out.BackUp.usWeldTimer;
                   gui_Total_weld_time_bkup = 0;
                   PC_Send_C3();
                   gtt_Ctrl_flag.Total_weld_time_reset = OFF;
               }
               //<><><><><><><><><><><><><><><><><><><><><>

               //<><><><><><> 溶接回数リセット <><><><><><>
               if (gtt_Ctrl_flag.Total_weld_count_reset == ON)
               {
                   gtt_Internal_pack.Data.Out.BackUp.usWeldTimes = 0;
                   ComuniPack.Data.From.BackUp.usWeldTimes = gtt_Internal_pack.Data.Out.BackUp.usWeldTimes;
                   gus_Total_weld_count_bkup = 0;
                   PC_Send_C3();
                   gtt_Ctrl_flag.Total_weld_count_reset = OFF;
               }
               //<><><><><><><><><><><><><><><><><><><><><>

               //<><><><><><><> 送給量リセット <><><><><><>
               if (gtt_Ctrl_flag.Total_wire_feed_reset == ON)
               {
                   gtt_Internal_pack.Data.Out.BackUp.usWireFeed = 0;
                   ComuniPack.Data.From.BackUp.usWireFeed = gtt_Internal_pack.Data.Out.BackUp.usWireFeed;
                   gul_Total_wire_feed_bkup = 0;
                   PC_Send_C5();
                   gtt_Ctrl_flag.Total_wire_feed_reset = OFF;
               }
               //<><><><><><><><><><><><><><><><><><><><><>


               //<><><><><> 指令値をＳＧ１へ送信 2007.4.6 <><><><><>
               if ((gtt_Internal_pack.Data.In.usWeldingCurr_pc_bk_up != gtt_Internal_pack.Data.In.usWeldingCurr) || (gtt_Internal_pack.Data.In.usWeldingVolt_pc_bk_up != gtt_Internal_pack.Data.In.usWeldingVolt))
               {
                  if (gtt_Internal_pack.Data.In.fWelderCheck.Bit1Sw.Motor_on == OFF) //インチングOFF時
                  {
                      gtt_Internal_pack.Data.In.usWeldingCurr_pc_bk_up = gtt_Internal_pack.Data.In.usWeldingCurr;
                      gtt_Internal_pack.Data.In.usWeldingVolt_pc_bk_up = gtt_Internal_pack.Data.In.usWeldingVolt;
                      ComuniPack.Data.From.usWeldingCurr = gtt_Internal_pack.Data.In.usWeldingCurr;
                      ComuniPack.Data.From.usWeldingVolt = gtt_Internal_pack.Data.In.usWeldingVolt;
                      PC_Send_D1();
                  }
               }
               //<><><><><><><><><><><><><><><><><><><><><><><><><><>


             //if ((guc_Sequence_mode >= SLOW_DOWN) && (guc_Sequence_mode < BURN_BACK))
             if ((guc_Sequence_mode >= HF_CTRL) && (guc_Sequence_mode < BURN_BACK)) //2009.01.31
             {
                  //switch(SoutPC_No){
                  //case 1:
                         PC_Send_C1();
                         PC_Send_C2();
                         PC_Send_C3();
                         PC_Send_C5();
                         //PC_Send_A6();
                         //SoutPC_No++;
                         //break;
                  //default:
                  //       SoutPC_No = 1;
                 // }
             }
             if (guc_Sequence_mode == IDLING)
             {
                 switch(SoutPC_No){
                 case 1:
                        SoutPC_No++;
                        break;
                 case 2:
                        if(Checker_flag == ON) { PC_Send_E1(); }
                        SoutPC_No++;
                        break;
                 case 3:
                       if(Checker_flag == ON)  { PC_Send_E2(); }
                       SoutPC_No++;
                       break;
                 case 4:
                       if(Checker_flag == ON)  { PC_Send_E3(); }
                       SoutPC_No++;
                       break;
                 case 5:
                       if(Checker_flag == ON)  
                       { 
                          PC_Send_E4();
                          SoutPC_No = 1;
                       }
                       SoutPC_No++;
                       break;
                  case 6:
                       //if (guc_Dsp_pc_data_flag == ON)
                       if ((guc_Dsp_pc_data_flag == ON) || (guc_Half_pc_data_flag == ON)) //2008.06.12 ihara
                       {
                           guc_A6_stop_flag = ON;
                       } else {
                           if(Checker_flag != ON){PC_Send_A6();}
                       }
                       SoutPC_No++;
                       break;
                  case 7:
                  case 8:
                  case 9:
                       SoutPC_No++;
                       break;
                  default:
                       SoutPC_No = 1;
                  }
             }
           }
             gtt_Ctrl_counter.Backup_200m = Timer._200m;
        }
        //*************************************************************************************


     if(((gtt_Internal_pack.Data.bRS422Connection)&&(gb_IIF_Select == false)) || gtt_Internal_pack.Data.bRS232Connection)   // 回線は開いている？ 2007.3.30	// <EXTERNAL IIF NEW(Phase 3)>	2011.10.13 by @Tny
     {
        //*********************** 溶接機のエラー状態をロボット、ＰＣに送信 ********************
        if (gtt_Internal_pack.Data.Out.fErrorCode1.ALL != ComuniPack.Data.From.fErrorCode1.ALL) //溶接・送給異常検出
        {
            gtt_Ctrl_flag.ErrorCode_set = ON;
        }
        if (gtt_Internal_pack.Data.Out.fErrorCode2.ALL != ComuniPack.Data.From.fErrorCode2.ALL) //電源異常検出
        {
            gtt_Ctrl_flag.ErrorCode_set = ON;
        }
        if (gtt_Internal_pack.Data.Out.fErrorCode3.ALL != ComuniPack.Data.From.fErrorCode3.ALL) //異常・停止信号検出
        {
            gtt_Ctrl_flag.ErrorCode_set = ON;
        }
        if (gtt_Ctrl_flag.ErrorCode_set == ON && gtt_Ctrl_flag.ErrorCode_snd == OFF && gtt_Ctrl_flag.Pri_volt_err_com_delay_set_flag == OFF) //2007.3.6変更 2007.3.13移植
        {
            ComuniPack.Data.From.fErrorCode1.ALL = gtt_Internal_pack.Data.Out.fErrorCode1.ALL;
            ComuniPack.Data.From.fErrorCode2.ALL = gtt_Internal_pack.Data.Out.fErrorCode2.ALL;
            ComuniPack.Data.From.fErrorCode3.ALL = gtt_Internal_pack.Data.Out.fErrorCode3.ALL;
            gtt_Ctrl_flag.ErrorCode_set = OFF;
            gtt_Ctrl_flag.ErrorCode_snd = ON;

            if (gtt_Internal_pack.Data.bRS422Connection) { GD2_Send_CMD(0xc4);} //ロボットにデータを送信
            if (gtt_Internal_pack.Data.bRS232Connection) { PC_Send_C4();      } //ＰＣにデータを送信
        }
        //*************************************************************************************


        if (gtt_Internal_pack.Data.Out.fPowerStatus.ALL != ComuniPack.Data.From.fPowerStatus.ALL) //溶接電源状態（電流検出）
        {
            ComuniPack.Data.From.fPowerStatus.ALL = gtt_Internal_pack.Data.Out.fPowerStatus.ALL;
            GD2_Send_CMD(0xc5);
        }
        if (gtt_Okcv.Send1 == ON)      //一元化電圧のロボットへの送信
        {
            gtt_Okcv.Send1 = OFF;
            GD2_Send_CMD(0xd1);
        }
        if (gtt_Okcv.Send2 == ON)      //ワイヤ送給速度のロボットへの送信
        {
            gtt_Okcv.Send2 = OFF;
            GD2_Send_CMD(0xd2);
        }
     }

     return;
}




//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of L2_rob_snd_class.c
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
